{
  "2": [
    "¿Quién eres?",
    "¿Eres profesor.a?",
    "¿Eres estudiante?",
    "¿Eres profesor.a o estudiante?",
    "¿Eres Tanya?",
    "¿Eres John?"
  ],
  "3": [
    "¿Tienes un.a amigo.a? ¿Quién es tu amigo o amiga?",
    "¿Tienes un.a amigo.a? ¿Tu amigo o amiga es profesor o profesora?",
    "¿Tienes un.a amigo.a? ¿Tu amigo o amiga es estudiante?",
    "¿Tienes un.a amigo.a? ¿Tu amigo o amiga es profesor/profesora o estudiante?",
    "¿Tienes madre? ¿Quién es tu madre?",
    "¿Tienes madre? ¿Tu madre es profesora?",
    "¿Tienes madre? ¿Tu madre es estudiante?",
    "¿Tienes madre? ¿Tu madre es profesora o estudiante?",
    "¿Tienes padre? ¿Quién es tu padre?",
    "¿Tienes padre? ¿Tu padre es profesor?",
    "¿Tienes padre? ¿Tu padre es estudiante?",
    "¿Tienes padre? ¿Tu padre es profesor o estudiante?",
    "¿Tienes hermano? ¿Quién es tu hermano?",
    "¿Tienes hermano? ¿Tu hermano es profesor?",
    "¿Tienes hermano? ¿Tu hermano es estudiante?",
    "¿Tienes hermano? ¿Tu hermano es profesor o estudiante?",
    "¿Tienes hermana? ¿Quién es tu hermana?",
    "¿Tienes hermana? ¿Tu hermana es profesora?",
    "¿Tienes hermana? ¿Tu hermana es estudiante?",
    "¿Tienes hermana? ¿Tu hermana es profesora o estudiante?",
    "¿Tienes hijo? ¿Quién es tu hijo?",
    "¿Tienes hijo? ¿Tu hijo es profesor?",
    "¿Tienes hijo? ¿Tu hijo es estudiante?",
    "¿Tienes hijo? ¿Tu hijo es profesor o estudiante?",
    "¿Tienes hija? ¿Quién es tu hija?",
    "¿Tienes hija? ¿Tu hija es profesora?",
    "¿Tienes hija? ¿Tu hija es estudiante?",
    "¿Tienes hija? ¿Tu hija es profesora o estudiante?",
    "¿Tienes esposo o esposa? ¿Quién es?",
    "¿Tienes esposo o esposa? ¿Es profesor o profesora?",
    "¿Tienes esposo o esposa? ¿Es estudiante?",
    "¿Tienes esposo o esposa? ¿Es profesor/profesora o estudiante?",
    "¿Tu madre tiene un.a amigo.a? ¿Quién es su amigo o amiga?",
    "¿Tu padre tiene un.a amigo.a? ¿Quién es su amigo o amiga?",
    "¿Tu hermano tiene un.a amigo.a? ¿Quién es su amigo o amiga?",
    "¿Tu hermana tiene un.a amigo.a? ¿Quién es su amigo o amiga?",
    "¿Tu hijo tiene un.a amigo.a? ¿Quién es su amigo o amiga?",
    "¿Tu hija tiene un.a amigo.a? ¿Quién es su amigo o amiga?",
    "¿Tu madre tiene madre? ¿Quién es ella?",
    "¿Tu madre tiene padre? ¿Quién es él?",
    "¿Tu madre tiene hermano? ¿Quién es él?",
    "¿Tu madre tiene hermana? ¿Quién es ella?",
    "¿Tu madre tiene hijo? ¿Quién es él?",
    "¿Tu madre tiene hija? ¿Quién es ella?",
    "¿Tu madre tiene esposo o esposa? ¿Quién es?",
    "¿Tu padre tiene madre? ¿Quién es ella?",
    "¿Tu padre tiene padre? ¿Quién es él?",
    "¿Tu padre tiene hermano? ¿Quién es él?",
    "¿Tu padre tiene hermana? ¿Quién es ella?",
    "¿Tu padre tiene hijo? ¿Quién es él?",
    "¿Tu padre tiene hija? ¿Quién es ella?",
    "¿Tu padre tiene esposo o esposa? ¿Quién es?",
    "¿Tu hermano tiene madre? ¿Quién es ella?",
    "¿Tu hermano tiene padre? ¿Quién es él?",
    "¿Tu hermano tiene hermano? ¿Quién es él?",
    "¿Tu hermano tiene hermana? ¿Quién es ella?",
    "¿Tu hermano tiene hijo? ¿Quién es él?",
    "¿Tu hermano tiene hija? ¿Quién es ella?",
    "¿Tu hermano tiene esposo o esposa? ¿Quién es?",
    "¿Tu hermana tiene madre? ¿Quién es ella?",
    "¿Tu hermana tiene padre? ¿Quién es él?",
    "¿Tu hermana tiene hermano? ¿Quién es él?",
    "¿Tu hermana tiene hermana? ¿Quién es ella?",
    "¿Tu hermana tiene hijo? ¿Quién es él?",
    "¿Tu hermana tiene hija? ¿Quién es ella?",
    "¿Tu hermana tiene esposo o esposa? ¿Quién es?",
    "¿Tu hijo tiene madre? ¿Quién es ella?",
    "¿Tu hijo tiene padre? ¿Quién es él?",
    "¿Tu hijo tiene hermano? ¿Quién es él?",
    "¿Tu hijo tiene hermana? ¿Quién es ella?",
    "¿Tu hijo tiene hijo? ¿Quién es él?",
    "¿Tu hijo tiene hija? ¿Quién es ella?",
    "¿Tu hijo tiene esposo o esposa? ¿Quién es?",
    "¿Tu hija tiene madre? ¿Quién es ella?",
    "¿Tu hija tiene padre? ¿Quién es él?",
    "¿Tu hija tiene hermano? ¿Quién es él?",
    "¿Tu hija tiene hermana? ¿Quién es ella?",
    "¿Tu hija tiene hijo? ¿Quién es él?",
    "¿Tu hija tiene hija? ¿Quién es ella?",
    "¿Tu hija tiene esposo o esposa? ¿Quién es?",
    "¿Tu amigo o amiga tiene madre? ¿Quién es ella?",
    "¿Tu amigo o amiga tiene padre? ¿Quién es él?",
    "¿Tu amigo o amiga tiene hermano? ¿Quién es él?",
    "¿Tu amigo o amiga tiene hermana? ¿Quién es ella?",
    "¿Tu amigo o amiga tiene hijo? ¿Quién es él?",
    "¿Tu amigo o amiga tiene hija? ¿Quién es ella?",
    "¿Tu amigo o amiga tiene esposo o esposa? ¿Quién es?",
    "¿Tienes familia?",
    "¿Tienes una tarjeta? ¿Qué tarjeta es?",
    "¿Tienes efectivo?",
    "¿Tienes café?",
    "¿Tienes té?",
    "¿Tienes agua?",
    "¿Tienes jugo?",
    "¿Tienes cerveza?",
    "¿Tu amigo o amiga tiene familia?",
    "¿Tu amigo o amiga tiene una tarjeta? ¿Qué tarjeta es?",
    "¿Tu amigo o amiga tiene efectivo?",
    "¿Tu amigo o amiga tiene café?",
    "¿Tu amigo o amiga tiene té?",
    "¿Tu amigo o amiga tiene agua?",
    "¿Tu amigo o amiga tiene jugo?",
    "¿Tu amigo o amiga tiene cerveza?"
  ]
}
