{
  "2": [
    "Who are you?",
    "Are you a teacher?",
    "Are you a student?",
    "Are you a teacher or a student?",
    "Are you Tanya?",
    "Are you John?"
  ],
  "3": [
    "Do you have a friend? Who is your friend?",
    "Do you have a friend? Is your friend a teacher?",
    "Do you have a friend? Is your friend a student?",
    "Do you have a friend? Is your friend a teacher or a student?",
    "Do you have a mother? Who is your mother?",
    "Do you have a mother? Is your mother a teacher?",
    "Do you have a mother? Is your mother a student?",
    "Do you have a mother? Is your mother a teacher or a student?",
    "Do you have a father? Who is your father?",
    "Do you have a father? Is your father a teacher?",
    "Do you have a father? Is your father a student?",
    "Do you have a father? Is your father a teacher or a student?",
    "Do you have a brother? Who is your brother?",
    "Do you have a brother? Is your brother a teacher?",
    "Do you have a brother? Is your brother a student?",
    "Do you have a brother? Is your brother a teacher or a student?",
    "Do you have a sister? Who is your sister?",
    "Do you have a sister? Is your sister a teacher?",
    "Do you have a sister? Is your sister a student?",
    "Do you have a sister? Is your sister a teacher or a student?",
    "Do you have a son? Who is your son?",
    "Do you have a son? Is your son a teacher?",
    "Do you have a son? Is your son a student?",
    "Do you have a son? Is your son a teacher or a student?",
    "Do you have a daughter? Who is your daughter?",
    "Do you have a daughter? Is your daughter a teacher?",
    "Do you have a daughter? Is your daughter a student?",
    "Do you have a daughter? Is your daughter a teacher or a student?",
    "Do you have a husband or a wife? is your husband or wife?",
    "Do you have a husband or a wife? Is your husband or wife a teacher?",
    "Do you have a husband or a wife? Is your husband or wife a student?",
    "Do you have a husband or a wife? Is your husband or wife a teacher or a student?",
    "Does your mother have a friend? Who is your her friend?",
    "Does your father have a friend? Who is your his friend?",
    "Does your brother have a friend? Who is your his friend?",
    "Does your sister have a friend? Who is your her friend?",
    "Does your son have a friend? Who is your his friend?",
    "Does your daughter have a friend? Who is your her friend?",
    "Does you mother have a mother? Who is she?",
    "Does you mother have a father? Who is he?",
    "Does you mother have a brother? Who is he?",
    "Does you mother have a sister? Who is she?",
    "Does you mother have a son? Who is he?",
    "Does you mother have a daughter? Who is she?",
    "Does you mother have a husband or wife? Who is he/she?",
    "Does you father have a mother? Who is she?",
    "Does you father have a father? Who is he?",
    "Does you father have a brother? Who is he?",
    "Does you father have a sister? Who is she?",
    "Does you father have a son? Who is he?",
    "Does you father have a daughter? Who is she?",
    "Does you father have a husband or wife? Who is he/she?",
    "Does you brother have a mother? Who is she?",
    "Does you brother have a father? Who is he?",
    "Does you brother have a brother? Who is he?",
    "Does you brother have a sister? Who is she?",
    "Does you brother have a son? Who is he?",
    "Does you brother have a daughter? Who is she?",
    "Does you brother have a husband or wife? Who is he/she?",
    "Does you sister have a mother? Who is she?",
    "Does you sister have a father? Who is he?",
    "Does you sister have a brother? Who is he?",
    "Does you sister have a sister? Who is she?",
    "Does you sister have a son? Who is he?",
    "Does you sister have a daughter? Who is she?",
    "Does you sister have a husband or wife? Who is he/she?",
    "Does you son have a mother? Who is she?",
    "Does you son have a father? Who is he?",
    "Does you son have a brother? Who is he?",
    "Does you son have a sister? Who is she?",  
    "Does you son have a son? Who is he?",
    "Does you son have a daughter? Who is she?",
    "Does you son have a husband or wife? Who is he/she?",
    "Does you daughter have a mother? Who is she?",
    "Does you daughter have a father? Who is he?",
    "Does you daughter have a brother? Who is he?",
    "Does you daughter have a sister? Who is she?",
    "Does you daughter have a son? Who is he?",
    "Does you daughter have a daughter? Who is she?",
    "Does you daughter have a husband or wife? Who is he/she?",
    "Does your friend have a mother? Who is she?",
    "Does your friend have a father? Who is he?",
    "Does your friend have a brother? Who is he?",
    "Does your friend have a sister? Who is she?",
    "Does your friend have a son? Who is he?",
    "Does your friend have a daughter? Who is she?",
    "Does your friend have a husband or wife? Who is he/she?",
    "Do you have a family?",
    "Do you have a card? What card is it?",
    "Do you have cash?",
    "Do you have coffee?",
    "Do you have tea?",
    "Do you have water?",
    "Do you have juice?",
    "Do you have beer?",
    "Does your friend have a family?",
    "Does your friend have a card? What card is it?",
    "Does your friend have cash?",
    "Does your friend have coffee?",
    "Does your friend have tea?",
    "Does your friend have water?",
    "Does your friend have juice?",
    "Does your friend have beer?"
  ],
  "4": [
  ]
}
