{
  "2": [
    "Chi sei?",
    "Sei un.a professore.ssa?",
    "Sei uno.a studente.ssa?",
    "Sei un.a professore.ssa o uno.a studente.ssa?",
    "Sei Tanya?",
    "Sei John?"
  ],
  "3": [
    "Hai un.a amico.a? Chi è il tuo amico o la tua amica?",
    "Hai un.a amico.a? Il tuo amico o la tua amica è un professore o una professoressa?",
    "Hai un.a amico.a? Il tuo amico o la tua amica è uno studente o una studentessa?",
    "Hai un.a amico.a? Il tuo amico o la tua amica è un professore/professoressa o uno studente/studentessa?",
    "Hai una madre? Chi è tua madre?",
    "Hai una madre? Tua madre è una professoressa?",
    "Hai una madre? Tua madre è una studentessa?",
    "Hai una madre? Tua madre è una professoressa o una studentessa?",
    "Hai un padre? Chi è tuo padre?",
    "Hai un padre? Tuo padre è un professore?",
    "Hai un padre? Tuo padre è uno studente?",
    "Hai un padre? Tuo padre è un professore o uno studente?",
    "Hai un fratello? Chi è tuo fratello?",
    "Hai un fratello? Tuo fratello è un professore?",
    "Hai un fratello? Tuo fratello è uno studente?",
    "Hai un fratello? Tuo fratello è un professore o uno studente?",
    "Hai una sorella? Chi è tua sorella?",
    "Hai una sorella? Tua sorella è una professoressa?",
    "Hai una sorella? Tua sorella è una studentessa?",
    "Hai una sorella? Tua sorella è una professoressa o una studentessa?",
    "Hai un figlio? Chi è tuo figlio?",
    "Hai un figlio? Tuo figlio è un professore?",
    "Hai un figlio? Tuo figlio è uno studente?",
    "Hai un figlio? Tuo figlio è un professore o uno studente?",
    "Hai una figlia? Chi è tua figlia?",
    "Hai una figlia? Tua figlia è una professoressa?",
    "Hai una figlia? Tua figlia è una studentessa?",
    "Hai una figlia? Tua figlia è una professoressa o una studentessa?",
    "Hai un marito o una moglie? Chi è tuo marito o tua moglie?",
    "Hai un marito o una moglie? Tuo marito o tua moglie è un professore o una professoressa?",
    "Hai un marito o una moglie? Tuo marito o tua moglie è uno studente o una studentessa?",
    "Hai un marito o una moglie? Tuo marito o tua moglie è un professore/professoressa o uno studente/studentessa?",
    "Tua madre ha un.a amico.a? Chi è il suo amico o la sua amica?",
    "Tuo padre ha un.a amico.a? Chi è il suo amico o la sua amica?",
    "Tuo fratello ha un.a amico.a? Chi è il suo amico o la sua amica?",
    "Tua sorella ha un.a amico.a? Chi è il suo amico o la sua amica?",
    "Tuo figlio ha un.a amico.a? Chi è il suo amico o la sua amica?",
    "Tua figlia ha un.a amico.a? Chi è il suo amico o la sua amica?",
    "Tua madre ha una madre? Chi è?",
    "Tua madre ha un padre? Chi è?",
    "Tua madre ha un fratello? Chi è?",
    "Tua madre ha una sorella? Chi è?",
    "Tua madre ha un figlio? Chi è?",
    "Tua madre ha una figlia? Chi è?",
    "Tua madre ha un marito o una moglie? Chi è?",
    "Tuo padre ha una madre? Chi è?",
    "Tuo padre ha un padre? Chi è?",
    "Tuo padre ha un fratello? Chi è?",
    "Tuo padre ha una sorella? Chi è?",
    "Tuo padre ha un figlio? Chi è?",
    "Tuo padre ha una figlia? Chi è?",
    "Tuo padre ha un marito o una moglie? Chi è?",
    "Tuo fratello ha una madre? Chi è?",
    "Tuo fratello ha un padre? Chi è?",
    "Tuo fratello ha un fratello? Chi è?",
    "Tuo fratello ha una sorella? Chi è?",
    "Tuo fratello ha un figlio? Chi è?",
    "Tuo fratello ha una figlia? Chi è?",
    "Tuo fratello ha un marito o una moglie? Chi è?",
    "Tua sorella ha una madre? Chi è?",
    "Tua sorella ha un padre? Chi è?",
    "Tua sorella ha un fratello? Chi è?",
    "Tua sorella ha una sorella? Chi è?",
    "Tua sorella ha un figlio? Chi è?",
    "Tua sorella ha una figlia? Chi è?",
    "Tua sorella ha un marito o una moglie? Chi è?",
    "Tuo figlio ha una madre? Chi è?",
    "Tuo figlio ha un padre? Chi è?",
    "Tuo figlio ha un fratello? Chi è?",
    "Tuo figlio ha una sorella? Chi è?",
    "Tuo figlio ha un figlio? Chi è?",
    "Tuo figlio ha una figlia? Chi è?",
    "Tuo figlio ha un marito o una moglie? Chi è?",
    "Tua figlia ha una madre? Chi è?",
    "Tua figlia ha un padre? Chi è?",
    "Tua figlia ha un fratello? Chi è?",
    "Tua figlia ha una sorella? Chi è?",
    "Tua figlia ha un figlio? Chi è?",
    "Tua figlia ha una figlia? Chi è?",
    "Tua figlia ha un marito o una moglie? Chi è?",
    "Il tuo amico o la tua amica ha una madre? Chi è?",
    "Il tuo amico o la tua amica ha un padre? Chi è?",
    "Il tuo amico o la tua amica ha un fratello? Chi è?",
    "Il tuo amico o la tua amica ha una sorella? Chi è?",
    "Il tuo amico o la tua amica ha un figlio? Chi è?",
    "Il tuo amico o la tua amica ha una figlia? Chi è?",
    "Il tuo amico o la tua amica ha un marito o una moglie? Chi è?",
    "Hai una famiglia?",
    "Hai una carta? Che carta è?",
    "Hai dei contanti?",
    "Hai del caffè?",
    "Hai del tè?",
    "Hai dell’acqua?",
    "Hai del succo?",
    "Hai della birra?",
    "Il tuo amico o la tua amica ha una famiglia?",
    "Il tuo amico o la tua amica ha una carta? Che carta è?",
    "Il tuo amico o la tua amica ha dei contanti?",
    "Il tuo amico o la tua amica ha del caffè?",
    "Il tuo amico o la tua amica ha del tè?",
    "Il tuo amico o la tua amica ha dell’acqua?",
    "Il tuo amico o la tua amica ha del succo?",
    "Il tuo amico o la tua amica ha della birra?"
  ]
}
