{
  "2": [
    "Wer bist du?",
    "Bist du Lehrer.in?",
    "Bist du Student.in?",
    "Bist du Lehrer.in oder Student.in?",
    "Bist du Tanya?",
    "Bist du John?"
  ],
  "3": [
    "Hast du ein.e Freund.in? Wer ist dein.e Freund.in?",
    "Hast du ein.e Freund.in? Ist dein.e Freund.in Lehrer.in?",
    "Hast du ein.e Freund.in? Ist dein.e Freund.in Student.in?",
    "Hast du ein.e Freund.in? Ist dein.e Freund.in Lehrer.in oder Student.in?",
    "Hast du eine Mutter? Wer ist deine Mutter?",
    "Hast du eine Mutter? Ist deine Mutter Lehrer.in?",
    "Hast du eine Mutter? Ist deine Mutter Student.in?",
    "Hast du eine Mutter? Ist deine Mutter Lehrer.in oder Student.in?",
    "Hast du einen Vater? Wer ist dein Vater?",
    "Hast du einen Vater? Ist dein Vater Lehrer?",
    "Hast du einen Vater? Ist dein Vater Student?",
    "Hast du einen Vater? Ist dein Vater Lehrer oder Student?",
    "Hast du einen Bruder? Wer ist dein Bruder?",
    "Hast du einen Bruder? Ist dein Bruder Lehrer?",
    "Hast du einen Bruder? Ist dein Bruder Student?",
    "Hast du einen Bruder? Ist dein Bruder Lehrer oder Student?",
    "Hast du eine Schwester? Wer ist deine Schwester?",
    "Hast du eine Schwester? Ist deine Schwester Lehrerin?",
    "Hast du eine Schwester? Ist deine Schwester Studentin?",
    "Hast du eine Schwester? Ist deine Schwester Lehrerin oder Studentin?",
    "Hast du einen Sohn? Wer ist dein Sohn?",
    "Hast du einen Sohn? Ist dein Sohn Lehrer?",
    "Hast du einen Sohn? Ist dein Sohn Student?",
    "Hast du einen Sohn? Ist dein Sohn Lehrer oder Student?",
    "Hast du eine Tochter? Wer ist deine Tochter?",
    "Hast du eine Tochter? Ist deine Tochter Lehrerin?",
    "Hast du eine Tochter? Ist deine Tochter Studentin?",
    "Hast du eine Tochter? Ist deine Tochter Lehrerin oder Studentin?",
    "Hast du einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hast du einen Ehemann oder eine Ehefrau? Ist er/sie Lehrer.in?",
    "Hast du einen Ehemann oder eine Ehefrau? Ist er/sie Student.in?",
    "Hast du einen Ehemann oder eine Ehefrau? Ist er/sie Lehrer.in oder Student.in?",
    "Hat deine Mutter ein.e Freund.in? Wer ist ihr.e Freund.in?",
    "Hat dein Vater ein.e Freund.in? Wer ist sein.e Freund.in?",
    "Hat dein Bruder ein.e Freund.in? Wer ist sein.e Freund.in?",
    "Hat deine Schwester ein.e Freund.in? Wer ist ihr.e Freund.in?",
    "Hat dein Sohn ein.e Freund.in? Wer ist sein.e Freund.in?",
    "Hat deine Tochter ein.e Freund.in? Wer ist ihr.e Freund.in?",
    "Hat deine Mutter eine Mutter? Wer ist sie?",
    "Hat deine Mutter einen Vater? Wer ist er?",
    "Hat deine Mutter einen Bruder? Wer ist er?",
    "Hat deine Mutter eine Schwester? Wer ist sie?",
    "Hat deine Mutter einen Sohn? Wer ist er?",
    "Hat deine Mutter eine Tochter? Wer ist sie?",
    "Hat deine Mutter einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hat dein Vater eine Mutter? Wer ist sie?",
    "Hat dein Vater einen Vater? Wer ist er?",
    "Hat dein Vater einen Bruder? Wer ist er?",
    "Hat dein Vater eine Schwester? Wer ist sie?",
    "Hat dein Vater einen Sohn? Wer ist er?",
    "Hat dein Vater eine Tochter? Wer ist sie?",
    "Hat dein Vater einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hat dein Bruder eine Mutter? Wer ist sie?",
    "Hat dein Bruder einen Vater? Wer ist er?",
    "Hat dein Bruder einen Bruder? Wer ist er?",
    "Hat dein Bruder eine Schwester? Wer ist sie?",
    "Hat dein Bruder einen Sohn? Wer ist er?",
    "Hat dein Bruder eine Tochter? Wer ist sie?",
    "Hat dein Bruder einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hat deine Schwester eine Mutter? Wer ist sie?",
    "Hat deine Schwester einen Vater? Wer ist er?",
    "Hat deine Schwester einen Bruder? Wer ist er?",
    "Hat deine Schwester eine Schwester? Wer ist sie?",
    "Hat deine Schwester einen Sohn? Wer ist er?",
    "Hat deine Schwester eine Tochter? Wer ist sie?",
    "Hat deine Schwester einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hat dein Sohn eine Mutter? Wer ist sie?",
    "Hat dein Sohn einen Vater? Wer ist er?",
    "Hat dein Sohn einen Bruder? Wer ist er?",
    "Hat dein Sohn eine Schwester? Wer ist sie?",
    "Hat dein Sohn einen Sohn? Wer ist er?",
    "Hat dein Sohn eine Tochter? Wer ist sie?",
    "Hat dein Sohn einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hat deine Tochter eine Mutter? Wer ist sie?",
    "Hat deine Tochter einen Vater? Wer ist er?",
    "Hat deine Tochter einen Bruder? Wer ist er?",
    "Hat deine Tochter eine Schwester? Wer ist sie?",
    "Hat deine Tochter einen Sohn? Wer ist er?",
    "Hat deine Tochter eine Tochter? Wer ist sie?",
    "Hat deine Tochter einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hat dein.e Freund.in eine Mutter? Wer ist sie?",
    "Hat dein.e Freund.in einen Vater? Wer ist er?",
    "Hat dein.e Freund.in einen Bruder? Wer ist er?",
    "Hat dein.e Freund.in eine Schwester? Wer ist sie?",
    "Hat dein.e Freund.in einen Sohn? Wer ist er?",
    "Hat dein.e Freund.in eine Tochter? Wer ist sie?",
    "Hat dein.e Freund.in einen Ehemann oder eine Ehefrau? Wer ist das?",
    "Hast du eine Familie?",
    "Hast du eine Karte? Welche Karte ist das?",
    "Hast du Bargeld?",
    "Hast du Kaffee?",
    "Hast du Tee?",
    "Hast du Wasser?",
    "Hast du Saft?",
    "Hast du Bier?",
    "Hat dein.e Freund.in eine Familie?",
    "Hat dein.e Freund.in eine Karte? Welche Karte ist das?",
    "Hat dein.e Freund.in Bargeld?",
    "Hat dein.e Freund.in Kaffee?",
    "Hat dein.e Freund.in Tee?",
    "Hat dein.e Freund.in Wasser?",
    "Hat dein.e Freund.in Saft?",
    "Hat dein.e Freund.in Bier?"
  ]
}
