{
  "2": [
    "Quem é você?",
    "Você é professor.a?",
    "Você é estudante?",
    "Você é professor.a ou estudante?",
    "Você é Tanya?",
    "Você é John?"
  ],
  "3": [
    "Você tem um.a amigo.a? Quem é seu.sua amigo.a?",
    "Você tem um.a amigo.a? Seu.sua amigo.a é professor.a?",
    "Você tem um.a amigo.a? Seu.sua amigo.a é estudante?",
    "Você tem um.a amigo.a? Seu.sua amigo.a é professor/professora ou estudante?",
    "Você tem mãe? Quem é sua mãe?",
    "Você tem mãe? Sua mãe é professora?",
    "Você tem mãe? Sua mãe é estudante?",
    "Você tem mãe? Sua mãe é professora ou estudante?",
    "Você tem pai? Quem é seu pai?",
    "Você tem pai? Seu pai é professor?",
    "Você tem pai? Seu pai é estudante?",
    "Você tem pai? Seu pai é professor ou estudante?",
    "Você tem irmão? Quem é seu irmão?",
    "Você tem irmão? Seu irmão é professor?",
    "Você tem irmão? Seu irmão é estudante?",
    "Você tem irmão? Seu irmão é professor ou estudante?",
    "Você tem irmã? Quem é sua irmã?",
    "Você tem irmã? Sua irmã é professora?",
    "Você tem irmã? Sua irmã é estudante?",
    "Você tem irmã? Sua irmã é professora ou estudante?",
    "Você tem filho? Quem é seu filho?",
    "Você tem filho? Seu filho é professor?",
    "Você tem filho? Seu filho é estudante?",
    "Você tem filho? Seu filho é professor ou estudante?",
    "Você tem filha? Quem é sua filha?",
    "Você tem filha? Sua filha é professora?",
    "Você tem filha? Sua filha é estudante?",
    "Você tem filha? Sua filha é professora ou estudante?",
    "Você tem marido ou esposa? Quem é?",
    "Você tem marido ou esposa? Ele.a é professor.a?",
    "Você tem marido ou esposa? Ele.a é estudante?",
    "Você tem marido ou esposa? Ele.a é professor/professora ou estudante?",
    "Sua mãe tem um.a amigo.a? Quem é o.a amigo.a dela?",
    "Seu pai tem um.a amigo.a? Quem é o.a amigo.a dele?",
    "Seu irmão tem um.a amigo.a? Quem é o.a amigo.a dele?",
    "Sua irmã tem um.a amigo.a? Quem é o.a amigo.a dela?",
    "Seu filho tem um.a amigo.a? Quem é o.a amigo.a dele?",
    "Sua filha tem um.a amigo.a? Quem é o.a amigo.a dela?",
    "Sua mãe tem mãe? Quem é ela?",
    "Sua mãe tem pai? Quem é ele?",
    "Sua mãe tem irmão? Quem é ele?",
    "Sua mãe tem irmã? Quem é ela?",
    "Sua mãe tem filho? Quem é ele?",
    "Sua mãe tem filha? Quem é ela?",
    "Sua mãe tem marido ou esposa? Quem é?",
    "Seu pai tem mãe? Quem é ela?",
    "Seu pai tem pai? Quem é ele?",
    "Seu pai tem irmão? Quem é ele?",
    "Seu pai tem irmã? Quem é ela?",
    "Seu pai tem filho? Quem é ele?",
    "Seu pai tem filha? Quem é ela?",
    "Seu pai tem marido ou esposa? Quem é?",
    "Seu irmão tem mãe? Quem é ela?",
    "Seu irmão tem pai? Quem é ele?",
    "Seu irmão tem irmão? Quem é ele?",
    "Seu irmão tem irmã? Quem é ela?",
    "Seu irmão tem filho? Quem é ele?",
    "Seu irmão tem filha? Quem é ela?",
    "Seu irmão tem marido ou esposa? Quem é?",
    "Sua irmã tem mãe? Quem é ela?",
    "Sua irmã tem pai? Quem é ele?",
    "Sua irmã tem irmão? Quem é ele?",
    "Sua irmã tem irmã? Quem é ela?",
    "Sua irmã tem filho? Quem é ele?",
    "Sua irmã tem filha? Quem é ela?",
    "Sua irmã tem marido ou esposa? Quem é?",
    "Seu filho tem mãe? Quem é ela?",
    "Seu filho tem pai? Quem é ele?",
    "Seu filho tem irmão? Quem é ele?",
    "Seu filho tem irmã? Quem é ela?",
    "Seu filho tem filho? Quem é ele?",
    "Seu filho tem filha? Quem é ela?",
    "Seu filho tem marido ou esposa? Quem é?",
    "Sua filha tem mãe? Quem é ela?",
    "Sua filha tem pai? Quem é ele?",
    "Sua filha tem irmão? Quem é ele?",
    "Sua filha tem irmã? Quem é ela?",
    "Sua filha tem filho? Quem é ele?",
    "Sua filha tem filha? Quem é ela?",
    "Sua filha tem marido ou esposa? Quem é?",
    "Seu.sua amigo.a tem mãe? Quem é ela?",
    "Seu.sua amigo.a tem pai? Quem é ele?",
    "Seu.sua amigo.a tem irmão? Quem é ele?",
    "Seu.sua amigo.a tem irmã? Quem é ela?",
    "Seu.sua amigo.a tem filho? Quem é ele?",
    "Seu.sua amigo.a tem filha? Quem é ela?",
    "Seu.sua amigo.a tem marido ou esposa? Quem é?",
    "Você tem família?",
    "Você tem um cartão? Que cartão é?",
    "Você tem dinheiro?",
    "Você tem café?",
    "Você tem chá?",
    "Você tem água?",
    "Você tem suco?",
    "Você tem cerveja?",
    "Seu.sua amigo.a tem família?",
    "Seu.sua amigo.a tem um cartão? Que cartão é?",
    "Seu.sua amigo.a tem dinheiro?",
    "Seu.sua amigo.a tem café?",
    "Seu.sua amigo.a tem chá?",
    "Seu.sua amigo.a tem água?",
    "Seu.sua amigo.a tem suco?",
    "Seu.sua amigo.a tem cerveja?"
  ]
}
