{
  "level_code": "A2",
  "level_name": "Հետաքրքրասեր Ուսանող (Curious Student)",
  "approximate_vocabulary_size": "approx. 1000-1500 words",
  "learning_outcomes": [
    "Can understand sentences and frequently used expressions related to areas of most immediate relevance (e.g. very basic personal and family information, shopping, local geography, employment).",
    "Can communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.",
    "Can describe in simple terms aspects of his/her background, immediate environment and matters in areas of immediate need."
  ],
  "language_focus_topics": [
    "Review A1: Noun cases (all, singular/plural), verb conjugations (present, basic past/future).",
    "Verbs: More irregular verbs. Perfect tenses (e.g., Present Perfect: -ել եմ; Past Perfect: -ել էի). Subjunctive mood (basic forms and uses, e.g., with որպեսզի - in order to, եթե - if).",
    "Adjectives: Comparative (-ագույն for some superlatives) and superlative forms. Agreement in more complex sentences.",
    "Pronouns: Reflexive (ինքս,ինքդ,ինքը) and demonstrative pronouns (այս, այդ, այն) with their declensions.",
    "Adverbs: Formation of adverbs from adjectives. Adverbs of degree (շատ, քիչ).",
    "Conjunctions: More coordinating and subordinating conjunctions (թեև - although, որովհետև - because).",
    "Participles: Basic introduction to adjectival use of participles (e.g., կարդացած գիրք - read book).",
    "Numerals: Ordinal numbers and their agreement. Basic fractions."
  ],
  "vocabulary_topics": [
    "Review A1 vocabulary.",
    "Describing people: Character, emotions, relationships.",
    "Housing: Renting an apartment, common household issues.",
    "Food & Drink: Discussing recipes, national cuisines, dietary preferences.",
    "Shopping: Complaining, asking for specific products, understanding sales.",
    "Travel & Transport: Planning trips in detail, booking accommodation, dealing with travel problems.",
    "Health & Body: Explaining health problems to a doctor, understanding simple medical advice.",
    "Work & Study: Describing responsibilities, projects, academic interests.",
    "Leisure & Hobbies: Discussing preferences in detail, sharing experiences.",
    "Nature & Environment: Basic environmental issues, weather patterns.",
    "Feelings & Emotions: Expressing a wider range of feelings with more nuance.",
    "Current events: Understanding simple news headlines or summaries."
  ],
  "pronunciation_focus_topics": [
    "Review A1/A0: Consonant distinctions, vowel harmony (if applicable to specific dialect focus), stress.",
    "Intonation in longer and more complex sentences, expressing different attitudes (surprise, doubt).",
    "Connected speech: assimilation and elision in faster speech.",
    "Pronunciation of loanwords adapted into Armenian.",
    "Rhythm and flow in short narratives or descriptions."
  ],
  "listening_comprehension_skills": [
    "Understand the main points of clear standard speech on familiar topics.",
    "Follow short narratives or simple conversations between native speakers if the topic is familiar.",
    "Identify key information in short radio/TV news segments or announcements."
  ],
  "reading_comprehension_skills": [
    "Understand short personal letters, emails, and blog posts on a variety of familiar topics.",
    "Find specific information in everyday materials such as simple official documents, articles, or user guides.",
    "Understand the main ideas of simplified newspaper articles or stories."
  ],
  "spoken_interaction_skills": [
    "Engage in conversations on familiar topics, exchanging information, opinions, and personal feelings.",
    "Handle most routine situations encountered in daily life or while travelling.",
    "Make and respond to suggestions, invitations, apologies, and express thanks with more elaboration.",
    "Discuss past experiences and future plans, providing details and reasons."
  ],
  "spoken_production_skills": [
    "Give clear, connected descriptions of people, places, events, or personal experiences.",
    "Narrate a story or recount events in a logical sequence, using appropriate tenses and linking words.",
    "Talk about future plans, intentions, and possibilities.",
    "Express opinions and preferences, providing simple justifications and examples."
  ],
  "written_interaction_skills": [
    "Write personal emails or messages to exchange detailed information, make plans, or express feelings.",
    "Participate in simple online discussions on familiar topics."
  ],
  "written_production_skills": [
    "Write connected texts on familiar topics (e.g., describing a trip, a cultural event, a personal opinion).",
    "Write a personal letter giving detailed news or describing experiences.",
    "Write short reports or summaries of factual information on familiar subjects."
  ],
  "cultural_competence_topics": [
    "Armenian family life and social structures.",
    "Important historical events and figures in Armenian history (basic overview).",
    "Traditional Armenian music, dance, and arts (basic awareness).",
    "Etiquette for social occasions and celebrations.",
    "Understanding the significance of the Armenian Diaspora.",
    "Regional differences within Armenia (basic).",
    "Common Armenian proverbs or expressions (simple ones)."
  ],
  "learning_strategies_suggestions": [
    "Practice using different verb tenses and moods in context.",
    "Read short authentic Armenian texts (e.g., news for young people, blogs).",
    "Watch Armenian TV shows or films with subtitles, focusing on comprehension of dialogues.",
    "Try to write short essays or stories in Armenian.",
    "Engage in conversations with native speakers, trying to use more complex sentences."
  ]
}