{
  "level_code": "B1",
  "level_name": "Հմուտ Ճանապարհորդ (Skillful Traveler)",
  "approximate_vocabulary_size": "approx. 2000-2500 words",
  "learning_outcomes": [
    "Can understand the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc.",
    "Can deal with most situations likely to arise whilst travelling in an area where the language is spoken.",
    "Can produce simple connected text on topics, which are familiar, or of personal interest.",
    "Can describe experiences and events, dreams, hopes & ambitions and briefly give reasons and explanations for opinions and plans."
  ],
  "language_focus_topics": [
    "Review of A2 grammar: Cases, verb tenses (including perfects), basic subjunctive, participles.",
    "Verbs: Conditional mood (կ + subjunctive forms). More complex uses of subjunctive mood (wishes, regrets, hypothetical situations).",
    "Verbs: Passive voice constructions.",
    "Verbs: Verbal nouns (-ել, -ալ endings) and their uses.",
    "Complex sentences: Subordinate clauses of concession (թեև, չնայած), result (այնպես որ), manner (ինչպես).",
    "Reported speech: Reporting statements, questions, and commands with more complex tense shifts.",
    "Relative clauses with various relative pronouns and adverbs.",
    "Impersonal constructions (e.g., կարելի է - it is possible, պետք է - it is necessary).",
    "Word order flexibility and stylistic choices."
  ],
  "vocabulary_topics": [
    "Work and career: Discussing job satisfaction, challenges, career changes, professional skills.",
    "Education: Discussing academic fields, research, educational goals, lifelong learning.",
    "Travel and tourism: Describing travel experiences in detail, cultural immersion, independent travel planning, problem-solving.",
    "Media and news: Analyzing news, discussing different viewpoints, understanding media bias (simple).",
    "Culture and arts: Discussing specific works, artists, genres; expressing critical opinions; Armenian cultural heritage.",
    "Health and lifestyle: Discussing public health, mental health, alternative medicine, healthy lifestyle choices.",
    "Social and environmental issues: Discussing current problems, causes and effects, potential solutions, civic engagement.",
    "Personal relationships: Describing complex relationships, emotions, conflicts, and support systems.",
    "Technology and communication: Impact of technology on society, digital citizenship, information sources.",
    "Abstract topics: justice, equality, tradition vs. modernity, cultural identity."
  ],
  "pronunciation_focus_topics": [
    "Review of A2 pronunciation: intonation for complex sentences, connected speech.",
    "Nuances of Armenian intonation to express sarcasm, enthusiasm, politeness.",
    "Rhythm and fluency in extended discourse.",
    "Pronunciation of formal vs. informal speech patterns.",
    "Understanding basic features of major dialects (e.g., Yerevan vs. Gyumri - if focusing on Eastern Armenian)."
  ],
  "listening_comprehension_skills": [
    "Understand the main points of clear standard speech on familiar and some unfamiliar topics.",
    "Understand the main points of radio or TV programs on current affairs or topics of personal/professional interest.",
    "Follow a lecture or presentation on a familiar topic if clearly structured."
  ],
  "reading_comprehension_skills": [
    "Understand texts dealing with everyday or job-related language, and descriptions of events, feelings, and wishes.",
    "Understand straightforward factual texts and articles on topics of interest.",
    "Grasp the main ideas and some details in newspaper articles or non-specialized magazine articles."
  ],
  "spoken_interaction_skills": [
    "Enter unprepared into conversations on a range of familiar topics.",
    "Deal with most situations likely to arise while travelling or living in an Armenian-speaking environment.",
    "Express and sustain opinions, providing explanations, arguments, and comments.",
    "Participate actively in discussions, clarifying points and responding to differing views."
  ],
  "spoken_production_skills": [
    "Produce connected discourse on a variety of topics, linking ideas coherently.",
    "Narrate stories, describe experiences, or relate plots of books/films with reasonable detail.",
    "Describe dreams, hopes, ambitions, and hypothetical situations, providing reasons and explanations.",
    "Present arguments and opinions on familiar topics in a clear, structured manner."
  ],
  "written_interaction_skills": [
    "Write personal letters or emails describing experiences, feelings, events, and opinions in detail.",
    "Respond to formal/informal written communications, providing detailed information or expressing well-reasoned views."
  ],
  "written_production_skills": [
    "Write clear, connected texts on a range of familiar subjects or topics of interest.",
    "Write descriptions of events, experiences, or personal reflections with good structure.",
    "Write a formal letter or email for practical purposes (e.g., letter of application, formal complaint).",
    "Express personal viewpoints and arguments on various topics in a structured text, providing supporting details."
  ],
  "cultural_competence_topics": [
    "Understanding social etiquette in various Armenian settings (formal, informal, urban, rural).",
    "Knowledge of key periods and figures in Armenian history and their significance.",
    "Appreciation of Armenian literature, music, and visual arts (key examples and genres).",
    "Understanding the values and beliefs that shape Armenian society.",
    "Awareness of the diversity within the Armenian diaspora and its connections to Armenia.",
    "Contemporary social and cultural trends in Armenia."
  ],
  "learning_strategies_suggestions": [
    "Read authentic Armenian materials regularly (news, articles, blogs, short stories).",
    "Practice using conditional and subjunctive moods in varied contexts.",
    "Watch Armenian films, TV series, and documentaries, focusing on understanding different speech styles.",
    "Engage in discussions on more abstract or complex topics.",
    "Write longer, well-structured texts (essays, reports) and get feedback."
  ]
}