{
  "level_code": "C1",
  "level_name": "Իմաստուն Խոսնակ (Wise Speaker)",
  "approximate_vocabulary_size": "approx. 7000-8000 words",
  "learning_outcomes": [
    "Can understand a wide range of demanding, longer texts, and recognise implicit meaning.",
    "Can express him/herself fluently and spontaneously without much obvious searching for expressions.",
    "Can use language flexibly and effectively for social, academic and professional purposes.",
    "Can produce clear, well-structured, detailed text on complex subjects, showing controlled use of organisational patterns, connectors and cohesive devices."
  ],
  "language_focus_topics": [
    "Mastery of the Armenian grammatical system, including all verb aspects, tenses, moods, voices, and complex case constructions, with attention to stylistic variations.",
    "Sophisticated use of participles, gerunds, and their respective phrases for concise and stylistically varied expression in formal, academic, and literary contexts.",
    "Advanced use and understanding of impersonal and passive constructions, and their stylistic implications across different genres.",
    "Mastery of complex sentence syntax, including all types of subordinate clauses, non-finite constructions, and their interplay for logical coherence and rhetorical effect.",
    "Stylistic use of word order, inversion, ellipsis, and other rhetorical figures for emphasis, nuance, and artistic effect.",
    "Understanding and occasional use of archaic or literary grammatical forms for specific stylistic purposes or characterization.",
    "Deep understanding of the interaction between morphology, syntax, semantics, and pragmatics in Armenian.",
    "Advanced use of a wide range of discourse markers and cohesive devices for structuring sophisticated arguments, narratives, academic texts, and formal speeches with clarity and elegance."
  ],
  "vocabulary_topics": [
    "Extensive vocabulary covering abstract, specialized, technical, and culturally specific topics across a wide range of academic, professional, and literary domains.",
    "Nuanced understanding and precise use of synonyms, antonyms, hyponyms, hypernyms, and related lexical items to convey fine shades of meaning, stylistic effects, and register appropriateness.",
    "Rich repertoire of idiomatic expressions, proverbs, aphorisms, colloquialisms, and cultural allusions, with a deep understanding of their appropriate context, register, connotations, and historical origins.",
    "Vocabulary for advanced academic and professional purposes, including specialized terminology for research, critical analysis, policy-making, and high-level communication.",
    "Advanced word formation: understanding etymology, roots (including influences from other languages like Persian, Russian, Greek), and complex affixation to deduce meaning, expand vocabulary actively, and appreciate linguistic creativity.",
    "Ability to use language creatively, including sophisticated wordplay, and to understand subtle humor, satire, and irony.",
    "Differentiating and appropriately using various stylistic layers of vocabulary (neutral, formal, informal, literary, technical, historical, poetic)."
  ],
  "pronunciation_focus_topics": [
    "Near-native pronunciation, intonation, rhythm, and stress across various speech styles and registers, with high accuracy and naturalness.",
    "Using prosody effectively and subtly to convey complex meanings, attitudes, irony, emotions, and pragmatic functions.",
    "Understanding and adapting to a wider range of regional Armenian accents (Eastern, Western, and sub-dialects) and sociolects, recognizing fine phonetic distinctions.",
    "Maintaining clarity, precision, and natural flow in rapid, complex, or formal speech, including public speaking and academic presentations."
  ],
  "listening_comprehension_skills": [
    "Understand extended speech in Armenian even when it is not clearly structured, contains dialectal features, or when relationships are only implied.",
    "Understand a wide range of television programs, films, plays, public speeches, and academic lectures without too much effort.",
    "Understand complex technical or academic discussions, even on unfamiliar topics, recognizing speaker's stance and nuances.",
    "Recognize and understand a wide range of idiomatic expressions, colloquialisms, and cultural references."
  ],
  "reading_comprehension_skills": [
    "Understand long and complex factual and literary texts in Armenian, appreciating distinctions of style, register, authorial intent, and literary technique.",
    "Understand specialized articles, academic papers, official documents, and longer technical instructions, even outside one's own field.",
    "Recognize implicit meaning, writer's stance, irony, persuasive techniques, and rhetorical strategies in diverse text types."
  ],
  "spoken_interaction_skills": [
    "Express him/herself fluently, spontaneously, and accurately, using complex language appropriately without much obvious searching for expressions.",
    "Use language flexibly and effectively for social, academic, and professional purposes, adapting register and style to the situation and audience with ease.",
    "Formulate ideas and opinions with precision, structure arguments logically, and relate contributions skilfully to those of other speakers in discussions and debates.",
    "Mediate and negotiate effectively in complex situations."
  ],
  "spoken_production_skills": [
    "Present clear, detailed, and well-structured descriptions or arguments on complex subjects, integrating sub-themes, developing particular points coherently, and rounding off with an appropriate conclusion.",
    "Give clear, well-structured, and engaging presentations or speeches on complex subjects, expanding and supporting ideas with subsidiary points, reasons, relevant examples, and appropriate rhetorical devices.",
    "Adapt style, register, and delivery to the audience and communicative purpose with sophistication."
  ],
  "written_interaction_skills": [
    "Write clear, well-structured, and stylistically appropriate letters, emails, or reports on complex subjects, adapting style, tone, and register to the intended reader and purpose with sophistication.",
    "Respond effectively, persuasively, and diplomatically to complex written communications."
  ],
  "written_production_skills": [
    "Write clear, well-structured, detailed, and engaging texts on complex subjects in various genres (essays, reports, articles, critiques, research papers), demonstrating command of appropriate academic, professional, or literary conventions.",
    "Write insightful summaries, analyses, and critical reviews of professional or literary works, demonstrating advanced critical thinking.",
    "Show controlled and sophisticated use of organisational patterns, connectors, and cohesive devices to produce coherent, elegant, and impactful text.",
    "Employ a wide range of stylistic devices appropriate to the text type and communicative goal."
  ],
  "cultural_competence_topics": [
    "In-depth and critical understanding of contemporary Armenian society, including complex social, political, economic, and ethical issues, and their historical context.",
    "Critical appreciation and analysis of Armenian literature (classical and modern), cinema, arts, music, philosophy, and intellectual traditions.",
    "Ability to interpret, discuss, and critique cultural subtext, humor, irony, allusions, and socio-cultural references with insight.",
    "Understanding of diverse cultural perspectives, regional variations, and social dynamics within Armenia and the Armenian diaspora."
  ],
  "learning_strategies_suggestions": [
    "Engage with a wide variety of authentic, complex Armenian texts and media from diverse fields.",
    "Practice writing different genres of complex texts, focusing on stylistic refinement and argumentation.",
    "Participate actively in academic or professional discussions and presentations in Armenian.",
    "Focus on advanced stylistic aspects of language, including register, tone, and rhetorical devices.",
    "Conduct research or undertake projects requiring advanced use of the Armenian language."
  ]
}