{
  "levels": [
    {
      "level_code": "A0",
      "level_name": "Baby",
      "approximate_vocabulary_size": "approx. 300-500 words",
      "learning_outcomes": [
        "Understand and use familiar everyday expressions and very basic phrases aimed at the satisfaction of needs of a concrete type.",
        "Introduce him/herself and others and can ask and answer simple questions about personal details such as where he/she lives, people he/she knows and things he/she has.",
        "Interact in a very simple way provided the other person talks slowly and clearly and is prepared to help.",
        "Recognize familiar names, words, and very simple sentences, for example on notices and posters or in catalogues."
      ],
      "language_focus_topics": [
        "am/is/are – positive, negative, question forms",
        "Subject pronouns (I, you, he, she, it, we, they)",
        "Possessive adjectives (my, your, his, her, its, our, their)",
        "This is … / These are ...",
        "Basic questions with 'be' (e.g., What's this?, Where is...?, Is this...?)",
        "Numbers 1-20 (as part of grammar/structure)"
      ],
      "vocabulary_topics": [
        "Numbers 1-20",
        "Basic everyday objects (e.g., book, pen, table, chair, door, window, bag, phone)",
        "Countries (own country and common ones e.g., UK, USA)",
        "Nationalities (own nationality and common ones e.g., British, American)",
        "Personal information (name: \"My name is...\", \"I am [Name].\")",
        "Immediate family relations (mother, father, sister, brother)",
        "Basic adjectives (e.g., big, small, good, bad, happy, sad, new, old)",
        "Basic colours (e.g., red, blue, green, yellow, black, white, orange, pink)"
      ],
      "pronunciation_focus_topics": [],
      "listening_comprehension_skills": [
        "Recognize familiar words and very basic phrases concerning him/herself, his/her family and immediate concrete surroundings when people speak slowly and clearly."
      ],
      "reading_comprehension_skills": [
        "Understand familiar names, words and very simple sentences, for example on notices and posters or in catalogues."
      ],
      "spoken_interaction_skills": [
        "Basic greetings (Hello, Hi, Good morning, Good afternoon, Good evening, Goodbye, Bye)",
        "Social expressions (Thank you, Please, You're welcome, Sorry, Excuse me)",
        "Introducing oneself (\"My name is [Name].\", \"I am [Name].\")",
        "Saying where you are from (I am from [country])",
        "Asking how someone is (How are you?) and responding (I'm fine, thanks.)",
        "Ask and answer simple questions on very familiar topics if the other person speaks slowly and clearly and is prepared to help."
      ],
      "spoken_production_skills": [
        "Use simple phrases and sentences to describe where he/she lives and people he/she knows.",
        "Produce simple isolated phrases and sentences."
      ],
      "written_interaction_skills": [],
      "written_production_skills": [
        "Write a short, simple postcard, for example sending holiday greetings (very basic).",
        "Fill in forms with personal details, for example entering his/her name, nationality and address on a hotel registration form (very basic)."
      ],
      "cultural_competence_topics": [],
      "learning_strategies_suggestions": []
    },
    {
      "level_code": "A1",
      "level_name": "Toddler",
      "approximate_vocabulary_size": "500-600 words",
      "learning_outcomes": [
        "Understand sentences and frequently used expressions related to areas of most immediate relevance (e.g., basic personal and family information, shopping, local geography, basic employment).",
        "Communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.",
        "Describe in simple terms aspects of his/her background, immediate environment, and matters in areas of immediate need.",
        "Read very short, simple texts and find specific, predictable information in simple everyday material such as advertisements, prospectuses, menus and timetables.",
        "Write short, simple notes and messages relating to matters in areas of immediate need (e.g., a shopping list, a simple postcard)."
      ],
      "language_focus_topics": [
        "Review & expand A0: am/is/are, subject pronouns, possessive adjectives",
        "Object pronouns (me, you, him, her, it, us, them)",
        "Possessive 's (John's book)",
        "have/has got – positive, negative, question (for possession)",
        "Present Simple – positive, negative, questions (with do/does)",
        "Articles (a/an, basic use of the)",
        "this/that/these/those",
        "Questions: expanded what/where, plus who, how many, how old, when, why (simple)",
        "There is/are (a/some/any, positive, negative, question)",
        "Prepositions of place (in, on, under, next to, behind, in front of, between)",
        "Prepositions of time (at (time), on (days), in (months, seasons, years) - basic)",
        "can/can't (ability, permission - simple)",
        "want/like/would like + noun / + to + verb (simple forms)",
        "Past Simple (regular verbs: -ed; common irregular verbs: be, have, go, do, say, see, eat, drink) – positive, negative, questions",
        "Present Continuous (for actions happening now) – positive, negative, questions",
        "Adverbs of frequency (always, usually, often, sometimes, never - placement with Present Simple)"
      ],
      "vocabulary_topics": [
        "Review & expand A0: numbers up to 100, more everyday objects, more countries/cities, more nationalities/languages, more family relations (e.g., aunt, uncle, cousin, grandparents)",
        "Jobs (common ones: teacher, doctor, student, driver, shop assistant, nurse, police officer)",
        "Personal information (address, phone number, email address - understanding and giving simply, age)",
        "Adjectives (describing objects, people, places – more variety e.g., beautiful, old, new, long, short, tall, tasty, cheap, expensive)",
        "Sports & activities (common ones: football, swim, read, watch TV, play games, listen to music, dance, cook)",
        "Food & drink (common items: apple, banana, bread, milk, water, coffee, tea, rice, chicken, fish, vegetables, fruit, juice, cheese)",
        "Everyday verbs (eat, drink, sleep, go, come, see, speak, listen, read, write, work, study, play, live, like, want, need, can, have, do)",
        "Verb + noun collocations (have breakfast/lunch/dinner, go to school/work/bed, do homework, watch TV, listen to music)",
        "Rooms in a house & furniture (living room, kitchen, bedroom, bathroom; table, chair, bed, sofa, TV, lamp, window, door)",
        "Places in a city/village (shop, school, park, supermarket, station, hospital, post office, bank, cafe, restaurant, cinema, library)",
        "Colours (expanded, e.g., brown, grey, purple)",
        "Clothing (shirt, trousers, dress, shoes, T-shirt, sweater, coat, hat, socks)",
        "Transport & travel (car, bus, train, bike, plane, walk, ticket, station)",
        "Days of the week, Months of the year, Seasons"
      ],
      "pronunciation_focus_topics": [],
      "listening_comprehension_skills": [],
      "reading_comprehension_skills": [],
      "spoken_interaction_skills": [
        "Review & expand A0: greetings, social expressions, introductions",
        "Telling the time (o'clock, half past, quarter past/to)",
        "Talking about days, dates, years (simple forms)",
        "Using the phone (basic: \"Hello, [Name] speaking.\" \"Can I speak to [Name]?\" \"He/she isn't here.\")",
        "Requests & offers (Can I have...? Would you like...? Here you are.)",
        "Asking for & giving simple directions (turn left/right, go straight on, it's on the left/right, next to...)",
        "In a restaurant (ordering food and drink: \"I'd like...\", \"Can I have the bill, please?\")",
        "Shopping (asking \"How much is it/are they?\", \"Can I help you?\", \"I'm looking for...\", buying simple items)",
        "Asking about problems & giving simple suggestions (\"What's wrong?\" \"What's the matter?\" \"Maybe you can/should...\")"
      ],
      "spoken_production_skills": [
        "Talking about abilities (I can/can't swim)",
        "Talking about likes/dislikes (I like/don't like...)",
        "Making simple future plans (Present Continuous for future: \"I'm meeting John tomorrow.\")"
      ],
      "written_interaction_skills": [],
      "written_production_skills": [
        "Writing a short, simple postcard or email (greetings, basic information, closing)",
        "Filling in simple forms (name, address, nationality)"
      ],
      "cultural_competence_topics": [],
      "learning_strategies_suggestions": []
    },
    {
      "level_code": "A2",
      "level_name": "Child",
      "approximate_vocabulary_size": "1000-1200 words",
      "learning_outcomes": [
        "to communicate with native speakers and express your opinions on topics that concern you personally, your family, your profession, and your hobbies;",
        "use past and future tenses in sentences;",
        "solve everyday and routine tasks (shopping at the store, filling up the car, going to the doctor, using public transport, etc.);",
        "to read and understand the meaning of a short text written in simple words on familiar or related topics;",
        "write letters, messages, and texts using familiar vocabulary."
      ],
      "language_focus_topics": [
        "to be – all forms – present & past",
        "possessive adjectives (review/consolidation)",
        "Present Simple – all forms (review/consolidation)",
        "possessive ’s (review/consolidation)",
        "There is / there are (review/consolidation, more complex scenarios)",
        "some / any / much / many / a lot of (quantifiers)",
        "this / that / these / those (review/consolidation)",
        "can / can’t / could / couldn’t (ability, permission, possibility in present & past)",
        "adverbs (of manner, frequency, time, place - basic)",
        "Past Simple – regular & irregular – all forms (consolidation and expansion)",
        "time expressions (for Past Simple, e.g., yesterday, last week, ago)",
        "countable / uncountable nouns (with quantifiers)",
        "like / would like (review/consolidation, more nuanced use)",
        "comparative & superlative adjectives",
        "have / have got (review/consolidation, present & past forms if applicable for `have`)",
        "prepositions (place - wider range; time - wider range; movement - basic, e.g. to, from, into)",
        "Present Continuous (review/consolidation for now, future arrangements)",
        "compounds (something / nothing / anything / everything, someone / no one / anyone / everyone, somewhere / nowhere / anywhere / everywhere)",
        "going to future (for plans and predictions)",
        "infinitive of purpose (e.g., I went to the shop to buy bread.)",
        "Present Perfect (ever / never / yet / just / for / since - for experiences and recent past)"
      ],
      "vocabulary_topics": [
        "personal information (expanded: e.g., date of birth, marital status - simple)",
        "adjectives (expanded range for descriptions, feelings, opinions)",
        "family relatives (expanded, e.g., nephew, niece, in-laws - basic recognition)",
        "jobs (wider range, including professions)",
        "free time activities (hobbies, sports, interests - more specific)",
        "houses and furniture (types of houses, more specific furniture, appliances - basic)",
        "adverb + adjective collocations (e.g., very good, really interesting)",
        "noun + noun collocations (e.g., bus stop, post office, credit card)",
        "verb + noun collocations (expanded from A1, e.g., make a mistake, do exercise, take a photo)",
        "feelings & emotions (happy, sad, angry, tired, bored, excited, worried, surprised)",
        "adverbs (of manner, e.g., slowly, quickly, carefully, well, badly)",
        "food & drink (wider range, ingredients, types of meals, cooking verbs - basic)",
        "town & country (places in town, countryside features, directions - expanded)",
        "describing someone (physical appearance: height, build, hair, eyes; personality: kind, friendly, funny, shy)",
        "clothing (expanded, including accessories, materials - basic)",
        "the weather (sunny, rainy, windy, cloudy, snowy, hot, cold, warm, cool, weather forecast terms - basic)",
        "travel & transport (expanded: types of transport, travel items, booking, airport/station vocabulary - basic)",
        "verbs often confused (e.g., take/get/have, say/tell, see/look/watch, lend/borrow)"
      ],
      "pronunciation_focus_topics": [],
      "listening_comprehension_skills": [],
      "reading_comprehension_skills": [],
      "spoken_interaction_skills": [
        "everyday conversations (participating in simple, routine exchanges)",
        "asking for & telling the time (consolidation and more nuanced expressions, e.g., ten to five)",
        "requests & offers (more polite forms, e.g., Could you...?, Would you mind...?, Can I help you with...?)",
        "describing numbers, days, dates (consolidation and use in context, ordinal numbers for dates)",
        "shopping (more complex interactions, asking about different products, sizes, returning items - simple)",
        "social expressions (expanded range for various situations, e.g., congratulations, good luck, sympathy - basic)",
        "making suggestions (e.g., Let's..., Why don't we...?, How about...?)",
        "asking for / giving travel information / directions (more detailed directions, understanding public transport information)"
      ],
      "spoken_production_skills": [
        "introducing yourself (consolidation and adding more detail)",
        "describing places and things (using adjectives, prepositions of place, simple comparative language)",
        "talking about you – your life, likes, job, what you do/did (using Present Simple, Past Simple, likes/dislikes vocab)",
        "retelling a story (short, simple story with basic sequencing, using Past Simple)",
        "comparing places and things (using basic comparative adjectives)",
        "describing personal experience (simple past events using Past Simple and time expressions)"
      ],
      "written_interaction_skills": [],
      "written_production_skills": [
        "blogs / emails (short, simple posts or messages on familiar topics)",
        "form filling (personal details on standard forms - consolidation and slightly more complex forms)",
        "descriptions of a place / room / holiday (simple descriptive paragraphs)",
        "semi-formal / informal emails & letters (simple structure, familiar topics, e.g., thanking someone, making an invitation)",
        "biography (short, simple biography of a known person or oneself)",
        "story (writing a very short, simple story with basic sequence)",
        "short poem (simple rhyming poems or acrostics)"
      ],
      "cultural_competence_topics": [],
      "learning_strategies_suggestions": []
    },
    {
      "level_code": "B1",
      "level_name": "Teenager",
      "approximate_vocabulary_size": "2000-2500 words",
      "learning_outcomes": [
        "Understands the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc.",
        "Can deal with most situations likely to arise whilst travelling in an area where the language is spoken.",
        "Can produce simple connected text on topics which are familiar, or of personal interest.",
        "Can describe experiences and events, dreams, hopes & ambitions and give simple reasons and explanations for opinions and plans."
      ],
      "language_focus_topics": [
        "Present Simple (review and contrast with other tenses)",
        "Present Continuous (review and contrast, future arrangements)",
        "Past Simple (review and contrast with other past tenses)",
        "Past Continuous (narrative use, contrast with Past Simple)",
        "Quantifiers: some / any / much / many / (a) few / (a) little / a lot / lots of (expanded use and nuances)",
        "Articles (review and more complex uses, e.g., zero article, geographical names)",
        "Verb patterns (verb + infinitive, verb + -ing, verb + preposition + -ing, verb + object + infinitive)",
        "Future forms: going to / will / Present Continuous (distinctions, predictions, spontaneous decisions, arrangements)",
        "what … like? (for descriptions and opinions)",
        "Comparatives & superlatives / as … as (review and more complex structures)",
        "Present Perfect (since, for, indefinite past e.g., experiences, ever, never, yet, just - review and consolidation)",
        "Modals: have to / don't have to (obligation), should / shouldn't (advice), must / mustn't (strong obligation/prohibition), might (possibility)",
        "Past Perfect & Narrative tenses (sequencing past events, use with Past Simple and Past Continuous)",
        "Conjunctions (time: when, while, as soon as, before, after, until; reason: because, as, so; contrast: but, although, however; purpose: to, so that)",
        "Passives (Present Simple and Past Simple passives)",
        "Present Perfect Continuous (for duration of unfinished actions, recent continuous actions with present results)",
        "First conditional (if + Present Simple, will / might + infinitive - real future possibilities)",
        "Second conditional (if + Past Simple, would + infinitive - hypothetical situations)"
      ],
      "vocabulary_topics": [
        "verbs with similar meaning (e.g., make/do, speak/talk, say/tell, lend/borrow, see/look/watch, hear/listen)",
        "adjective + noun collocations (expanded range, e.g., heavy traffic, strong accent, wide range)",
        "adjective + preposition combinations (e.g., good at, interested in, afraid of, proud of)",
        "adverbs (manner, degree, frequency, time, place - wider range and more nuanced use)",
        "food (types of cuisine, cooking methods, ingredients, ordering in restaurants - more detail)",
        "shops & shopping (types of shops, products, payment, complaints, online shopping - expanded)",
        "phrasal verbs (common literal and idiomatic phrasal verbs, e.g., get up, look for, take off, give up)",
        "synonyms & antonyms (common pairs for richer vocabulary)",
        "jobs & career plans (professions, work environment, job seeking, career ambitions)",
        "things & what they are made of (materials: wood, glass, metal, plastic, cotton, wool; objects and their composition)",
        "feelings (expanded range of emotions and expressions, e.g., delighted, miserable, anxious, relieved)",
        "noun + noun collocations (expanded, e.g., traffic jam, bus ticket, mobile phone, city centre)",
        "verb + noun collocations (expanded, e.g., make a decision, take a break, do a favour, keep a secret)",
        "adverb + adjective collocations (expanded, e.g., extremely tired, absolutely delicious, slightly different)",
        "prepositions + nouns (e.g., by car, on foot, at risk, in danger)",
        "prepositions + adjectives (e.g., similar to, different from, responsible for)",
        "prepositions + verbs (e.g., listen to, wait for, think about, agree with)"
      ],
      "pronunciation_focus_topics": [],
      "listening_comprehension_skills": [],
      "reading_comprehension_skills": [],
      "spoken_interaction_skills": [
        "social expressions / making conversation (initiating, maintaining, and closing conversations; turn-taking; showing interest)",
        "expressing certainty & doubt (e.g., I'm sure..., I think so, Maybe, I'm not sure if...)",
        "making plans / suggesting ideas (expanded from A2, more complex suggestions and negotiations)",
        "agreeing & disagreeing (politely, giving reasons)",
        "at the doctor (describing symptoms, understanding advice)",
        "exclamations with so/such (e.g., so tired, such a good film)",
        "on the phone (more complex conversations, making arrangements, leaving messages)",
        "expressing good/bad news (reacting appropriately, sharing news)",
        "saying thank you / goodbye (more formal and informal ways, expressing gratitude more deeply)"
      ],
      "spoken_production_skills": [
        "exchanging information (asking for and giving information on familiar and some unfamiliar topics)",
        "narrating a story (more detailed narratives, using appropriate tenses and linking words)",
        "describing people, places & situations (with more detail, using a wider range of vocabulary and grammatical structures)",
        "discussions / roleplays (participating in simple discussions, expressing opinions, taking on roles in simulated situations)",
        "giving opinions (expressing personal views, agreeing/disagreeing, giving simple reasons)"
      ],
      "written_interaction_skills": [],
      "written_production_skills": [
        "describing people & places (more detailed descriptions with a wider range of vocabulary and structure)",
        "writing about a holiday, book or film (simple reviews, summaries, recommendations)",
        "narratives (writing stories with clear sequence, using past tenses effectively, connecting ideas)",
        "emails (informal and semi-formal emails for various purposes: inquiries, arrangements, updates, apologies)",
        "writing for talking (preparing simple notes or scripts for presentations or talks)",
        "biographies (more detailed than A2, structuring information chronologically)",
        "pros & cons (presenting arguments for and against a topic in a simple structured way)",
        "form filling (more complex forms requiring detailed information)",
        "note-taking (extracting key information from texts or talks)"
      ],
      "cultural_competence_topics": [],
      "learning_strategies_suggestions": []
    },
    {
      "level_code": "B2",
      "level_name": "Amateur",
      "approximate_vocabulary_size": "4000-6000 words",
      "learning_outcomes": [
        "Understands the main ideas of complex texts on both concrete and abstract topics, including technical discussions in his/her field of specialisation.",
        "Can interact with a degree of fluency and spontaneity that makes regular interaction with native speakers possible without strain for either party.",
        "Can produce clear, detailed text on a wide range of subjects.",
        "Can explain a viewpoint on a topical issue giving the advantages and disadvantages of various options."
      ],
      "language_focus_topics": [
        "Review of the tense system (comprehensive understanding and application of all tenses)",
        "Question forms, Negatives & Short Answers (complex questions, tag questions, indirect questions, nuanced negative structures)",
        "Simple & Continuous (Present Tenses – active and passive, including stative verbs and their continuous forms where appropriate)",
        "Simple & Continuous (Past Tenses – active and passive, including narrative tenses and their interplay)",
        "Past Perfect (review and more complex uses, e.g., with reporting verbs, in unreal past conditionals)",
        "used to / would (for past habits and states, distinction between them)",
        "Modals & related verbs (advice, obligation & permission - review and expansion: e.g., ought to, be allowed to, be supposed to, had better)",
        "Future forms (will, going to, Present Continuous, Future Continuous, Future Perfect - distinctions and appropriate use)",
        "Future possibilities (modals for future speculation: may, might, could, will probably)",
        "Information questions (embedded questions, reported questions)",
        "Present Perfect (Simple & Continuous - review, consolidation, and nuanced differences for duration, completion, recentness)",
        "Verb Patterns (expanded: verb + object + to-infinitive, verb + gerund/infinitive with change in meaning, causative have/get)",
        "Conditionals (0, 1st, 2nd & 3rd conditionals, mixed conditionals, unless, in case, as long as)",
        "Modals of Probability (present and past: must be/have been, can't be/have been, may/might/could be/have been)",
        "Reported Speech, thoughts & questions (tense shifts, changes in pronouns/adverbs, reporting different types of sentences)",
        "Parts of Speech (in-depth understanding of word classes and their functions, word formation: prefixes, suffixes)"
      ],
      "vocabulary_topics": [
        "Positive & negative adjectives (wider range, nuanced meanings, prefixes/suffixes for forming opposites)",
        "Free time activities (more specific and niche hobbies, expressing preferences and opinions about them)",
        "Phrasal Verbs (1) literal vs idiomatic, separable vs inseparable (systematic study and expansion)",
        "Word transformations (forming different parts of speech from a root word, e.g., beauty -> beautiful -> beautifully)",
        "Describing people & things (more detailed and nuanced descriptions of appearance, personality, characteristics, qualities)",
        "Adjectives / Adverbs (wider range, collocations, intensifying adverbs, adverbial phrases)",
        "Describing likes & dislikes (more sophisticated ways to express preferences, indifference, aversion)",
        "Idioms (common idioms, especially those related to parts of the body, understanding figurative language)",
        "Words with a similar meaning (synonyms for more precise expression, register differences)",
        "Compound nouns (expanded range, understanding formation and stress patterns)",
        "Phrasal Verbs (2) common phrasal verbs with out / up (e.g., work out, find out, give up, set up)",
        "Reporting Verbs (e.g., suggest, recommend, warn, promise, admit, deny - beyond say/tell)",
        "Noun phrases (complex noun phrases, use of articles, determiners, quantifiers, pre/post-modification)"
      ],
      "pronunciation_focus_topics": [],
      "listening_comprehension_skills": [],
      "reading_comprehension_skills": [],
      "spoken_interaction_skills": [
        "Making small talk (initiating and maintaining informal conversations on a wider range of topics, showing active listening)",
        "Giving opinions (structuring opinions, supporting them with reasons, agreeing/disagreeing politely but firmly)",
        "Polite requests & offers (using more indirect and formal language where appropriate)",
        "Arranging to meet (negotiating times and places, confirming arrangements, handling changes)",
        "Shopping (handling more complex transactions, inquiries about products, discussing problems, understanding policies)",
        "Responding appropriately (agreement, sympathy, pleasure, surprise - using a wider range of expressions and showing nuance)",
        "Travel, number & money (discussing detailed travel plans, understanding complex information about schedules/prices, handling currency exchange and payments confidently)",
        "Describing in detail (providing rich descriptions of people, places, objects, events, experiences)",
        "Expressing attitude (conveying feelings and opinions through intonation, word choice, and idiomatic language)",
        "Clichés and comments (understanding and using common clichés and conversational fillers appropriately)",
        "Metaphors & Idioms (understanding and using common metaphors and idioms in context)",
        "Linking & Commenting (using discourse markers to structure speech, connect ideas, and add comments)"
      ],
      "spoken_production_skills": [
        "Exchanging information (confidently on a wide range of familiar and unfamiliar topics, handling abstract concepts)",
        "Talking about you (life, plans, feelings, concerns - with more depth, detail, and nuance)",
        "Recounting a story / play (detailed and engaging recounting, using appropriate narrative techniques)",
        "Giving opinions to real situations (analyzing situations, expressing well-reasoned opinions, speculating)",
        "Describing environmental issues (discussing causes, effects, and potential solutions related to the environment)",
        "Interviewing someone (preparing and asking appropriate questions, responding to answers, managing the interaction)",
        "Describing famous people & situations (providing detailed descriptions and discussing their significance)"
      ],
      "written_interaction_skills": [],
      "written_production_skills": [
        "Informal & Formal letters & emails (distinguishing register, appropriate tone and structure for various purposes)",
        "Narratives (more complex stories with developed plot, characters, and atmosphere)",
        "Writing a Biography (well-structured, detailed, and engaging biographies)",
        "Describing places & people (vivid and detailed descriptions, appealing to senses, using a rich vocabulary)",
        "Writing for talking (presentations - structuring content logically, using signposting language, preparing visuals)",
        "Arguments (Pros & Cons - developing arguments, providing evidence, structuring essays or reports)",
        "Expressing attitude (linking ideas - using cohesive devices, discourse markers, and appropriate vocabulary to convey stance and connect arguments)"
      ],
      "cultural_competence_topics": [],
      "learning_strategies_suggestions": []
    },
    {
      "level_code": "C1",
      "level_name": "A-star",
      "approximate_vocabulary_size": "8000-10000 words",
      "learning_outcomes": [
        "Understands a wide range of demanding, longer texts, and recognises implicit meaning.",
        "Can express him/herself fluently and spontaneously without much obvious searching for expressions.",
        "Can use language flexibly and effectively for social, academic and professional purposes.",
        "Can produce clear, well-structured, detailed text on complex subjects, showing controlled use of organisational patterns, connectors and cohesive devices."
      ],
      "language_focus_topics": [
        "Review of the tense system (simple, continuous, perfect, active & passive - mastery and nuanced application)",
        "Simple & Continuous (Present & Present Perfect - subtle distinctions, emphasis, advanced usage)",
        "Narrative tenses (mastery of Past Simple, Past Continuous, Past Perfect, Past Perfect Continuous for sophisticated storytelling)",
        "Questions & Negatives (inversion, cleft sentences for emphasis, advanced negative structures)",
        "Future forms (all forms reviewed, Future Perfect Continuous, future in the past)",
        "Expressions of quantity (nuanced use of quantifiers with countable/uncountable, partitives)",
        "Modals & related verbs (present situations - full range including deduction, speculation, criticism, regret: e.g., must, can't, may, might, should have, could have)",
        "Relative clauses (defining and non-defining, reduced relative clauses, whose, prepositions in relative clauses)",
        "Particles (phrasal verbs with multiple particles, understanding idiomatic usage, adverbial particles)",
        "Expressing habit (used to, would, be/get used to doing, Present Simple for habits - nuanced distinctions)",
        "Modals & related verbs (past situations - must have, can't have, might have, should have, would have for deduction, speculation, regret, criticism about the past)",
        "Hypothesizing (all conditionals including mixed, unreal past/present/future, wish/if only, other hypothetical structures)",
        "Articles & Determiners (mastery of definite, indefinite, zero article; complex uses of determiners)"
      ],
      "vocabulary_topics": [
        "Compound nouns (advanced and less common compounds, understanding nuances in meaning)",
        "Verbs (1) make / do (mastery of collocations and distinctions)",
        "Describing books & films (genre-specific vocabulary, critical language, expressing nuanced opinions)",
        "Prefixes and Suffixes (extensive knowledge for word formation and understanding new words)",
        "Antonyms in context (understanding and using antonyms for contrast and emphasis, register-specific antonyms)",
        "Verbs (2) take / put (mastery of phrasal verbs and idiomatic expressions with take and put)",
        "Lexis with variable stress (understanding how stress changes meaning or word class, e.g., REcord vs. reCORD)",
        "Verbs (3) get (mastery of numerous phrasal verbs and idiomatic expressions with get)",
        "Adverb collocations (with verbs, adjectives - for precision and idiomaticity, e.g., deeply regret, painfully aware)",
        "Homonyms & Homophones (distinguishing and using correctly, understanding potential for puns/humour)",
        "Synonyms (wide range for precision, style, and avoiding repetition; understanding subtle differences in connotation)",
        "Word pairs (binomials and trinomials, e.g., sick and tired, peace and quiet, lock, stock, and barrel)",
        "Describing life & time (abstract concepts, philosophical terms, nuanced expressions related to life stages and time perception)",
        "Describing numbers, fractions, dates & times (complex numerical expressions, formal and informal ways of expressing time/dates)"
      ],
      "pronunciation_focus_topics": [],
      "listening_comprehension_skills": [],
      "reading_comprehension_skills": [],
      "spoken_interaction_skills": [
        "Casual conversations (engaging fluently and spontaneously in extended informal discussions on a wide range of topics)",
        "Describing places (using rich, evocative language to create detailed and engaging descriptions)",
        "Echo & reply questions (using them naturally to show interest, surprise, or seek clarification)",
        "Indirect questions & statements (using them effectively for politeness, diplomacy, or reporting)",
        "Using the telephone (handling complex and formal phone conversations, including problem-solving and negotiations)",
        "Business expressions (common idioms and set phrases used in professional contexts)",
        "Exaggerating & Understating (using hyperbole and litotes for effect, understanding their pragmatic function)",
        "Exclaiming (using a wide range of exclamations to express strong emotions appropriately)",
        "Getting your point of view across (structuring arguments persuasively, using rhetorical devices, handling counter-arguments)",
        "Metaphors & Idioms (understanding and using a wide range of metaphors and idioms appropriately in various contexts)",
        "Linking & Commenting (mastery of discourse markers for cohesion, coherence, and expressing stance)"
      ],
      "spoken_production_skills": [
        "Exchanging information (fluently and accurately on complex and abstract topics, adapting style to audience and purpose)",
        "Giving and sharing opinions (expressing nuanced opinions, supporting them with complex arguments, engaging in debates)",
        "Speculating (about past, present, and future events with a high degree of accuracy and appropriate modal usage)",
        "Describing future possibilities (discussing potential scenarios, weighing options, using sophisticated future forms)",
        "Describing pros and cons (presenting balanced arguments on complex issues, using appropriate linking devices)",
        "Describing things in precise detail (using a wide range of specific vocabulary and complex sentence structures)",
        "Giving & responding to opinions (engaging in sophisticated discussions, challenging views politely, building on others' ideas)",
        "Talking about you / your dreams & plans (articulating personal ambitions, complex plans, and abstract ideas with clarity and detail)"
      ],
      "written_interaction_skills": [],
      "written_production_skills": [
        "Formal letters & emails (mastery of register, tone, structure for various professional and official purposes)",
        "Narratives (complex, engaging narratives with sophisticated plot development, characterisation, and stylistic devices)",
        "CV and cover letter (producing professional, tailored CVs and persuasive cover letters)",
        "Reports (structuring, writing, and presenting formal reports with clear findings and recommendations)",
        "Arguments (for and against - constructing well-reasoned, balanced, and persuasive essays or articles on complex topics)",
        "Describing places (evocative and detailed descriptions, using advanced vocabulary and imagery)",
        "Writing for talking (presentations - preparing well-structured, engaging, and persuasive presentations for diverse audiences)",
        "Improving style and cohesion (using a wide range of cohesive devices, advanced sentence structures, and stylistic choices for clarity, impact, and sophistication)"
      ],
      "cultural_competence_topics": [],
      "learning_strategies_suggestions": []
    },
    {
      "level_code": "C2",
      "level_name": "Maestro",
      "approximate_vocabulary_size": "16000-20000 words",
      "learning_outcomes": [
        "Understands with ease virtually everything heard or read.",
        "Can summarise information from different spoken and written sources, reconstructing arguments and accounts in a coherent presentation.",
        "Can express him/herself spontaneously, very fluently and precisely, differentiating finer shades of meaning even in more complex situations."
      ],
      "language_focus_topics": [
        "Avoiding repetition (using ellipsis, substitution, synonyms, varied sentence structures)",
        "Reduced infinitives (e.g., \"He was seen to leave.\" -> \"He was seen leaving.\" or understanding structures like \"Glad to have met you.\")",
        "Synonyms in context (mastery of selecting the most appropriate synonym for nuance, register, and collocation)",
        "Tense review – simple & continuous (complete mastery, subtle uses for emphasis or specific effects)",
        "Tense review – perfect & non-perfect (complete mastery, nuanced distinctions in aspect)",
        "Tense review – active & passive (complete mastery, stylistic choices for using active vs. passive voice)",
        "Adverb collocation (extensive range, including less common and more idiomatic collocations)",
        "Discourse markers (mastery of a wide range for sophisticated cohesion, coherence, and stance marking)",
        "Ways of adding emphasis (inversion, cleft sentences, fronting, use of intensifiers and emphatic do/did/does)",
        "Passive constructions (all forms, including passives with modals, infinitives, gerunds; impersonal passives)",
        "seem / appear (with infinitives, to be, that-clauses, for hedging and expressing perception)",
        "Modals – present, future & past - probability / obligation / permission / ability / habit (complete mastery of all forms and nuanced meanings)",
        "Past tenses to express unreal/unlikely situations (advanced use of Past Simple/Continuous/Perfect in hypothetical contexts beyond standard conditionals)",
        "Verb patterns (comprehensive knowledge of verbs followed by gerunds, infinitives, that-clauses, objects + infinitives, etc.)",
        "Intensifying adverbs (wide range, including formal/informal, and their collocations)",
        "Relatives & participles (all types of relative clauses, reduced relative clauses, participle clauses for conciseness and style)",
        "Linking devices – conjunctions / adverbs / infinitives / relative pronouns / participles (mastery for creating sophisticated, cohesive, and coherent text)"
      ],
      "vocabulary_topics": [
        "Phrasal verbs – literal & idiomatic (comprehensive mastery, including less common and abstract ones)",
        "Describing trends / comparing statistics (specialized vocabulary for data analysis and reporting)",
        "Synonyms & antonyms (extensive repertoire, ability to differentiate very fine shades of meaning)",
        "Proverbs & poetry (understanding and interpreting common proverbs, appreciating poetic language)",
        "Nouns from phrasal verbs (e.g., breakdown, lookout, setup - understanding and using)",
        "Metaphors & idioms (extensive knowledge, ability to use creatively and understand novel formations)",
        "Homonyms / homophones / homographs (mastery in distinguishing and using correctly, appreciating wordplay)",
        "Sports & activities (specialized and technical vocabulary for a wide range of sports and leisure pursuits)",
        "Geographical expressions – topographical / meteorological (detailed vocabulary for describing landscapes and weather phenomena)",
        "Adjective order (mastery of standard order for multiple adjectives before a noun)"
      ],
      "pronunciation_focus_topics": [],
      "listening_comprehension_skills": [],
      "reading_comprehension_skills": [],
      "spoken_interaction_skills": [],
      "spoken_production_skills": [
        "Engaging in discussions (participating effectively in complex discussions, debates, and academic or professional discourse)",
        "Managing information gaps (skillfully eliciting and providing information in complex scenarios)",
        "Participating in simulations (performing effectively in complex, unpredictable simulated real-world situations)",
        "Performing in roleplays (adopting and maintaining complex roles with authenticity and linguistic precision)",
        "Predicting and speculating (on complex outcomes with well-reasoned arguments and nuanced language)",
        "Retelling and summarising (accurately and coherently recounting or summarising complex information from various sources)"
      ],
      "written_interaction_skills": [],
      "written_production_skills": [
        "Formal & informal letters & emails (mastery of register, style, and tone for any purpose and audience)",
        "Storytelling (crafting sophisticated narratives with complex plots, character development, and stylistic flair)",
        "Business reports (producing professional, well-structured, analytical reports on complex topics)",
        "Pros & cons (writing highly persuasive and balanced arguments, anticipating counter-arguments)",
        "Giving personal opinions (articulating nuanced and well-supported opinions on a wide range of abstract and complex issues)",
        "Letters to a newspaper / magazine (writing articulate and persuasive pieces for publication)",
        "Describing personal experiences (recounting experiences with depth, reflection, and sophisticated language)",
        "Reviewing (books, films, events, etc. - writing insightful, critical, and engaging reviews)",
        "Personal profiles (crafting compelling and nuanced personal statements or biographies)",
        "Bringing writing to life (using advanced stylistic devices, rhetorical techniques, and vivid language to engage the reader)"
      ],
      "cultural_competence_topics": [],
      "learning_strategies_suggestions": []
    }
  ]
}
