{
  "level_code": "B1",
  "level_name": "Beajour Ampart (Proficient Traveler)",
  "approximate_vocabulary_size": "approx. 2000-2500 words",
  "learning_outcomes": [
    "Can understand the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc.",
    "Can deal with most situations likely to arise whilst travelling in an area where the language is spoken.",
    "Can produce simple connected text on topics, which are familiar, or of personal interest.",
    "Can describe experiences and events, dreams, hopes & ambitions and briefly give reasons and explanations for opinions and plans."
  ],
  "language_focus_topics": [
    "Review of A2 grammar: Tenses (present, past, future, conditional, imperfect), mutations, inflected prepositions, comparatives/superlatives.",
    "Verbs: Pluperfect tense (Amzer-dremenet peurdremenet - e.g., 'bet e oa'). Compound tenses with auxiliaries 'bezañ' and 'endevout/kaout'.",
    "Verbs: Subjunctive mood (Doare-sujañt) - present and imperfect forms and uses (e.g., after 'evit ma', 'a-raok ma').",
    "Verbal Noun: Expanded uses (e.g., as subject/object, after prepositions).",
    "Passive voice constructions.",
    "Reported speech (indirect statements, questions, commands - basic).",
    "Relative clauses with 'a', 'hag a', 'e', 'en deus', 'he deus', etc., introducing subject and object clauses.",
    "More complex prepositions and prepositional phrases.",
    "Conjunctions for expressing cause, consequence, concession, purpose.",
    "Word order flexibility and topicalization."
  ],
  "vocabulary_topics": [
    "Work and career: Job roles, responsibilities, work environment, applying for jobs, interviews, workplace communication.",
    "Education: School system, subjects, university studies, exams, academic life.",
    "Travel and tourism: Planning detailed trips, cultural tourism, describing experiences, dealing with problems.",
    "Media and news: Understanding main points of news articles, TV/radio news on current events, discussing opinions.",
    "Culture and arts: Discussing films, books, music, theatre; genres, artists, personal impressions, Breton specific arts (e.g., Kan ha diskan).",
    "Health and lifestyle: Discussing health issues, treatments, healthy living, sports, fitness.",
    "Social and environmental issues: Discussing local and global problems, causes and effects, potential solutions.",
    "Personal relationships: Describing friendships, family dynamics, expressing complex emotions.",
    "Technology and communication: Internet, social media, new technologies.",
    "Abstract topics: Society, politics (basic), traditions, identity."
  ],
  "pronunciation_focus_topics": [
    "Review of A2 pronunciation: intonation, rhythm, connected speech, dialectal awareness.",
    "Intonation in complex sentences, expressing nuances like irony or doubt.",
    "Fluency and natural rhythm in longer discourse.",
    "Pronunciation of loanwords and their adaptation into Breton.",
    "Understanding and producing speech in more formal vs. informal registers."
  ],
  "listening_comprehension_skills": [
    "Understand the main points of clear standard speech on familiar matters encountered in daily life, work, or school.",
    "Understand the main points of radio or TV programs on current affairs or topics of personal interest if delivery is clear.",
    "Follow a lecture or talk on a familiar topic if clearly structured."
  ],
  "reading_comprehension_skills": [
    "Understand texts written primarily in high-frequency everyday or job-related language.",
    "Understand the description of events, feelings, and wishes in personal correspondence.",
    "Read straightforward factual texts and articles on topics of interest."
  ],
  "spoken_interaction_skills": [
    "Enter unprepared into conversations on familiar topics.",
    "Deal with most situations likely to arise while travelling or living in Brittany.",
    "Express and sustain personal opinions, providing explanations and arguments.",
    "Participate actively in discussions, clarifying points and responding to others' views."
  ],
  "spoken_production_skills": [
    "Produce connected discourse on a variety of topics, linking ideas coherently.",
    "Narrate stories, describe experiences, or relate plots of books/films with reasonable detail.",
    "Describe dreams, hopes, ambitions, and hypothetical situations.",
    "Present arguments and opinions on familiar topics in a clear, structured manner."
  ],
  "written_interaction_skills": [
    "Write personal letters or emails describing experiences, feelings, events, and opinions in detail.",
    "Respond to formal/informal written communications, providing detailed information or expressing well-reasoned views."
  ],
  "written_production_skills": [
    "Write clear, connected texts on a range of familiar subjects or topics of interest.",
    "Write descriptions of real or imaginary events and experiences with good structure.",
    "Write a short formal letter or email for practical purposes.",
    "Express personal viewpoints and arguments on various topics in a structured text."
  ],
  "cultural_competence_topics": [
    "Understanding different levels of formality in Breton communication.",
    "Knowledge of significant Breton historical periods and figures.",
    "Appreciation of traditional and contemporary Breton literature, music, and arts.",
    "Understanding the values and beliefs that shape Breton society.",
    "The role of the Breton language in education and public life.",
    "Contemporary cultural and political movements in Brittany."
  ],
  "learning_strategies_suggestions": [
    "Read authentic Breton materials regularly (articles, short novels, online content).",
    "Practice using the subjunctive mood and compound tenses.",
    "Watch Breton-language television (e.g., France 3 Breizh, Brezhoweb) or films.",
    "Engage in discussions on more abstract or complex topics.",
    "Write longer, well-structured texts and seek feedback on style and grammar."
  ]
}