{
  "level_code": "B2",
  "level_name": "Kaozeer/ez Amplegad (Articulate Speaker)",
  "approximate_vocabulary_size": "approx. 3500-4500 words",
  "learning_outcomes": [
    "Can understand the main ideas of complex text on both concrete and abstract topics, including technical discussions in his/her field of specialisation.",
    "Can interact with a degree of fluency and spontaneity that makes regular interaction with native speakers quite possible without strain for either party.",
    "Can produce clear, detailed text on a wide range of subjects and explain a viewpoint on a topical issue giving the advantages and disadvantages of various options."
  ],
  "language_focus_topics": [
    "Comprehensive review of verb tenses, moods (indicative, conditional, subjunctive, imperative), aspects, and voices.",
    "Advanced use of verbal nouns and participles in complex constructions.",
    "Complex sentence syntax: various types of subordinate clauses (relative, concessive, causal, temporal, purpose, result), and their connectors.",
    "Nuances of consonant mutations and their exceptions or dialectal variations.",
    "Reported speech: reporting complex statements, questions, commands, and suggestions accurately.",
    "Modal verbs and expressions: expressing fine shades of meaning regarding certainty, probability, obligation, permission.",
    "Figurative language: understanding and using common metaphors, similes, and idiomatic expressions.",
    "Stylistic variations in word order and sentence structure for emphasis and register.",
    "Discourse markers for structuring arguments and ensuring cohesion in longer texts."
  ],
  "vocabulary_topics": [
    "Abstract concepts: In-depth discussion of societal issues, politics, economics, environment, education, culture, arts, science, technology.",
    "Expressing nuanced opinions, arguments, justifications, and counter-arguments.",
    "Vocabulary for formal discussions, debates, and presentations.",
    "Idioms, set expressions, and proverbs common in contemporary Breton.",
    "Understanding and using different registers (formal, neutral, informal, colloquial).",
    "Word formation: understanding prefixes, suffixes, and compounding to expand vocabulary.",
    "Synonyms and antonyms for precise expression and stylistic variation.",
    "Collocations: advanced verb-noun, adjective-noun combinations.",
    "Vocabulary related to Breton history, literature, and specific cultural domains."
  ],
  "pronunciation_focus_topics": [
    "Fine-tuning intonation for expressing complex attitudes, emotions, and pragmatic functions.",
    "Mastery of connected speech phenomena for natural flow.",
    "Recognition and understanding of main Breton dialects (KLT, Vannetais) and their key phonetic differences.",
    "Maintaining clarity and good pronunciation in extended speech and presentations."
  ],
  "listening_comprehension_skills": [
    "Understand extended speech and lectures in Breton and follow complex lines of argument if the topic is reasonably familiar.",
    "Understand most TV news, current affairs programs, and documentaries in Breton.",
    "Understand the majority of Breton films and plays in standard dialects."
  ],
  "reading_comprehension_skills": [
    "Read articles and reports concerned with contemporary problems in which writers adopt particular stances or viewpoints.",
    "Understand contemporary Breton literary prose and drama.",
    "Understand specialized articles outside one's immediate field with some dictionary use."
  ],
  "spoken_interaction_skills": [
    "Interact with fluency and spontaneity, making regular interaction with native speakers possible without undue strain.",
    "Take an active part in discussions in familiar and some unfamiliar contexts, accounting for and sustaining viewpoints.",
    "Handle linguistic aspects of negotiation, making a case, and managing disagreement."
  ],
  "spoken_production_skills": [
    "Present clear, detailed descriptions on a wide range of subjects related to one's field of interest or general topics.",
    "Explain a viewpoint on a topical issue, giving the advantages and disadvantages of various options, supporting arguments with evidence.",
    "Develop an argument systematically, highlighting significant points and relevant details."
  ],
  "written_interaction_skills": [
    "Write clear, detailed letters or emails on complex subjects, conveying information, ideas, or opinions effectively.",
    "Respond to complex inquiries or arguments in writing, adapting style as needed."
  ],
  "written_production_skills": [
    "Write clear, detailed texts (essays, reports, articles) on a wide range of subjects.",
    "Summarize information from different sources and present arguments coherently.",
    "Write reviews of films, books, or events, expressing justified opinions.",
    "Develop a reasoned argument in an essay or report, presenting different viewpoints and concluding."
  ],
  "cultural_competence_topics": [
    "Deeper understanding of Breton society, history, and contemporary issues.",
    "Ability to understand and appreciate cultural references, humor, and irony in Breton media and literature.",
    "Nuances of social and professional etiquette in various Breton contexts.",
    "Understanding different perspectives within Breton society and current cultural trends.",
    "Knowledge of key figures and events in Breton history, literature, and arts, and their impact."
  ],
  "learning_strategies_suggestions": [
    "Engage regularly with authentic Breton media (news, analytical programs, films, literature).",
    "Participate in debates or discussions in Breton.",
    "Write analytical essays or reports on complex topics.",
    "Seek feedback from native speakers on advanced grammar and style.",
    "Explore Breton internet forums and social media to understand contemporary language use."
  ]
}