{
  "level_code": "C1",
  "level_name": "Skrivagner/ez Barrek (Accomplished Writer/Speaker)",
  "approximate_vocabulary_size": "approx. 7000-8000 words",
  "learning_outcomes": [
    "Can understand a wide range of demanding, longer texts, and recognise implicit meaning.",
    "Can express him/herself fluently and spontaneously without much obvious searching for expressions.",
    "Can use language flexibly and effectively for social, academic and professional purposes.",
    "Can produce clear, well-structured, detailed text on complex subjects, showing controlled use of organisational patterns, connectors and cohesive devices."
  ],
  "language_focus_topics": [
    "Mastery of the Breton grammatical system, including all verb aspects, tenses, moods, voices, and complex syntactic structures (e.g., cleft sentences, topicalization).",
    "Sophisticated use of verbal nouns, participles, and other non-finite forms for concise and stylistically varied expression.",
    "Advanced understanding and application of the mutation system, including irregular mutations and dialectal variations.",
    "Mastery of complex sentence syntax, including all types of subordinate clauses and their connectors, for logical and rhetorical effect.",
    "Stylistic use of word order, inversion, and ellipsis for emphasis and artistic effect.",
    "Understanding and occasional use of older or literary grammatical forms.",
    "Deep understanding of the interaction between morphology, syntax, and pragmatics in Breton.",
    "Advanced use of discourse markers for structuring sophisticated arguments and narratives."
  ],
  "vocabulary_topics": [
    "Extensive vocabulary covering abstract, specialized, technical, and culturally specific topics.",
    "Nuanced understanding and precise use of synonyms, antonyms, and related lexical items.",
    "Rich repertoire of idiomatic expressions, proverbs, colloquialisms, and cultural allusions.",
    "Vocabulary for advanced academic and professional purposes.",
    "Advanced word formation: understanding etymology, roots, and complex affixation.",
    "Ability to use language creatively and understand subtle humor.",
    "Differentiating and appropriately using various stylistic layers of vocabulary."
  ],
  "pronunciation_focus_topics": [
    "Near-native pronunciation, intonation, rhythm, and stress across various speech styles.",
    "Using prosody effectively to convey subtle meanings, attitudes, and emotions.",
    "Understanding and adapting to a wider range of regional Breton accents and sociolects.",
    "Maintaining clarity and precision in rapid or complex speech, including public speaking."
  ],
  "listening_comprehension_skills": [
    "Understand extended speech in Breton even when it is not clearly structured or contains dialectal features.",
    "Understand a wide range of television programs, films, plays, and public speeches without too much effort.",
    "Understand complex technical or academic discussions, even on unfamiliar topics.",
    "Recognize and understand a wide range of idiomatic expressions and cultural references."
  ],
  "reading_comprehension_skills": [
    "Understand long and complex factual and literary texts in Breton, appreciating distinctions of style and authorial intent.",
    "Understand specialized articles, academic papers, and official documents.",
    "Recognize implicit meaning, writer's stance, irony, and persuasive techniques in various text types."
  ],
  "spoken_interaction_skills": [
    "Express him/herself fluently, spontaneously, and accurately, using complex language appropriately.",
    "Use language flexibly and effectively for social, academic, and professional purposes, adapting register and style.",
    "Formulate ideas and opinions with precision, structure arguments logically, and relate contributions skilfully in discussions.",
    "Mediate and negotiate effectively in complex situations."
  ],
  "spoken_production_skills": [
    "Present clear, detailed, and well-structured descriptions or arguments on complex subjects.",
    "Give clear, well-structured, and engaging presentations or speeches on complex subjects.",
    "Adapt style, register, and delivery to the audience and communicative purpose with sophistication."
  ],
  "written_interaction_skills": [
    "Write clear, well-structured, and stylistically appropriate letters, emails, or reports on complex subjects.",
    "Respond effectively and persuasively to complex written communications."
  ],
  "written_production_skills": [
    "Write clear, well-structured, detailed, and engaging texts on complex subjects in various genres.",
    "Write insightful summaries, analyses, and critical reviews of professional or literary works.",
    "Show controlled and sophisticated use of organisational patterns and cohesive devices.",
    "Employ a wide range of stylistic and rhetorical devices."
  ],
  "cultural_competence_topics": [
    "In-depth and critical understanding of contemporary Breton society, culture, and identity.",
    "Critical appreciation and analysis of Breton literature, music, arts, and traditions.",
    "Ability to interpret and discuss cultural subtext, humor, irony, and allusions.",
    "Understanding of diverse cultural perspectives and sociolinguistic issues within Brittany."
  ],
  "learning_strategies_suggestions": [
    "Engage with a wide variety of authentic, complex Breton texts and media.",
    "Practice writing different genres of complex texts, focusing on stylistic refinement.",
    "Participate actively in academic or professional discussions and presentations in Breton.",
    "Focus on advanced stylistic aspects of language, including register, tone, and rhetorical devices.",
    "Conduct research or undertake projects requiring advanced use of the Breton language."
  ]
}