{
  "level_code": "A1",
  "level_name": "Toddler (Elementary)",
  "approximate_vocabulary_size": "500-600 words",
  "learning_outcomes": [
    "Can understand and use familiar everyday expressions and basic phrases aimed at the satisfaction of needs of a concrete type related to personal life, daily routines, and immediate environment.",
    "Can introduce oneself and others in more detail, ask and answer questions about personal details (residence, possessions, acquaintances, simple likes/dislikes).",
    "Can interact in a simple way provided the other person talks slowly and clearly and is prepared to help, on familiar topics.",
    "Can understand short, simple written texts on familiar topics, such as simple descriptions or personal messages.",
    "Can write short, simple notes and messages."
  ],
  "language_focus_topics": [
    "Review & expand A0: am/is/are, subject pronouns, possessive adjectives, a/an, plurals.",
    "Object pronouns (me, you, him, her, it, us, them).",
    "Possessive 's (John's book) and possessive pronouns (mine, yours, his, hers).",
    "Verb 'have got' (for possession) – positive, negative, question forms.",
    "Present Simple tense – positive, negative, questions (with do/does) for routines and facts.",
    "Articles: a/an vs. the (basic uses).",
    "Demonstratives: this/that/these/those (expanded use).",
    "Question words: what, where, who, how many, how old, when, why (simple questions).",
    "There is/There are (positive, negative, question forms with some/any).",
    "Prepositions of place (in, on, under, next to, behind, in front of, between).",
    "Prepositions of time (at (time), on (days), in (months, seasons, years) - basic).",
    "Modal verb 'can/can't' (for ability and permission - simple).",
    "Verbs 'like', 'love', 'hate' + -ing or noun.",
    "Imperatives (positive and negative for simple instructions).",
    "Past Simple tense (verb 'to be': was/were).",
    "Past Simple tense (regular verbs: -ed endings and pronunciation /d/, /t/, /ɪd/).",
    "Past Simple tense (common irregular verbs: go, have, do, say, see, eat, drink, come, make, take, get, give).",
    "Adverbs of frequency (always, usually, often, sometimes, never - placement with Present Simple)."
  ],
  "vocabulary_topics": [
    "Review & expand A0: numbers up to 100, more everyday objects, more countries/cities, more nationalities/languages.",
    "Family & Relatives (expanded: e.g., aunt, uncle, cousin, grandparents, husband, wife, son, daughter, children).",
    "Jobs (common ones: teacher, doctor, student, driver, shop assistant, nurse, police officer, waiter/waitress, farmer).",
    "Personal information (address, phone number, email address - understanding and giving simply, date of birth).",
    "Adjectives (describing objects, people, places, feelings – more variety e.g., beautiful, old, new, long, short, tall, tasty, cheap, expensive, tired, hungry, thirsty, cold, hot).",
    "Daily routines & Free time activities (common ones: get up, have breakfast/lunch/dinner, go to school/work/bed, do homework, watch TV, listen to music, play games/sports, read, swim, dance, cook, meet friends, go shopping).",
    "Food & Drink (common items: apple, banana, orange, bread, milk, water, coffee, tea, rice, chicken, fish, meat, vegetables, fruit, juice, cheese, eggs, sandwich, cake, chocolate).",
    "Verb + noun collocations (have breakfast/lunch/dinner, go to school/work/bed, do homework, watch TV, listen to music, play football/tennis, take a photo).",
    "Rooms in a house & Furniture (living room, kitchen, bedroom, bathroom; table, chair, bed, sofa, TV, lamp, window, door, cupboard, shower, toilet).",
    "Places in a city/village (shop, school, park, supermarket, station, hospital, post office, bank, cafe, restaurant, cinema, library, museum, beach, market).",
    "Clothing (shirt, trousers, dress, shoes, T-shirt, sweater/jumper, coat, hat, socks, skirt, shorts, jacket, scarf, gloves).",
    "Transport & Travel (car, bus, train, bike, plane, boat, taxi, walk, ticket, station, airport, hotel).",
    "Days of the week, Months of the year, Seasons (spring, summer, autumn/fall, winter).",
    "The Weather (sunny, rainy, windy, cloudy, snowy, hot, cold, warm, cool).",
    "Ordinal numbers (1st to 31st for dates)."
  ],
  "pronunciation_focus_topics": [
    "Pronunciation of regular past simple -ed endings (/d/, /t/, /ɪd/).",
    "Common vowel sounds (short vs. long, e.g., ship/sheep, bit/beat, pull/pool).",
    "Common consonant sounds, including digraphs (e.g., sh /ʃ/, ch /tʃ/, th /θ/, /ð/, ng /ŋ/).",
    "Word stress in two-syllable words with common patterns (e.g., 'OBject' vs 'obJECT').",
    "Basic sentence stress (emphasizing key content words) and rhythm in short sentences.",
    "Intonation in Wh- questions (usually falling) and yes/no questions (rising).",
    "Silent letters in common words (e.g., 'know', 'write')."
  ],
  "listening_comprehension_skills": [
    "Understand familiar everyday expressions and very basic phrases related to personal details, family, shopping, local area, employment, when people speak slowly and clearly.",
    "Identify key information (e.g., names, numbers, times, places, prices) in short, clear, simple messages, announcements, and dialogues on familiar topics.",
    "Understand simple directions on how to get from one place to another (e.g., 'turn left', 'go straight').",
    "Follow short, simple dialogues about familiar topics (e.g., ordering food, making a simple purchase, asking for basic information)."
  ],
  "reading_comprehension_skills": [
    "Understand short, simple texts on familiar matters (e.g., simple descriptions of people or places, advertisements for common products, short personal messages/emails, simple menus, basic instructions).",
    "Find specific, predictable information in simple everyday material such as advertisements, prospectuses, menus, timetables, and event posters.",
    "Understand short simple personal letters or emails from friends or family about familiar topics like hobbies, daily routines, or recent activities.",
    "Follow a sequence of simple instructions for everyday tasks (e.g., a very simple recipe, instructions for a game)."
  ],
  "spoken_interaction_skills": [
    "Ask and answer questions about daily routines, likes/dislikes, abilities (can/can't), and simple past events.",
    "Tell the time (o'clock, half past, quarter past/to) and discuss schedules.",
    "Talk about days, dates, and simple past events with others.",
    "Make simple purchases in shops (asking for items, price, size, expressing what one wants).",
    "Order food and drink in a café or restaurant and make simple requests (e.g., \"I'd like...\", \"Can I have the bill, please?\", asking about ingredients simply).",
    "Ask for and give simple directions to a place within a familiar area.",
    "Make and respond to simple suggestions or invitations (e.g., \"Let's go...\", \"Would you like to...?\", accepting/declining politely).",
    "Use the phone for very simple interactions (e.g., making a simple inquiry, leaving a very brief message if prompted)."
  ],
  "spoken_production_skills": [
    "Describe one's family, friends, living conditions, educational background, and present or most recent job in a series of simple phrases and sentences.",
    "Talk about daily routines, habits, and preferences using Present Simple and adverbs of frequency.",
    "Express likes and dislikes simply (e.g., \"I like apples.\" \"I don't like spiders.\").",
    "Describe simple plans for the immediate future (e.g., Present Continuous for future: \"I'm meeting John tomorrow.\"; 'going to' for intentions).",
    "Talk about past activities and experiences in a simple way using Past Simple (e.g., \"Yesterday I went to the park and played football.\").",
    "Describe abilities using 'can' and 'can't' (e.g., \"I can swim, but I can't ski.\")."
  ],
  "written_interaction_skills": [
    "Write short, simple postcards, emails, or text messages to friends or family (e.g., holiday greetings, thank you notes, making simple arrangements, giving brief news).",
    "Reply to simple written questions or messages from others about familiar topics, providing requested information.",
    "Fill in a simple online form with personal details or for a basic request."
  ],
  "written_production_skills": [
    "Write short, simple notes and messages relating to matters in areas of immediate need or familiar topics (e.g., a shopping list, a reminder note to oneself, a short note to a family member).",
    "Describe a person, place, object, or a simple event in a few connected sentences, using basic descriptive adjectives.",
    "Write simple sentences and short paragraphs about daily routines, preferences, or past activities, using basic conjunctions (and, but, so, because).",
    "Fill in simple forms requiring personal details (name, address, nationality, date of birth, phone number)."
  ],
  "cultural_competence_topics": [
    "Common English foods and mealtime customs (e.g., typical breakfast, lunch, dinner; concept of 'packed lunch').",
    "Basic etiquette in shops, restaurants, and when using public transport in English-speaking environments.",
    "Awareness of major holidays in English-speaking countries (e.g., Christmas, Easter, Thanksgiving (US), Halloween) and some common associated traditions or symbols.",
    "Understanding of common units of measurement (e.g., pounds/kilos for weight, miles/kilometers for distance, common currency names like pound, dollar, euro - basic recognition and use).",
    "Politeness in requests and offers (e.g., using 'please', 'thank you', 'excuse me').",
    "Common ways of addressing people (first name vs. title + last name in different situations)."
  ],
  "learning_strategies_suggestions": [
    "Label more objects in English in your home and workplace/study area, including actions or states.",
    "Practice speaking English with a language partner, tutor, or in a group regularly, trying to use new vocabulary and grammar.",
    "Watch short English cartoons, simple vlogs, or educational videos designed for learners, with or without English subtitles, focusing on comprehension.",
    "Start a simple diary or journal in English, writing a few connected sentences each day about your activities, feelings, or plans.",
    "Use a bilingual dictionary to look up new words and try to make sentences with them; start using a simple learner's monolingual dictionary.",
    "Review new vocabulary and grammar points regularly using flashcards, apps, or by rewriting notes.",
    "Try to guess the meaning of unknown words from context in simple texts."
  ]
}