{
  "level_code": "A2",
  "level_name": "Child (Pre-Intermediate)",
  "approximate_vocabulary_size": "1000-1200 words",
  "learning_outcomes": [
    "Can understand sentences and frequently used expressions related to areas of most immediate relevance (e.g. very basic personal and family information, shopping, local geography, employment).",
    "Can communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.",
    "Can describe in simple terms aspects of his/her background, immediate environment and matters in areas of immediate need."
  ],
  "language_focus_topics": [
    "Review of A1: Verb 'to be' (present & past), 'have got', Present Simple, Past Simple (common regular & irregular verbs), can/can't, articles, possessives, demonstratives, basic prepositions.",
    "Present Continuous (for actions happening now, future arrangements - consolidation and expansion).",
    "Past Continuous (for background actions, interrupted actions in the past - e.g., I was watching TV when the phone rang).",
    "'Going to' future (for plans and predictions - consolidation).",
    "Present Perfect Simple (with ever, never, yet, just, already, for/since - for experiences and recent past actions with present relevance).",
    "Comparative and superlative adjectives (regular: -er/-est, more/most; common irregulars: good, bad, far).",
    "Adverbs of manner (e.g., slowly, carefully, well), frequency (consolidation), time, and place.",
    "Quantifiers (some, any, much, many, a lot of, (a) few, (a) little).",
    "Countable and uncountable nouns (basic understanding and use with quantifiers).",
    "Modal verbs: could (past ability, polite requests), should/shouldn't (advice), must/mustn't (obligation/prohibition), may/might (possibility).",
    "Infinitive of purpose (e.g., I went to the shop to buy bread).",
    "Question tags (simple, for confirmation - e.g., It's nice, isn't it?).",
    "Conjunctions: and, but, or, so, because, when, if (zero and first conditional review), before, after, while.",
    "Basic phrasal verbs (e.g., get up, turn on/off, look for)."
  ],
  "vocabulary_topics": [
    "Personal information (expanded: date/place of birth, marital status - simple, contact details).",
    "Family & relationships (describing family members and simple relationships in more detail).",
    "Jobs & professions (wider range, describing responsibilities simply).",
    "Daily routines & free time activities (describing a typical day, hobbies, sports, interests with more specific vocabulary).",
    "Housing & furniture (types of houses/flats, more specific furniture, basic appliances, describing one's home).",
    "Food & drink (wider range of food items, ingredients, types of meals, cooking verbs - basic, ordering in a restaurant with more options).",
    "Shopping (types of shops, clothes and accessories - materials, sizes, asking for help, making simple complaints, payment methods).",
    "Town & country (places in town, countryside features, giving and understanding more detailed directions).",
    "Describing people (physical appearance: height, build, hair style/color, eye color; personality traits: kind, friendly, funny, shy, serious, talkative).",
    "Feelings & emotions (happy, sad, angry, tired, bored, excited, worried, surprised, interested).",
    "The weather (describing current weather and simple forecasts).",
    "Travel & transport (types of transport, travel items, booking tickets, airport/station vocabulary, asking for travel information, simple problems).",
    "Health & body (common ailments and symptoms, parts of the body, visiting a doctor/dentist/pharmacy).",
    "Education (school subjects, timetable, simple descriptions of school life and studies)."
  ],
  "pronunciation_focus_topics": [
    "Common problematic vowel sounds and diphthongs (e.g., /eɪ/ as in 'say', /aɪ/ as in 'my', /ɔɪ/ as in 'boy').",
    "Common problematic consonant clusters (e.g., 'str-', 'thr-').",
    "Word stress in longer words (3+ syllables) with common patterns.",
    "Sentence stress and rhythm in longer sentences, identifying stressed and unstressed syllables.",
    "Intonation for different types of questions (yes/no, Wh-, tag questions) and expressing basic emotions (surprise, interest).",
    "Linking sounds more consistently in connected speech (e.g., consonant to vowel linking)."
  ],
  "listening_comprehension_skills": [
    "Understand sentences and frequently used expressions related to areas of most immediate relevance (e.g., personal and family information, shopping, local geography, employment).",
    "Identify the main point and key details in short, clear, simple messages, announcements, and straightforward dialogues on familiar topics.",
    "Understand simple instructions and directions when spoken clearly and at a moderate pace.",
    "Follow short, simple narratives about everyday events or familiar stories.",
    "Recognize speaker's basic attitude or emotion (e.g., happiness, sadness, surprise) in simple exchanges."
  ],
  "reading_comprehension_skills": [
    "Understand short, simple texts (e.g., personal letters/emails, simple articles on familiar topics, instructions, short stories for learners) containing high-frequency vocabulary.",
    "Find specific, predictable information in everyday material such as advertisements, brochures, menus, timetables, and short official documents.",
    "Understand the main idea and some supporting details in simple narratives or descriptive texts.",
    "Follow a sequence of instructions for a familiar task or process.",
    "Infer the meaning of some unknown words from context if the topic is familiar."
  ],
  "spoken_interaction_skills": [
    "Communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.",
    "Engage in short social exchanges (e.g., greeting, asking how someone is, reacting to news, making simple arrangements to meet).",
    "Handle simple transactions in shops, post offices, or banks; order food, ask for services, and make simple complaints.",
    "Discuss past events, experiences, and future plans simply.",
    "Make and respond to suggestions, invitations, and apologies with reasons.",
    "Ask for and give directions or information about places, using prepositions and common landmarks.",
    "Express basic opinions, preferences, agreement/disagreement with simple justifications."
  ],
  "spoken_production_skills": [
    "Describe one’s family, other people, living conditions, educational background, and present or most recent job using a series of simple connected sentences.",
    "Give short, basic descriptions of events, activities, and personal experiences (past, present, and future plans), linking ideas with basic connectors.",
    "Describe habits, routines, and what one likes or dislikes about something, providing simple reasons.",
    "Compare two people or things in a simple way (e.g., \"This car is bigger than that one.\").",
    "Retell a short story or the plot of a film/book in simple terms."
  ],
  "written_interaction_skills": [
    "Write short, simple notes, messages, emails, or social media posts related to everyday situations and familiar topics.",
    "Respond to simple written questions or requests for information with relevant details in short, connected texts.",
    "Make simple written arrangements or confirm plans (e.g., for a meeting or outing)."
  ],
  "written_production_skills": [
    "Write a series of simple phrases and sentences linked with basic connectors (and, but, because, so, then, after, before) to describe experiences, events, or feelings.",
    "Write a short, simple personal letter, email, or blog post describing an event, a trip, personal impressions, or future plans.",
    "Write a simple description of a person, place, familiar object, or daily routine.",
    "Fill in forms requiring more detailed personal information (e.g., simple application forms)."
  ],
  "cultural_competence_topics": [
    "Understanding common customs related to hospitality, invitations, gift-giving, and punctuality in English-speaking cultures.",
    "Awareness of appropriate topics for small talk and topics to avoid in initial conversations.",
    "Recognizing differences in politeness conventions (e.g., use of 'please', 'thank you', forms of address for strangers vs. acquaintances).",
    "Familiarity with some famous landmarks, cultural icons, or traditions from major English-speaking countries (e.g., specific holidays, types of food, popular sports).",
    "Basic understanding of how public services work (e.g., post office, public transport).",
    "Awareness of non-verbal communication cues (e.g., eye contact, personal space - basic)."
  ],
  "learning_strategies_suggestions": [
    "Try to use new vocabulary and grammar in short conversations or written messages, focusing on connecting ideas.",
    "Use a monolingual learner's dictionary for English to understand definitions and see more examples of usage.",
    "Practice writing short paragraphs or simple stories about familiar topics, and ask for feedback if possible.",
    "Watch English videos or TV programs suitable for learners, with English subtitles, and try to summarize what happened.",
    "Set specific, measurable, achievable, relevant, and time-bound (SMART) goals for language learning.",
    "Review Past Simple irregular verbs regularly.",
    "Pay attention to collocations (words that often go together)."
  ]
}