{
  "level_code": "B1",
  "level_name": "Teenager (Intermediate)",
  "approximate_vocabulary_size": "2000-2500 words",
  "learning_outcomes": [
    "Can understand the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc.",
    "Can deal with most situations likely to arise whilst travelling in an area where the language is spoken.",
    "Can produce simple connected text on topics, which are familiar, or of personal interest.",
    "Can describe experiences and events, dreams, hopes & ambitions and briefly give reasons and explanations for opinions and plans."
  ],
  "language_focus_topics": [
    "Review of A2 tenses: Present Simple, Present Continuous, Past Simple, Present Perfect, 'going to' future.",
    "Past Continuous (for background actions, interrupted actions, simultaneous past actions).",
    "Past Perfect Simple (for sequencing past events, before another past event).",
    "Future Simple (will - for predictions, spontaneous decisions, offers, promises).",
    "Future Continuous (for actions in progress at a specific future time).",
    "Future Perfect Simple (for actions completed by a specific future time).",
    "Verb patterns: verb + infinitive (e.g., want to, decide to), verb + -ing (e.g., enjoy doing, stop doing), verb + preposition + -ing (e.g., interested in doing).",
    "Comparatives & superlatives (regular and irregular adjectives and adverbs, as...as, less...than, not as...as).",
    "Modals: have to/don't have to (obligation/lack of obligation), should/shouldn't (advice), must/mustn't (strong obligation/prohibition), might/may (possibility), could (past ability, polite requests, possibility).",
    "Conditionals: Zero (general truths), First (real future possibilities: if + Present Simple, ... will + infinitive), Second (hypothetical present/future situations: if + Past Simple, ... would + infinitive).",
    "Passive voice (Present Simple and Past Simple passives).",
    "Reported speech: simple statements, questions, and commands (tense shifts, pronoun changes).",
    "Relative clauses: defining clauses with who, which, that, whose, where, when (omission of relative pronoun as object).",
    "Conjunctions and linking words (time: when, while, as soon as, before, after, until; reason: because, as, so; contrast: but, although, however, despite, in spite of; purpose: to, in order to, so that)."
  ],
  "vocabulary_topics": [
    "Work and study: Job descriptions, job interviews, applying for jobs/courses, school/university life, subjects, exams, future career plans.",
    "Travel and tourism: Planning trips, booking accommodation and transport, sightseeing, describing travel experiences, common problems during travel and solutions, types of holidays.",
    "Hobbies and interests: Describing them in more detail, equipment needed, expressing enthusiasm or preferences, joining clubs, discussing rules of games/sports.",
    "Personal relationships: Friendships, family dynamics, describing character and personality traits (e.g., reliable, honest, selfish, kind), expressing feelings about relationships, stages of life.",
    "Food and culture: Regional cuisines, national dishes, traditions, festivals, eating habits, discussing recipes, ingredients, cooking methods.",
    "Health and lifestyle: Fitness, diet, healthy habits, common illnesses and treatments, giving simple advice on health, describing symptoms in more detail.",
    "Current events and news: Understanding main points of newspaper/online articles on familiar topics, discussing current topics simply, expressing opinions.",
    "Environment: Basic environmental issues (pollution, recycling, climate change), expressing concerns, simple solutions.",
    "Expressing opinions, agreement, disagreement: Structuring simple arguments, giving reasons, polite disagreement.",
    "Feelings and emotions: Expressing a wider range of feelings (joy, sadness, anger, fear, surprise, hope, disappointment, excitement, boredom, worry) with more nuance.",
    "Technology and communication: Basic terms related to computers, internet, mobile phones, social media, email.",
    "Narrative: Describing past events in sequence, telling simple stories with more detail.",
    "Films, books, music: Discussing plots, characters, preferences, simple reviews.",
    "Describing appearance and personality in more detail."
  ],
  "pronunciation_focus_topics": [
    "Stress and intonation in longer sentences, including compound and complex sentences with multiple clauses.",
    "Intonation patterns for different communicative functions (e.g., expressing surprise, doubt, agreement, disagreement, giving advice, making polite requests).",
    "Connected speech: common assimilations, elisions, and linking /r/ to improve fluency and naturalness; weak forms of auxiliary verbs and prepositions.",
    "Pronunciation of challenging consonant clusters and vowel sounds with greater accuracy.",
    "Word stress in polysyllabic words, including common suffixes that affect stress (e.g., -tion, -ity, -graphy).",
    "Rhythm in English speech, focusing on stress-timed patterns and appropriate pausing for clarity."
  ],
  "listening_comprehension_skills": [
    "Understand the main points of clear standard speech on familiar matters regularly encountered in work, school, leisure, etc., including short narratives, announcements, and straightforward factual accounts.",
    "Understand the main points of many radio or TV programmes on current affairs or topics of personal or professional interest when the delivery is relatively slow and clear.",
    "Follow the general outline of lectures, talks, or presentations on familiar topics if clearly structured.",
    "Understand instructions or directions related to work, study, or travel, including multi-step instructions.",
    "Identify the speaker's mood, attitude, and opinion in clear, standard speech on familiar topics."
  ],
  "reading_comprehension_skills": [
    "Understand texts that consist mainly of high frequency everyday or job-related language, and the description of events, feelings, and wishes in personal letters, emails, and straightforward articles.",
    "Scan longer texts in order to locate desired information, and gather information from different parts of a text, or from different texts in order to fulfil a specific task.",
    "Recognise significant points and main arguments in straightforward newspaper or magazine articles on familiar subjects, and identify the writer's general stance.",
    "Understand simple instructions for equipment, procedures, or recipes.",
    "Follow the plot of a simple story, narrative, or film review, understanding the sequence of events and main characters' motivations."
  ],
  "spoken_interaction_skills": [
    "Enter unprepared into conversation on topics that are familiar, of personal interest or pertinent to everyday life (e.g. family, hobbies, work, travel and current events), and sustain the conversation.",
    "Deal with most situations likely to arise whilst travelling in an area where the language is spoken (e.g., making travel arrangements, checking into a hotel, asking for help or information, dealing with minor problems or complaints).",
    "Express and ask for personal opinions, beliefs, and ideas in familiar contexts, and respond to those of others by agreeing, disagreeing politely, and giving reasons.",
    "Narrate a story or relate the plot of a book or film, describe reactions, and exchange views.",
    "Clarify points, ask for clarification when necessary, and check understanding.",
    "Make and respond to suggestions, advice, and invitations, negotiating details."
  ],
  "spoken_production_skills": [
    "Produce simple connected text on a range of familiar subjects or topics of personal interest, linking ideas into a coherent sequence.",
    "Briefly give reasons and explanations for opinions, plans, and actions.",
    "Narrate a story, or describe an event or personal experience, including feelings and reactions, with some detail.",
    "Describe dreams, hopes, and ambitions, and explain future plans.",
    "Relate the plot of a book or film and describe personal reactions and opinions, giving examples.",
    "Give a straightforward, prepared presentation on a familiar topic within their field, explaining main points with reasonable precision and supporting them with some details."
  ],
  "written_interaction_skills": [
    "Write personal letters, emails, or online messages describing experiences, feelings, and events in some detail, and commenting on the correspondent's news and views.",
    "Exchange information in writing on familiar routine and non-routine matters within their field with some confidence (e.g., requesting information, making arrangements, confirming details).",
    "Make notes while someone is talking or during a presentation on familiar topics, summarizing key points and questions for follow-up.",
    "Contribute to online forums or group discussions on familiar topics, expressing opinions and responding to others."
  ],
  "written_production_skills": [
    "Write simple connected text on a range of familiar subjects or subjects of personal interest, linking a series of shorter discrete elements into a linear and coherent sequence using appropriate conjunctions.",
    "Write personal letters, emails, or short blog posts describing experiences, events, feelings, and impressions in some detail.",
    "Write a short, simple essay or report on a topic of interest, providing reasons for their views, structuring ideas logically with an introduction, body, and conclusion.",
    "Describe the plot of a book or film, or a personal experience, in writing, including personal reactions.",
    "Take messages containing simple factual information and convey them accurately to a third party."
  ],
  "cultural_competence_topics": [
    "Understanding common social etiquette and conventions in various situations in English-speaking cultures (e.g., formal vs. informal address, making requests, apologies, compliments).",
    "Awareness of some important historical and cultural figures, events, and symbols in major English-speaking countries and their general significance.",
    "Understanding common English proverbs, sayings, or idioms and their general meaning in context.",
    "Introduction to different regional accents within major English-speaking countries (e.g., basic differences between British and American English pronunciation).",
    "Basic understanding of common values, attitudes, and social norms (e.g., regarding punctuality, personal space, directness in communication).",
    "Recognizing humor and irony in simple, clear contexts.",
    "Understanding how to navigate public services and common everyday situations (e.g., using public transport, shopping, eating out)."
  ],
  "learning_strategies_suggestions": [
    "Read graded readers or simple authentic English articles, blogs, or short stories regularly, trying to guess the meaning of unknown words from context before using a dictionary.",
    "Watch English TV shows, interviews, or movies with English subtitles, paying attention to colloquial language, expressions, and how ideas are linked.",
    "Practice writing longer texts like emails detailing plans, diary entries about experiences, or short opinion pieces on familiar topics, focusing on connecting ideas coherently.",
    "Set specific language learning goals (e.g., learn 5 new phrasal verbs related to travel this week, practice using conditional sentences in conversation) and track progress.",
    "Use monolingual learner's dictionaries to understand nuances of meaning, see collocations, and check example sentences.",
    "Actively look for opportunities to use English in real-life situations or online forums for topics of interest.",
    "Practice summarizing short texts or talks in your own words.",
    "Pay attention to how native speakers structure their arguments or tell stories."
  ]
}