{
  "level_code": "B2",
  "level_name": "Amateur (Upper Intermediate)",
  "approximate_vocabulary_size": "4000-6000 words",
  "learning_outcomes": [
    "Can understand the main ideas of complex text on both concrete and abstract topics, including technical discussions in his/her field of specialisation.",
    "Can interact with a degree of fluency and spontaneity that makes regular interaction with native speakers quite possible without strain for either party.",
    "Can produce clear, detailed text on a wide range of subjects and explain a viewpoint on a topical issue giving the advantages and disadvantages of various options."
  ],
  "language_focus_topics": [
    "Review of the tense system (comprehensive understanding and application of all tenses, including perfect and continuous aspects).",
    "Question forms, Negatives & Short Answers (complex questions, tag questions, indirect questions, nuanced negative structures).",
    "Simple & Continuous (Present Tenses – active and passive, including stative verbs and their continuous forms where appropriate)",
    "Simple & Continuous (Past Tenses – active and passive, including narrative tenses and their interplay)",
    "Past Perfect (review and more complex uses, e.g., with reporting verbs, in unreal past conditionals)",
    "used to / would (for past habits and states, distinction between them)",
    "Modals & related verbs (advice, obligation & permission - review and expansion: e.g., ought to, be allowed to, be supposed to, had better)",
    "Future forms (will, going to, Present Continuous, Future Continuous, Future Perfect - distinctions and appropriate use)",
    "Future possibilities (modals for future speculation: may, might, could, will probably)",
    "Information questions (embedded questions, reported questions)",
    "Present Perfect (Simple & Continuous - review, consolidation, and nuanced differences for duration, completion, recentness)",
    "Verb Patterns (expanded: verb + object + to-infinitive, verb + gerund/infinitive with change in meaning, causative have/get)",
    "Conditionals (0, 1st, 2nd & 3rd conditionals, mixed conditionals, unless, in case, as long as)",
    "Modals of Probability (present and past: must be/have been, can't be/have been, may/might/could be/have been)",
    "Reported Speech, thoughts & questions (tense shifts, changes in pronouns/adverbs, reporting different types of sentences)",
    "Parts of Speech (in-depth understanding of word classes and their functions, word formation: prefixes, suffixes)",
    "Adverbial -ing clauses preceding the main clause (e.g., Having finished his work, he went home)",
    "'It' + verb + infinitive phrase (e.g., It is important to understand)",
    "Wh-clauses as subject (e.g., Why he left is a mystery)",
    "Expanded range of specific verbs/adjectives + infinitive patterns (e.g., prove to be, turn out to be, likely to, sure to, known to, obliged to)",
    "Verb + object + adjective (Secondary predication) (e.g., He painted the car red)",
    "Double genitive with possessive pronoun + 's (e.g., a friend of mine's house)"
  ],
  "vocabulary_topics": [
    "Positive & negative adjectives (wider range, nuanced meanings, prefixes/suffixes for forming opposites)",
    "Free time activities (more specific and niche hobbies, expressing preferences and opinions about them)",
    "Phrasal Verbs (1) literal vs idiomatic, separable vs inseparable (systematic study and expansion)",
    "Word transformations (forming different parts of speech from a root word, e.g., beauty -> beautiful -> beautifully)",
    "Describing people & things (more detailed and nuanced descriptions of appearance, personality, characteristics, qualities)",
    "Adjectives / Adverbs (wider range, collocations, intensifying adverbs, adverbial phrases)",
    "Describing likes & dislikes (more sophisticated ways to express preferences, indifference, aversion)",
    "Idioms (common idioms, especially those related to parts of the body, understanding figurative language)",
    "Words with a similar meaning (synonyms for more precise expression, register differences)",
    "Compound nouns (expanded range, understanding formation and stress patterns)",
    "Phrasal Verbs (2) common phrasal verbs with out / up (e.g., work out, find out, give up, set up)",
    "Reporting Verbs (e.g., suggest, recommend, warn, promise, admit, deny - beyond say/tell)",
    "Noun phrases (complex noun phrases, use of articles, determiners, quantifiers, pre/post-modification)"
  ],
  "pronunciation_focus_topics": [
    "Fine-tuning intonation to convey subtle meanings, attitudes, and emotions (e.g., irony, doubt, enthusiasm, sarcasm, politeness).",
    "Achieving fluency and natural rhythm in extended speech, including appropriate pausing, phrasing, and chunking of information.",
    "Understanding and using features of connected speech typical of educated native speakers (e.g., more complex assimilations, elisions, reductions, linking).",
    "Stress patterns in longer and more complex words, including compound words and words with common prefixes/suffixes.",
    "Sentence stress for emphasis and contrast.",
    "Recognizing and dealing with variations in common native speaker accents (e.g., General American, British RP - basic awareness)."
  ],
  "listening_comprehension_skills": [
    "Understand extended speech and lectures, and follow even complex lines of argument provided the topic is reasonably familiar.",
    "Understand most TV news, current affairs programmes, documentaries, and interviews.",
    "Understand the majority of films, plays, and radio broadcasts in standard dialect, including implicit meanings and attitudes.",
    "Follow conversations between native speakers on a variety of general and more specialized topics, even in slightly noisy environments.",
    "Identify speaker's viewpoint, opinion, and purpose in spoken discourse."
  ],
  "reading_comprehension_skills": [
    "Read articles and reports concerned with contemporary problems in which the writers adopt particular stances or viewpoints, understanding both explicit and implicit information.",
    "Understand contemporary literary prose and appreciate stylistic choices.",
    "Understand specialized articles and technical texts related to own field or areas of interest, and some outside these areas with occasional use of a dictionary.",
    "Identify writer's purpose, tone, bias, and intended audience in various types of texts.",
    "Distinguish fact from opinion in news articles and argumentative texts.",
    "Summarize the main points of complex texts."
  ],
  "spoken_interaction_skills": [
    "Making small talk (initiating and maintaining informal conversations on a wider range of topics, showing active listening)",
    "Giving opinions (structuring opinions, supporting them with reasons, agreeing/disagreeing politely but firmly)",
    "Polite requests & offers (using more indirect and formal language where appropriate)",
    "Arranging to meet (negotiating times and places, confirming arrangements, handling changes)",
    "Shopping (handling more complex transactions, inquiries about products, discussing problems, understanding policies)",
    "Responding appropriately (agreement, sympathy, pleasure, surprise - using a wider range of expressions and showing nuance)",
    "Travel, number & money (discussing detailed travel plans, understanding complex information about schedules/prices, handling currency exchange and payments confidently)",
    "Describing in detail (providing rich descriptions of people, places, objects, events, experiences)",
    "Expressing attitude (conveying feelings and opinions through intonation, word choice, and idiomatic language)",
    "Clichés and comments (understanding and using common clichés and conversational fillers appropriately)",
    "Metaphors & Idioms (understanding and using common metaphors and idioms in context)",
    "Linking & Commenting (using discourse markers to structure speech, connect ideas, and add comments)"
  ],
  "spoken_production_skills": [
    "Exchanging information (confidently on a wide range of familiar and unfamiliar topics, handling abstract concepts)",
    "Talking about you (life, plans, feelings, concerns - with more depth, detail, and nuance)",
    "Recounting a story / play (detailed and engaging recounting, using appropriate narrative techniques)",
    "Giving opinions to real situations (analyzing situations, expressing well-reasoned opinions, speculating)",
    "Describing environmental issues (discussing causes, effects, and potential solutions related to the environment)",
    "Interviewing someone (preparing and asking appropriate questions, responding to answers, managing the interaction)",
    "Describing famous people & situations (providing detailed descriptions and discussing their significance)"
  ],
  "written_interaction_skills": [
    "Write clear, detailed emails, letters, or messages on a variety of complex subjects, adapting style, tone, and register to the recipient and purpose.",
    "Exchange, check, and confirm detailed information effectively, explain a problem in detail, make a formal complaint or request, and express thanks or appreciation appropriately.",
    "Participate actively in online discussions, forums, or collaborative documents on familiar and some unfamiliar topics, expressing views clearly, supporting them with arguments, and responding thoughtfully to others' contributions."
  ],
  "written_production_skills": [
    "Informal & Formal letters & emails (distinguishing register, appropriate tone and structure for various purposes)",
    "Narratives (more complex stories with developed plot, characters, and atmosphere)",
    "Writing a Biography (well-structured, detailed, and engaging biographies)",
    "Describing places & people (vivid and detailed descriptions, appealing to senses, using a rich vocabulary)",
    "Writing for talking (presentations - structuring content logically, using signposting language, preparing visuals)",
    "Arguments (Pros & Cons - developing arguments, providing evidence, structuring essays or reports)",
    "Expressing attitude (linking ideas - using cohesive devices, discourse markers, and appropriate vocabulary to convey stance and connect arguments)"
  ],
  "cultural_competence_topics": [
    "Deeper understanding of cultural norms, values, and attitudes in major English-speaking societies (e.g., regarding work ethic, social interaction, education, family).",
    "Nuances of formal and informal communication, politeness strategies, and directness/indirectness in different English-speaking cultures.",
    "Understanding common cultural references, allusions, and humor in English media, literature, and everyday conversation.",
    "Awareness of different social and regional varieties of English and their general characteristics (e.g., British vs. American English differences in vocabulary and pronunciation).",
    "Understanding of contemporary social and political issues in English-speaking countries and how they are discussed.",
    "Appreciation of different perspectives and cultural assumptions."
  ],
  "learning_strategies_suggestions": [
    "Read a variety of authentic English texts regularly (news, articles, fiction, non-fiction) from different sources.",
    "Watch English-language films, documentaries, and TV series without subtitles, or with English subtitles for detailed understanding and vocabulary acquisition.",
    "Engage in discussions and debates in English on more complex or abstract topics, focusing on argumentation and fluency.",
    "Write different types of texts (essays, reports, reviews, formal letters) regularly, paying attention to structure, cohesion, register, and accuracy.",
    "Seek feedback on written and spoken English from native speakers, advanced learners, or teachers, and act on it.",
    "Actively expand vocabulary by noting down new words and expressions with their context, collocations, and nuances of meaning. Use a good monolingual dictionary.",
    "Practice summarizing information from different sources and presenting it in your own words.",
    "Develop critical thinking skills when engaging with English-language media."
  ]
}