{
  "level_code": "C1",
  "level_name": "A-star (Advanced)",
  "approximate_vocabulary_size": "8000-10000 words",
  "learning_outcomes": [
    "Can understand a wide range of demanding, longer texts, and recognise implicit meaning.",
    "Can express him/herself fluently and spontaneously without much obvious searching for expressions.",
    "Can use language flexibly and effectively for social, academic and professional purposes.",
    "Can produce clear, well-structured, detailed text on complex subjects, showing controlled use of organisational patterns, connectors and cohesive devices."
  ],
  "language_focus_topics": [
    "Mastery of the English tense system (simple, continuous, perfect aspects - active & passive), including subtle nuances for emphasis, aspect, and time relations.",
    "Advanced modal usage (speculation, deduction, criticism, regret, degrees of certainty/possibility in past, present, future). Complex modal-like expressions.",
    "Conditionals (all types, including mixed conditionals, inverted conditionals, hypothetical structures with 'wish', 'if only', 'would rather', 'it's time').",
    "Advanced passive constructions (e.g., with reporting verbs, 'have something done', impersonal passives, passives with infinitives and gerunds).",
    "Complex sentence structures: subordination and coordination, advanced use of relative clauses (non-defining, reduced, with prepositions), participle clauses (dangling/misrelated participles to avoid), nominal clauses (that-clauses, wh-clauses, infinitive/gerund clauses as subject/object).",
    "Emphasis and focus structures (cleft sentences, inversion after negative/limiting adverbials, fronting).",
    "Nuances of articles, determiners, and quantifiers in complex noun phrases.",
    "Figurative language: understanding and using metaphors, similes, idioms, proverbs, collocations effectively.",
    "Stylistic variations: adapting grammar and syntax to different genres and registers (formal, informal, academic, journalistic, literary).",
    "Advanced discourse markers and cohesive devices for structuring complex arguments, ensuring sophisticated cohesion and coherence.",
    "Word formation: productive use of a wide range of prefixes, suffixes, and compounding to understand and form new words, including neologisms.",
    "Subtleties of English punctuation for clarity and style."
  ],
  "vocabulary_topics": [
    "Specialized vocabulary related to one's field of study, profession, or specific areas of deep interest.",
    "Abstract and philosophical concepts, terminology for discussing complex ideas, theories, and ideologies.",
    "Nuances of meaning between synonyms, near-synonyms, and antonyms; choosing precise and effective vocabulary for specific contexts and effects.",
    "Low-frequency idioms, colloquial expressions, and culturally-specific sayings.",
    "Formal, literary, and archaic vocabulary (recognition and appropriate use for stylistic effect).",
    "Understanding and using wordplay, humor, irony, sarcasm, and understatement effectively.",
    "Cultural, historical, and literary references and allusions embedded in language.",
    "Terminology related to linguistics, rhetoric, critical analysis, and argumentation.",
    "Collocations (verb-noun, adjective-noun, adverb-adjective, verb-preposition) for natural and idiomatic expression.",
    "Euphemisms and dysphemisms.",
    "Connotations and semantic fields of words."
  ],
  "pronunciation_focus_topics": [
    "Mastery of intonation, stress (word and sentence), and rhythm to convey complex attitudes, emotions, and subtle shades of meaning (e.g., enthusiasm, doubt, conviction, irony, politeness).",
    "Near-native fluency and clarity in pronunciation across various speech styles (formal presentations, informal conversations, debates).",
    "Effective use of prosodic features (pitch, volume, tempo) for structuring discourse, highlighting key information, and engaging the listener.",
    "Understanding and adapting to a wider range of native speaker accents and regional variations, identifying key phonological differences.",
    "Consistent and accurate pronunciation of complex words and low-frequency vocabulary.",
    "Fine-tuning of individual sounds and sound clusters that may still pose challenges, achieving near-native articulation."
  ],
  "listening_comprehension_skills": [
    "Understand extended speech even when it is not clearly structured and when relationships are only implied and not signalled explicitly (e.g., lectures, complex presentations, academic discussions).",
    "Understand a wide range of television programmes, films, podcasts, and radio broadcasts without too much effort, including those with colloquial language, rapid speech, or unfamiliar accents (after some acclimatization).",
    "Follow complex interactions between third parties in group discussions, debates, and formal meetings, even on abstract, complex, and unfamiliar topics, identifying viewpoints, nuances, and implicit meanings.",
    "Recognize and interpret a wide range of idiomatic expressions, colloquialisms, and cultural allusions, appreciating register shifts and speaker intent.",
    "Distinguish finer shades of meaning due to prosodic features (intonation, stress, rhythm, tone of voice)."
  ],
  "reading_comprehension_skills": [
    "Understand in detail long and complex factual, argumentative, and literary texts from a variety of genres, appreciating distinctions of style, register, and implicit meaning.",
    "Understand specialised articles, abstract theoretical texts, academic papers, and longer technical instructions, even when they do not relate directly to own field, using contextual clues and reference materials effectively.",
    "Critically evaluate complex texts for argumentation, evidence, bias, underlying assumptions, rhetorical strategies, and stylistic effectiveness, identifying logical fallacies or weaknesses.",
    "Read contemporary and classical English literature with a high level of comprehension, appreciation for literary devices, and understanding of cultural/historical context.",
    "Synthesize information and arguments from multiple complex texts to form a coherent and critical understanding of a topic."
  ],
  "spoken_interaction_skills": [
    "Express oneself fluently, spontaneously, and almost effortlessly, selecting precise phrasing from a readily available range of discourse items to preface remarks, gain time, and keep the turn whilst formulating what to say.",
    "Use language flexibly and effectively for social, academic, and professional purposes, adapting style, register, and tone appropriately and subtly to the situation, participants, and communicative goals.",
    "Formulate ideas and opinions with precision, articulate complex arguments persuasively, and relate contributions skilfully to those of other speakers in discussions, debates, and negotiations.",
    "Participate effectively, confidently, and appropriately in formal meetings, academic seminars, professional presentations, and challenging interviews, contributing to productive outcomes.",
    "Handle interruptions, manage turn-taking, guide conversations smoothly, and mediate effectively in discussions if necessary, demonstrating strong interpersonal skills.",
    "Use humor, irony, understatement, and other rhetorical devices effectively and appropriately in conversation to achieve specific effects."
  ],
  "spoken_production_skills": [
    "Present clear, detailed, well-structured descriptions or arguments on complex subjects, integrating sub-themes, developing particular points at length with well-chosen supporting evidence and examples, and rounding off with an appropriate and memorable conclusion in a well-structured and engaging manner.",
    "Deliver well-structured, engaging, and persuasive presentations on complex or abstract topics to diverse audiences, adapting style, content, and delivery effectively to suit the context.",
    "Argue a complex case effectively, persuasively, and with nuance, using appropriate evidence, logical reasoning, and sophisticated rhetorical strategies to convince an audience.",
    "Speak with a high degree of grammatical accuracy, using a wide and varied range of complex sentence structures and sophisticated vocabulary precisely, idiomatically, and naturally.",
    "Vary intonation and place sentence stress correctly and effectively in order to express finer shades of meaning and attitudes."
  ],
  "written_interaction_skills": [
    "Write clear, well-structured, and stylistically sophisticated emails, letters, reports, and other documents on complex subjects for various professional, academic, or personal purposes and audiences, adapting tone and register flawlessly.",
    "Respond effectively, persuasively, and with nuance to complex written communications, addressing all points raised comprehensively and anticipating potential follow-up questions or concerns.",
    "Contribute effectively and authoritatively to professional or academic correspondence, collaborative writing projects, and formal written discussions, demonstrating a strong command of the subject matter and linguistic resources."
  ],
  "written_production_skills": [
    "Write clear, well-structured, and detailed text on complex subjects, showing controlled and sophisticated use of organisational patterns, a wide range of connectors, and cohesive devices to produce coherent, engaging, and stylistically accomplished discourse.",
    "Write clear, detailed, well-structured and persuasive reports, academic essays, articles, or research papers on complex subjects, underlining the relevant salient issues, presenting a well-reasoned and nuanced argument, synthesizing information from multiple sources critically, and citing appropriately according to academic conventions.",
    "Write different kinds of texts (e.g., critical reviews of literature or art, summaries of complex information, critiques of arguments, detailed proposals for projects) in an appropriate, effective, and often elegant style, adapting content, structure, and register to the intended reader and purpose.",
    "Express personal opinions, arguments, and abstract ideas with clarity, precision, depth, supporting evidence, and an awareness and refutation of counter-arguments.",
    "Use a rich, varied, and precise vocabulary accurately and appropriately, including idiomatic expressions, collocations, and figurative language.",
    "Demonstrate consistent and sophisticated grammatical control of complex language; errors are rare, minor, and self-corrected almost unconsciously."
  ],
  "cultural_competence_topics": [
    "In-depth, critical understanding and appreciation of diverse aspects of English-speaking cultures (e.g., UK, US, Canada, Australia, etc.), including their history, societal structures, political systems, values, beliefs, humor, and contemporary issues.",
    "Ability to navigate complex and nuanced social, academic, and professional situations in English-speaking contexts with cultural sensitivity, astuteness, and appropriateness, adapting behavior and communication style as needed.",
    "Deep appreciation and critical understanding of English literature, arts, philosophy, and intellectual traditions, including their historical, social, and cultural contexts.",
    "Understanding of sub-cultures, regional variations, social diversity, class distinctions, and evolving cultural trends within English-speaking societies.",
    "Ability to interpret subtle cultural cues, unspoken rules, humor, irony, sarcasm, and various registers in diverse contexts.",
    "Awareness of potential cultural misunderstandings and sophisticated strategies for addressing them or mediating across cultures."
  ],
  "learning_strategies_suggestions": [
    "Engage critically and analytically with a wide range of authentic and complex English-language media, literature, academic texts, and professional documents, including texts with challenging or specialized content.",
    "Actively participate in high-level academic, professional, or specialized activities and discussions conducted in English, aiming for leadership or significant contribution.",
    "Seek opportunities for deep immersion and high-level interaction with educated native speakers in diverse and demanding contexts, including professional networking and collaboration.",
    "Focus on refining stylistic choices, rhetorical effectiveness, precision in language use, and the ability to convey subtle nuances of meaning and tone.",
    "Undertake independent research, complex projects, or creative writing in English on topics of personal or professional interest, aiming for publishable or presentable quality.",
    "Provide mentorship or guidance to other learners of English, or engage in language teaching or tutoring if interested, thereby reinforcing and deepening one's own understanding.",
    "Continuously reflect on and analyze language use (one's own and others') to identify areas for further refinement and to appreciate the power and subtlety of language."
  ]
}