{
  "level_code": "C2",
  "level_name": "Maestro (Proficiency)",
  "approximate_vocabulary_size": "16000-20000 words (approaching educated native speaker)",
  "learning_outcomes": [
    "Can understand with ease virtually everything heard or read.",
    "Can summarise information from different spoken and written sources, reconstructing arguments and accounts in a coherent presentation.",
    "Can express him/herself spontaneously, very fluently and precisely, differentiating finer shades of meaning even in more complex situations."
  ],
  "language_focus_topics": [
    "Complete and nuanced mastery of all aspects of English grammar, including obscure, complex, archaic, and highly idiomatic structures. Understanding exceptions and rare usages.",
    "Full control over stylistic, pragmatic, and sociolinguistic aspects of the language, including subtle variations in register, tone, politeness, and persuasive effect across all contexts.",
    "Ability to manipulate language creatively, effectively, and for humorous, ironic, or other sophisticated rhetorical effects, including puns and wordplay.",
    "Deep understanding and natural, flexible use of highly idiomatic, colloquial, and culturally-specific language with native-like proficiency and appropriateness.",
    "Awareness and potential use of historical evolution of the English language and regional/social variations in grammar and usage for specific effects or characterization (e.g., in creative writing, performance).",
    "Sophisticated understanding of advanced linguistic concepts as applied to English (e.g., discourse analysis, pragmatics, semantics, stylistics, sociolinguistics).",
    "Mastery of complex punctuation for clarity, nuance, and stylistic effect, including less common conventions."
  ],
  "vocabulary_topics": [
    "Extensive, precise, and nuanced vocabulary, including very specific, technical, literary, academic, and archaic terms across a virtually unlimited range of domains and specialized fields.",
    "Full command of idiomatic expressions, proverbs, sayings, and cultural allusions, used appropriately, naturally, and often creatively to enrich communication.",
    "Ability to understand, use, and even coin neologisms and slang appropriately within different social contexts, understanding their connotations, lifespan, and social implications.",
    "Precise differentiation of synonyms, near-synonyms, and antonyms, understanding subtle connotations, collocations, and register constraints, and selecting the mot juste.",
    "Deep understanding of etymology, word formation processes (including less common ones like back-formation or blending), and semantic relationships in English.",
    "Vocabulary for discussing abstract, philosophical, scientific, and highly specialized topics with expert precision, eloquence, and authority.",
    "Understanding and effective use of figures of speech, rhetorical devices, and literary terminology."
  ],
  "pronunciation_focus_topics": [
    "Virtually flawless pronunciation, intonation, stress (word and sentence), and rhythm, often indistinguishable from an educated native speaker of a standard or chosen target dialect of English. Any accent is purely personal and does not hinder intelligibility or appropriateness.",
    "Ability to vary accent or style for specific effects, for characterization (e.g., in acting or storytelling), or to enhance communication with diverse audiences.",
    "Mastery of all prosodic features (pitch range, volume, tempo, tone of voice) to convey meaning, emotion, attitude, and subtle nuances with precision, naturalness, and impact.",
    "Effortless handling of connected speech phenomena (assimilation, elision, linking, weak forms) even in rapid, informal, or challenging speaking conditions.",
    "Ability to understand and be understood by speakers of a very wide range of English accents, including those that are heavily regional or non-native."
  ],
  "listening_comprehension_skills": [
    "Have no difficulty in understanding any kind of spoken language, whether live or broadcast, even when delivered at fast native speed, including speech with heavy background noise, unclear articulation, overlapping speakers, regional accents, or highly colloquial/idiomatic language (given minimal or no acclimatization).",
    "Understand implicit meanings, attitudes, irony, humor, sarcasm, and emotional undertones in all forms of spoken discourse with ease and accuracy.",
    "Follow highly colloquial conversations, rapid-fire debates, complex group interactions, and technically dense or abstract discussions effortlessly, grasping all nuances.",
    "Appreciate stylistic variations, rhetorical strategies, and the effective use of prosody in all types of spoken English."
  ],
  "reading_comprehension_skills": [
    "Read with ease and full, nuanced comprehension virtually all forms of the written language, including abstract, structurally or linguistically complex texts such as dense academic research, legal documents, specialized technical manuals, and literary works from various periods and genres (including classical, experimental, and highly contemporary).",
    "Appreciate subtle stylistic nuances, rhetorical devices, implicit meanings, authorial intent, intertextual references, and complex irony or satire in all types of written texts.",
    "Critically analyze, evaluate, and synthesize information and arguments from multiple complex, dense, and potentially conflicting sources with sophistication and originality.",
    "Understand and interpret figurative language, ambiguity, wordplay, and symbolic meaning in sophisticated written texts."
  ],
  "spoken_interaction_skills": [
    "Take part effortlessly, fluently, and appropriately in any conversation or discussion on any topic, demonstrating excellent command of idiomatic expressions, colloquialisms, cultural references, and humor, using them naturally and effectively.",
    "Express oneself spontaneously, very fluently, and precisely, differentiating finer shades of meaning even in the most complex, sensitive, abstract, or unfamiliar situations and topics, often with elegance and wit.",
    "If he/she does encounter a rare linguistic problem or search for an elusive expression, backtrack and restructure around the difficulty so smoothly, rapidly, and effectively that other people are hardly aware of it.",
    "Mediate effectively, diplomatically, and persuasively in complex or sensitive discussions, negotiations, or conflicts, whether between native speakers or across language/cultural divides, demonstrating strong interpersonal and intercultural skills.",
    "Chair meetings, lead discussions, or deliver impromptu speeches with skill, authority, and adaptability.",
    "Adapt register and style with complete flexibility and subtlety to suit any audience, context, or communicative purpose."
  ],
  "spoken_production_skills": [
    "Present a clear, smoothly-flowing, well-structured, engaging, and often memorable description, argument, or narrative on any topic, in a style appropriate to the context and purpose, with an effective and sophisticated logical structure which helps the recipient to notice, understand, and remember significant points effortlessly.",
    "Speak with the fluency, accuracy, sophistication, lexical richness, and stylistic range of a highly articulate and educated native speaker on any topic, whether concrete or abstract, familiar or unfamiliar.",
    "Adapt speech flexibly, spontaneously, and effectively to different audiences, purposes, and situations, using a full repertoire of linguistic, rhetorical, and prosodic resources to achieve maximum impact.",
    "Use humor, irony, storytelling, and other rhetorical devices masterfully and appropriately to achieve specific communicative effects and engage the audience.",
    "Deliver compelling, persuasive, and memorable public speeches, lectures, or presentations with little or no preparation if necessary."
  ],
  "written_interaction_skills": [
    "Write any type of correspondence (formal, informal, professional, academic, personal, creative) with full command of language, style, register, tone, and persuasive techniques, achieving specific communicative goals effectively, efficiently, and often elegantly.",
    "Engage in complex written debates, academic discussions, or professional collaborations with precision, persuasiveness, sophistication, and stylistic flair, demonstrating a masterful understanding of the topic, audience, and context.",
    "Craft written responses that are not only accurate, appropriate, and comprehensive but also engaging, impactful, and demonstrate critical thinking."
  ],
  "written_production_skills": [
    "Write clear, smoothly-flowing, sophisticated, and stylistically accomplished text in an appropriate style for a wide variety of demanding purposes (e.g., publishable academic papers, complex professional reports, policy documents, literary essays, creative writing, impactful speeches).",
    "Write complex letters, reports, or articles which present a case with an effective logical structure, compelling arguments, nuanced analysis, sophisticated synthesis of information, and appropriate evidence, helping the recipient to understand complex issues and remember significant points.",
    "Write insightful summaries, critical reviews, or syntheses of professional, academic, or literary works, demonstrating deep understanding, critical engagement, and original thought.",
    "Produce creative writing of high literary quality (e.g., short stories, poetry, scripts), demonstrating mastery of narrative techniques, character development, stylistic devices, and linguistic creativity.",
    "Employ a very wide, precise, and nuanced lexical repertoire including idiomatic, colloquial, archaic, and specialized items; show full awareness of connotative levels of meaning and use them effectively.",
    "Maintain consistent and virtually flawless grammatical control of complex language; any errors are exceptional, non-systematic, and self-corrected immediately and unobtrusively."
  ],
  "cultural_competence_topics": [
    "Native-like, nuanced, and critical understanding and appreciation of all aspects of diverse English-speaking cultures, including their history, societal structures, political systems, values, beliefs, humor, irony, and contemporary issues.",
    "Ability to function effortlessly, appropriately, and effectively in any English-speaking social, academic, or professional context, demonstrating high levels of intercultural competence and adaptability.",
    "Deep understanding of cultural subtexts, implicit meanings, unspoken rules, sociolinguistic conventions, and power dynamics in various English-speaking societies.",
    "Ability to discuss, analyze, and critique cultural phenomena with insight, sophistication, originality, and an awareness of multiple complex perspectives.",
    "Understanding of the role of English as a global lingua franca, its historical impact, and its ongoing evolution and variations worldwide.",
    "Ability to act as a cultural mediator or interpreter when needed."
  ],
  "learning_strategies_suggestions": [
    "Maintain and continually refine language skills through lifelong, active engagement with English language and culture at the highest and most diverse levels (e.g., reading challenging academic/literary works, following complex international current affairs from multiple perspectives, engaging with cutting-edge research or artistic expression).",
    "Explore highly specialized or niche areas of interest in English, potentially contributing to them (e.g., specific academic disciplines, avant-garde literary genres, advanced professional communication strategies, historical linguistics).",
    "Contribute to English-language knowledge creation, translation of complex works, or high-level academic/professional discourse, potentially in a leadership role.",
    "Engage in activities that require a very high level of linguistic precision, stylistic control, and creativity (e.g., advanced creative writing workshops, public speaking or debating at a competitive level, advanced academic research and publication).",
    "Reflect critically and meta-linguistically on language and culture, including one's own use of English, the nature of communication, and the dynamics of intercultural interaction.",
    "Stay updated with neologisms, evolving slang, and shifts in contemporary language use."
  ]
}