{
  "level_code": "A1",
  "level_name": "Йәш Тикшереүсе (Young Researcher)",
  "approximate_vocabulary_size": "approx. 500-700 words",
  "learning_outcomes": [
    "Can understand and use familiar everyday expressions and very basic phrases aimed at the satisfaction of needs of a concrete type.",
    "Can introduce him/herself and others and can ask and answer questions about personal details such as where he/she lives, people he/she knows and things he/she has.",
    "Can interact in a simple way provided the other person talks slowly and clearly and is prepared to help."
  ],
  "language_focus_topics": [
    "Review A0: Alphabet, basic pronunciation, nominative case, basic verbs.",
    "Nouns: Cases - Accusative (-ды/-де, -ты/-те, -ҙы/-ҙе, -ны/-не), Genitive (-дың/-дең, -тың/-тең, -ҙың/-ҙең, -ның/-нең), Dative (-ға/-гә, -ҡа/-кә), Locative (-да/-дә, -та/-тә), Ablative (-дан/-дән, -тан/-тән, -ҙан/-ҙән, -нан/-нән). Singular forms.",
    "Pronouns: Personal pronouns in basic cases. Possessive suffixes (all persons singular and plural).",
    "Verbs: Present tense (-а/-ә, -й). Past tense (definite past: -ны/-не + person endings; or -ған/-гән + person endings for narrative/experiential past). Basic future tense (-ыр/-ер, -ар/-әр + person endings; or -асаҡ/-әсәк).",
    "Adjectives: Basic use, typically do not change for case/number when attributive, precede nouns.",
    "Postpositions: Common postpositions (менән - with, өсөн - for, тураһында - about, кеүек - like).",
    "Numbers: 0-100. Basic ordinal numbers (беренсе, икенсе...).",
    "Sentence structure: SOV. Questions with interrogative words and particles. Affirmative and negative sentences.",
    "Vowel Harmony: Consistent application in suffixes (front/back and labial)."
  ],
  "vocabulary_topics": [
    "Review A0 vocabulary.",
    "Personal information: Family members (extended), age, profession (common ones).",
    "Daily routine: Common daily activities, telling time.",
    "Food & Drink: Common food items, drinks, ordering in a café (сәй, ҡымыҙ, ит).",
    "Shopping: Types of shops (магазин), common items, prices, asking 'how much?' (нисә һум тора?).",
    "Places in town: урам, майҙан, баҡса, почта, банк, дарыухана, ҡунаҡхана.",
    "Transport: автобус, трамвай, машина, поезд. Buying tickets (билет).",
    "Time: Days of the week, months, seasons.",
    "Weather: Basic weather expressions (йылы, һыуыҡ, ямғыр яуа, ҡар яуа, ҡояшлы).",
    "Hobbies & interests (basic: уҡырға, телевизор ҡарарға, музыка тыңларға).",
    "Clothing: Common items (күлдәк, салбар, итәк, куртка)."
  ],
  "pronunciation_focus_topics": [
    "Review A0 sounds, vowel harmony (front/back, labial).",
    "Pronunciation of case endings and possessive suffixes, maintaining vowel harmony.",
    "Word stress (often final, but with important exceptions, e.g., with negative suffix -ма/-мә).",
    "Intonation of different sentence types (statements, questions, requests).",
    "Practicing specific Bashkir consonant sounds (ҙ, ҫ, ҡ, ғ, һ) in various word positions."
  ],
  "listening_comprehension_skills": [
    "Understand frequently used words and phrases related to personal details, family, shopping, local area, when spoken slowly and clearly.",
    "Grasp the main point in short, clear, simple messages and announcements.",
    "Understand simple questions and instructions related to everyday situations."
  ],
  "reading_comprehension_skills": [
    "Understand short, simple texts on familiar matters (e.g., simple menus, public signs, short personal messages).",
    "Find specific, predictable information in everyday material.",
    "Understand short, simple personal notes or postcards."
  ],
  "spoken_interaction_skills": [
    "Interact in simple, routine situations (e.g., basic shopping, ordering food, asking for simple directions).",
    "Ask and answer questions about familiar topics (daily life, family, hobbies).",
    "Make and respond to simple suggestions or invitations.",
    "Ask for and give basic information (e.g., 'Был нимә?' - What is this?)."
  ],
  "spoken_production_skills": [
    "Describe his/her family, living conditions, daily routine in simple terms.",
    "Talk about past events using basic past tense forms.",
    "Talk about simple future plans.",
    "Express likes and dislikes (Миңә оҡшай / Мин яратам...)."
  ],
  "written_interaction_skills": [
    "Write a simple reply to a personal message or invitation (e.g., a short SMS or email)."
  ],
  "written_production_skills": [
    "Write short, simple notes and messages (e.g., a shopping list, a simple postcard with greetings).",
    "Describe a familiar place or person in a few simple sentences.",
    "Fill in simple forms with personal details."
  ],
  "cultural_competence_topics": [
    "Forms of address (respectful forms for elders and strangers).",
    "Bashkir customs related to hospitality (e.g., offering tea).",
    "Awareness of key Bashkir holidays or festivals (e.g., Sabantuy, Qorban Bayramı - basic recognition).",
    "Bashkir cuisine: common dishes (e.g., بیشбармаҡ, ҡыҫтыбый, ҡорот - recognition).",
    "Importance of nature in Bashkir culture."
  ],
  "learning_strategies_suggestions": [
    "Practice applying vowel harmony rules to all suffixes consistently.",
    "Use language learning apps focusing on Bashkir vocabulary and basic grammar, if available.",
    "Listen to Bashkir music and try to identify familiar words and phrases.",
    "Try to form simple sentences about everyday objects and actions, applying case endings and verb conjugations."
  ]
}