{
  "level_code": "B1",
  "level_name": "Хыялый Сәйәхәтсе (Imaginative Voyager)",
  "approximate_vocabulary_size": "approx. 2000-2500 words",
  "learning_outcomes": [
    "Can understand the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc.",
    "Can deal with most situations likely to arise whilst travelling in an area where the language is spoken.",
    "Can produce simple connected text on topics, which are familiar, or of personal interest.",
    "Can describe experiences and events, dreams, hopes & ambitions and briefly give reasons and explanations for opinions and plans."
  ],
  "language_focus_topics": [
    "Review of A2 grammar: Noun cases, verb aspects and tenses, conditional mood.",
    "Verbs: Participles (хәл ҡылым, сифат ҡылым) - present, past, future; their adjectival and adverbial uses.",
    "Verbs: Voice - passive voice (-л-), causative voice (-дыр-/-тер- etc.), reflexive voice (-н-), reciprocal voice (-ш-).",
    "Complex sentences: Subordinate clauses of time (ҡасан, -ғас/-гәс), place (ҡайҙа), reason (сөнки, -ғанға/-гәнгә), purpose (-рға/-ергә тип), condition (әгәр, -һа/-һә).",
    "Reported speech (indirect statements and questions - basic forms).",
    "Degrees of comparison for adjectives and adverbs (more forms and constructions).",
    "Modal expressions of necessity, possibility, permission, advice.",
    "Word order variations for emphasis and stylistic purposes in more complex sentences."
  ],
  "vocabulary_topics": [
    "Work and career: Job roles, responsibilities, skills, work environment, career development, simple business communication.",
    "Education: Educational system, subjects, exams, university life, basic research topics.",
    "Travel and tourism: Planning detailed itineraries, cultural tourism, independent travel, dealing with common travel problems, describing cultural differences.",
    "Media and news: Understanding main points of news reports, articles on current events, expressing opinions on news.",
    "Culture and arts: Discussing films, books, music, theatre in more detail; genres, artists, personal impressions, simple reviews.",
    "Health and lifestyle: Discussing health issues, treatments, healthy living, sports, fitness in detail, understanding medical advice.",
    "Social issues: Discussing environmental problems, social trends, community life, volunteering (with appropriate vocabulary).",
    "Personal relationships: Friendship, family dynamics, expressing emotions and feelings with more complexity and nuance.",
    "Technology and communication: Discussing pros and cons of technology, internet usage, digital literacy, social media trends.",
    "Abstract concepts: happiness, success, tradition, change (basic understanding and vocabulary)."
  ],
  "pronunciation_focus_topics": [
    "Review of A2 pronunciation: vowel harmony, stress, intonation.",
    "Intonation in complex sentences, conveying nuances like doubt, certainty, surprise, and polite requests.",
    "Fluency and rhythm in connected speech, reducing hesitation and improving natural flow.",
    "Pronunciation of less frequent sound combinations and loanwords, adapting them to Bashkir phonology.",
    "Awareness of different speech styles (formal vs. informal) and their phonetic characteristics."
  ],
  "listening_comprehension_skills": [
    "Understand the main points of clear standard speech on familiar matters regularly encountered in daily life, work, or school.",
    "Understand the main points of radio or TV programs on current affairs or topics of personal interest when the delivery is relatively clear.",
    "Follow a lecture or talk on a familiar topic if the structure is clear and language straightforward."
  ],
  "reading_comprehension_skills": [
    "Understand texts written primarily in high-frequency everyday or job-related language.",
    "Understand the description of events, feelings, and wishes in personal correspondence and online posts.",
    "Read straightforward factual texts, articles, and interviews on topics of personal or professional interest with good comprehension."
  ],
  "spoken_interaction_skills": [
    "Enter unprepared into conversations on familiar topics or topics of personal interest with some confidence.",
    "Deal with most common situations likely to arise while travelling in a Bashkir-speaking region (e.g., transport, accommodation, shopping, emergencies).",
    "Express and sustain personal opinions, providing explanations, arguments, and comments.",
    "Participate in discussions on familiar topics, making points clearly, and responding to others' views."
  ],
  "spoken_production_skills": [
    "Produce connected discourse on topics which are familiar or of personal interest, linking ideas coherently.",
    "Narrate a story, describe an experience, or relate the plot of a book/film, detailing reactions and impressions with some elaboration.",
    "Describe dreams, hopes, and ambitions, giving reasons and explanations.",
    "Explain plans and arrangements, justifying choices and decisions simply."
  ],
  "written_interaction_skills": [
    "Write personal letters or emails giving and asking for news, describing experiences, feelings, and events in reasonable detail.",
    "Respond to formal/informal written communications, providing required information or expressing views clearly."
  ],
  "written_production_skills": [
    "Write clear, connected texts on a range of familiar subjects or topics of personal interest (e.g., an account of a significant experience, a description of a cultural event).",
    "Write descriptions of real or imaginary events and experiences with some detail and structure.",
    "Write a short formal letter or email for practical purposes (e.g., inquiry, request for information, simple application).",
    "Express personal viewpoints and arguments on familiar topics in a structured way (e.g., a blog entry, a short essay with introduction, body, and conclusion)."
  ],
  "cultural_competence_topics": [
    "Understanding nuances in formal vs. informal communication in various Bashkir contexts.",
    "Knowledge of significant Bashkir historical figures (e.g., Salawat Yulayev), writers, poets (e.g., Mustai Karim).",
    "Bashkir traditions in music (kurai, uzlyau), dance, and epic poetry (kubairs).",
    "Social etiquette in more formal settings (e.g., official events, public celebrations).",
    "Understanding the role of language, nature, and oral traditions in Bashkir identity.",
    "Awareness of contemporary Bashkortostan, its cultural life, and current events."
  ],
  "learning_strategies_suggestions": [
    "Read authentic Bashkir materials like newspapers, magazines, and contemporary short stories.",
    "Practice using different verb voices and non-finite forms (participles, gerunds) to vary sentence structure.",
    "Watch Bashkir films, documentaries, and TV programs, trying to follow without subtitles or with Bashkir subtitles.",
    "Engage in more complex discussions, focusing on expressing and defending opinions with justification.",
    "Write longer, structured texts like essays or detailed personal accounts, and seek feedback on coherence and style."
  ]
}