{
  "level_code": "A1",
  "level_name": "Ο Μικρός Εξερευνητής (The Little Explorer)",
  "approximate_vocabulary_size": "approx. 600-800 words",
  "learning_outcomes": [
    "Can understand and use familiar everyday expressions and very basic phrases aimed at the satisfaction of needs of a concrete type.",
    "Can introduce him/herself and others and can ask and answer questions about personal details such as where he/she lives, people he/she knows and things he/she has.",
    "Can interact in a simple way provided the other person talks slowly and clearly and is prepared to help."
  ],
  "language_focus_grammar": [
    "The Greek alphabet (Ελληνικό αλφάβητο) - review and mastery",
    "Gender of nouns (masculine, feminine, neuter - ο, η, το)",
    "Articles: definite (ο, η, το) and indefinite (ένας, μια, ένα) in Nominative case",
    "Present tense of regular verbs - Type A (e.g., κάνω, μένω, ξέρω)",
    "Present tense of 'to be' (είμαι) and 'to have' (έχω)",
    "Personal pronouns in Nominative (εγώ, εσύ, αυτός, αυτή, αυτό, εμείς, εσείς, αυτοί, αυτές, αυτά)",
    "Basic conjunctions (και - and, ή - or, αλλά - but)",
    "Simple prepositions of place (σε - in/on/at, από - from, με - with)",
    "Nominative and Accusative cases for articles and common nouns (singular)",
    "Adjectives: agreement with nouns in gender and number (Nominative, singular, common adjectives like καλός, καλή, καλό)",
    "Basic question words (τι - what, πού - where, πότε - when, πώς - how, ποιος/ποια/ποιο - who/which)",
    "Numbers 0-100"
  ],
  "language_focus_vocabulary_topics": [
    "Personal information (name, nationality, age, profession, address, phone number)",
    "Family members (basic and some extended kinship terms)",
    "Numbers 0-100, Telephone numbers",
    "Days of the week, months, seasons",
    "Colors (common)",
    "Common objects in the classroom, home, and immediate surroundings",
    "Food and drinks (common items, ordering in a café/simple restaurant)",
    "Greetings, farewells, and introductions (formal and informal)",
    "Polite expressions (please, thank you, sorry, excuse me, you're welcome)",
    "Countries and Nationalities (common ones)",
    "Telling time (basic phrases, e.g., 'What time is it?', 'It is X o'clock', 'half past', 'quarter to/past')",
    "Basic adjectives for description (e.g., big/small, good/bad, new/old, beautiful/ugly, happy/sad)",
    "Daily routine verbs (e.g., wake up, eat, drink, go, sleep, study, work - infinitive and simple present)"
  ],
  "pronunciation_focus_topics": [
    "Accurate pronunciation of individual Greek letters and their sounds, including potentially difficult ones (e.g., γ, χ, δ, θ, ξ, ψ).",
    "Common diphthongs (e.g., αι, ει, οι, ου, υι) and their correct pronunciation.",
    "Stress (τόνος): identifying and correctly applying stress in common 2-3 syllable words. Understanding that stress can change meaning.",
    "Basic intonation patterns for statements, yes/no questions, and Wh-questions.",
    "Distinguishing and producing voiced vs. unvoiced consonants (e.g., π/μπ, τ/ντ, κ/γκ)."
  ],
  "listening_comprehension_skills": [
    "Understand simple greetings, introductions, and farewells.",
    "Recognize familiar names, words, and very basic phrases concerning themselves, their family, and immediate concrete surroundings when people speak slowly and clearly.",
    "Understand simple questions about personal information (name, age, nationality, where they live).",
    "Follow short, simple instructions given slowly and clearly (e.g., 'open your book', 'listen', 'repeat').",
    "Identify numbers, prices, and times when spoken clearly and slowly in familiar contexts (e.g., shopping).",
    "Understand the main point of very short, simple dialogues about familiar topics (e.g., ordering a coffee)."
  ],
  "reading_comprehension_skills": [
    "Recognize and read the Greek alphabet confidently.",
    "Understand familiar names, words, and very simple sentences on notices, posters, or in catalogues (e.g., shop names, simple signs like 'Είσοδος' - Entrance, 'Έξοδος' - Exit, 'Ανοιχτό' - Open, 'Κλειστό' - Closed).",
    "Understand short, simple texts on familiar topics if they contain very high frequency vocabulary (e.g., a simple personal introduction, a very short postcard).",
    "Identify specific information in short, simple texts (e.g., finding a name, a number, or a place in a simple list).",
    "Understand simple instructions (e.g., 'Click here', 'Push/Pull' on a door)."
  ],
  "spoken_interaction_skills": [
    "Can interact in a simple way provided the other person is prepared to repeat or rephrase things at a slower rate of speech and help them formulate what they're trying to say.",
    "Can ask and answer simple questions in areas of immediate need or on very familiar topics (e.g., 'What's your name? - Πώς σε λένε;', 'Where do you live? - Πού μένεις;', 'How are you? - Τι κάνεις;').",
    "Can make simple purchases, ordering food and drink using basic phrases.",
    "Can use basic greeting and leave-taking expressions appropriately.",
    "Can ask for repetition or clarification using simple phrases (e.g., 'Μπορείτε να το επαναλάβετε;' - Can you repeat that?, 'Δεν κατάλαβα.' - I didn't understand.).",
    "Can respond to simple questions with 'yes' (ναι), 'no' (όχι), or short answers."
  ],
  "spoken_production_skills": [
    "Can use simple phrases and sentences to describe where they live and people they know.",
    "Can introduce themselves and others (e.g., 'Είμαι ο/η [name]. Αυτός/Αυτή είναι ο/η [name].' - I am [name]. This is [name].).",
    "Can state their name, age, nationality, and simple information about their family or job.",
    "Can talk about likes and dislikes in a very simple way (e.g., 'Μου αρέσει ο καφές.' - I like coffee. 'Δεν μου αρέσει η βροχή.' - I don't like the rain).",
    "Can name common objects, colors, and numbers learned.",
    "Can describe their daily routine in very simple terms (e.g., 'I wake up. I eat breakfast. I go to school.')"
  ],
  "written_interaction_skills": [
    "Can write a short, simple postcard (e.g., sending holiday greetings with fixed phrases).",
    "Can fill in forms with personal details (e.g., name, nationality, address on a hotel registration form or a simple application).",
    "Can write simple greeting messages for common occasions (e.g., 'Happy Birthday' - Χρόνια Πολλά, 'Happy Name Day').",
    "Can respond to simple questions in writing with short answers or phrases (e.g., in a text message)."
  ],
  "written_production_skills": [
    "Can write simple isolated phrases and sentences about themselves and imaginary people, where they live, and what they do.",
    "Can write a short, simple note or message (e.g., 'I am at the supermarket.', a short shopping list).",
    "Can list items (e.g., a shopping list with familiar food items).",
    "Can write simple sentences describing their family, pets, or home using learned vocabulary and grammar."
  ],
  "cultural_competence_topics": [
    "Common Greek greeting customs (e.g., handshakes, cheek kisses in informal settings depending on relationship and region, use of 'Γεια σου/σας').",
    "Basic etiquette for eating out (e.g., saying 'thank you' - ευχαριστώ, 'please' - παρακαλώ, 'cheers' - γεια μας, waiting to be seated).",
    "Understanding of 'name days' (ονομαστική εορτή) and their importance in Greek culture, often more celebrated than birthdays.",
    "Awareness of common gestures and their meanings (e.g., 'OK' sign, waving hello/goodbye, head nod for 'yes' and slight upward nod often meaning 'no' - to be clarified).",
    "Concept of 'philotimo' (φιλότιμο) - a complex cultural concept related to honor, duty, and hospitality (very basic awareness of its positive connotation).",
    "Common opening hours for shops and services (e.g., 'siesta' culture in some areas, though diminishing).",
    "Importance of coffee culture (καφές) in social life, concept of 'πάμε για καφέ' (let's go for a coffee) as a social activity.",
    "Basic understanding of giving and receiving gifts (e.g., for name days, visits)."
  ],
  "learning_strategies_suggestions": [
    "Practice the Greek alphabet daily until proficient in reading and writing.",
    "Use flashcards (physical or digital) for new vocabulary, especially nouns with their articles and simple verbs.",
    "Listen to simple Greek songs, children's stories, or very basic dialogues, trying to pick out familiar words.",
    "Try to label objects in their home or immediate environment with their Greek names.",
    "Repeat phrases heard in class or from audio/video materials aloud to practice pronunciation and intonation.",
    "Find a language exchange partner (even for very basic exchanges) or use language learning apps for simple conversation practice.",
    "Set small, achievable weekly goals (e.g., learn 10 new words, practice pronunciation of 5 specific sounds for 15 minutes daily).",
    "Don't be afraid to make mistakes; see them as part of the learning process.",
    "Try to use newly learned words or phrases in simple sentences as soon as possible."
  ],
  "example_conversation_starters": [
    "Τι κάνεις σήμερα το απόγευμα;",
    "Πού πήγες χθες;",
    "Τι σου αρέσει να τρως για πρωινό;",
    "Έχεις αδέρφια;",
    "Πώς πας στη δουλειά/σχολείο;",
    "Θέλεις να πάμε για καφέ το Σάββατο;"
  ],
  "example_text_types": [
    "Short personal emails or messages about daily activities.",
    "Simple dialogues in shops or cafes.",
    "Basic descriptions of people, places, or routines.",
    "Menus with common dishes.",
    "Public transport timetables (simplified).",
    "Simple advertisements for everyday products."
  ],
  "example_exercise_types": [
    "Fill-in-the-blanks with correct noun endings (nominative, accusative singular).",
    "Conjugate common -ω verbs in Present tense.",
    "Match questions with appropriate answers.",
    "Role-play: Ordering a coffee, introducing yourself, asking for the price of an item.",
    "Write a short paragraph describing your daily routine or your family (3-4 simple sentences).",
    "Listening comprehension: Answer simple true/false questions about a short dialogue."
  ]
}