{
  "level_code": "A2",
  "level_name": "Ο Μαθητευόμενος Μάγος (The Apprentice Wizard)",
  "approximate_vocabulary_size": "approx. 1000-1200 words",
  "learning_outcomes": [
    "Understand sentences and frequently used expressions related to areas of most immediate relevance (e.g., basic personal and family information, shopping, local geography, employment).",
    "Communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.",
    "Describe in simple terms aspects of his/her background, immediate environment, and matters in areas of immediate need.",
    "Understand main points in short, clear, simple messages, announcements, and straightforward dialogues.",
    "Read very short, simple texts and find specific information, understand simple narratives."
  ],
  "language_focus_topics": [
    "Review of A1 topics, consolidation of Present and Simple Future.",
    "Nouns & Adjectives: Comparative and superlative forms of common adjectives and adverbs (e.g., καλός - καλύτερος - ο καλύτερος; καλά - καλύτερα - άριστα). More irregular adjectives.",
    "Verbs: Past Simple (Αόριστος) of regular and more common irregular verbs (active voice and introduction to medio-passive voice for common reflexive/passive meanings, e.g., σηκώθηκα - I got up, πλύθηκα - I washed myself). Imperfect Tense (Παρατατικός) for ongoing/repeated past actions or descriptions in the past (e.g., έπαιζα - I was playing / I used to play, ο καιρός ήταν καλός - the weather was good). Introduction to Present Perfect (Παρακείμενος - e.g. έχω πάει - I have gone, έχω δει - I have seen) for experiences or past actions with present relevance. Basic uses of the Subjunctive (Υποτακτική) after common expressions and conjunctions (e.g., θέλω να πάω - I want to go, πρέπει να φύγω - I must leave, μπορείς να με βοηθήσεις; - can you help me?). Modal verbs and expressions (μπορώ - I can, πρέπει - I must/should, ξέρω να - I know how to, χρειάζεται να - it is necessary to). Basic conditional sentences (Type 1: Αν/Εάν + present, θα + present/future - If I have time, I will come).",
    "Pronouns: Object pronouns (strong and weak forms: με/εμένα, σε/εσένα, τον/αυτόν etc.). Reflexive pronouns (ο εαυτός μου - myself). Possessive pronouns (as distinct from adjectives).",
    "Adverbs: More adverbs of time (πριν - before, μετά - after, παλιά - in the past), place, manner, frequency (πάντα, συχνά, μερικές φορές, σπάνια - rarely, ποτέ - never).",
    "Prepositions & Conjunctions: Wider range and usage, including time prepositions (κατά τη διάρκεια - during, μέχρι - until). Causal conjunctions (επειδή - because, αφού - since/after).",
    "Word order in questions and statements with more elements."
  ],
  "vocabulary_topics": [
    "Personal details & Identity: Describing oneself in more detail (address, phone number, email, marital status - basic).",
    "Family and friends: Describing relationships, family members (e.g. ξάδερφος/η - cousin, θείος/α - uncle/aunt, παππούς/γιαγιά - grandfather/grandmother), describing friends.",
    "Daily routines and free time activities: Describing a typical day in more detail, hobbies, sports, going out.",
    "Shopping: Clothes (types, materials, sizes), asking for help in shops, making complaints (simple).",
    "Food and drink: Types of meals, basic recipes, ingredients, ordering more complex meals, expressing preferences.",
    "Travel and transport: Buying tickets, asking for travel information, types of accommodation (ξενοδοχείο, ενοικιαζόμενα δωμάτια - rented rooms), modes of transport, understanding simple travel announcements.",
    "Health and body: Common ailments (πονοκέφαλος - headache, πυρετός - fever), parts of the body, visiting a doctor or pharmacy, explaining simple symptoms.",
    "Places in town & services: post office, bank, pharmacy, cinema, theatre, library, museum, restaurant, café, types of shops.",
    "Describing people: Physical appearance (height, build, hair, eyes) and basic personality traits (φιλικός - friendly, αστείος - funny, έξυπνος - smart).",
    "Emotions and feelings: Expressing happiness, sadness, surprise, worry (basic).",
    "Education: School subjects, simple descriptions of school life.",
    "Work: Simple job titles, places of work, describing basic work activities."
  ],
  "pronunciation_focus_topics": [
    "Stress patterns in longer words, compound words, and simple sentences with correct phrasing.",
    "Rhythm and intonation in connected speech for different communicative functions (e.g., expressing surprise, asking for clarification, making suggestions).",
    "Recognizing and producing sounds that are particularly challenging for non-native speakers, focusing on consistency."
  ],
  "listening_comprehension_skills": [
    "Understand enough to be able to meet needs of a concrete type provided speech is clearly and slowly articulated on familiar topics.",
    "Understand phrases and expressions related to areas of most immediate priority (e.g. very basic personal and family information, shopping, local area, employment).",
    "Identify the main point and some key details of short, clear, simple messages, announcements, and straightforward dialogues.",
    "Follow short, simple narratives if the topic is familiar and language is simple."
  ],
  "reading_comprehension_skills": [
    "Understand short, simple texts (e.g., personal letters, emails, simple instructions, short newspaper articles about familiar events) containing high-frequency vocabulary.",
    "Find specific, predictable information in simple everyday material such as advertisements, prospectuses, menus, timetables, and short official documents.",
    "Get the gist of short narratives or simple stories with clear structure."
  ],
  "spoken_interaction_skills": [
    "Engage in short social exchanges, ask and answer questions about familiar topics like work, family, free time, past activities.",
    "Handle simple transactions in shops, post offices, or banks; order food, ask for services.",
    "Discuss past events or experiences simply (e.g., 'What did you do yesterday?').",
    "Make and respond to simple suggestions and invitations.",
    "Ask for and give directions or information about places.",
    "Express basic opinions and preferences with simple reasons."
  ],
  "spoken_production_skills": [
    "Describe one’s family, other people, living conditions, educational background, and present or most recent job using simple connected sentences.",
    "Give short, basic descriptions of events, activities, and personal experiences (past and present).",
    "Describe plans and arrangements, habits and routines.",
    "Explain what one likes or dislikes about something."
  ],
  "written_interaction_skills": [
    "Write short, simple notes, messages, and emails related to everyday situations.",
    "Respond to simple written questions or requests for information with relevant details.",
    "Exchange information about familiar topics in simple written form."
  ],
  "written_production_skills": [
    "Write a series of simple phrases and sentences linked with simple connectors like 'και', 'αλλά', 'επειδή', 'μετά', 'πρώτα'.",
    "Write a short, simple postcard or email describing an event, a trip, or personal impressions.",
    "Describe plans, arrangements, or past activities in a short paragraph.",
    "Write a simple description of a person or a place."
  ],
  "cultural_competence_topics": [
    "Understanding of basic Greek customs related to hospitality, invitations, and visiting someone's home.",
    "Awareness of some regional differences within Greece (e.g., islands vs. mainland, common stereotypes - basic).",
    "Common gestures and body language and their meanings (polite vs. impolite).",
    "Understanding basic social norms in public places.",
    "Introduction to Greek music and dance (basic recognition of popular forms)."
  ],
  "learning_strategies_suggestions": [
    "Try to think in Greek for simple daily actions and narrate them internally.",
    "Use a Greek-English dictionary to look up new words and note example sentences. Start categorizing vocabulary by topic.",
    "Practice writing short paragraphs about familiar topics, then try to expand them by adding more details or linking ideas with conjunctions.",
    "Watch simple Greek videos, cartoons, or TV programs with Greek subtitles if possible, focusing on understanding the gist and picking up new phrases.",
    "Engage in short, simple conversations with native speakers or other learners, focusing on familiar A2 topics.",
    "Record yourself speaking simple phrases or short descriptions and listen back to identify areas for pronunciation improvement.",
    "Set specific, measurable, achievable, relevant, and time-bound (SMART) goals for learning, e.g., 'learn 15 new words related to travel this week'."
  ],
  "example_conversation_starters": [
    "Τι έκανες το Σαββατοκύριακο;",
    "Πώς ήταν ο καιρός χθες;",
    "Μπορείς να μου περιγράψεις τον καλύτερό σου φίλο / την καλύτερή σου φίλη;",
    "Πού θέλεις να πας διακοπές φέτος;",
    "Τι πρέπει να αγοράσουμε από το σούπερ μάρκετ;",
    "Πήγες στο πάρτι της Άννας; Πώς πέρασες;",
    "Έχεις κατοικίδιο; Πώς είναι;",
    "Ποιο είναι το αγαπημένο σου φαγητό και γιατί;"
  ],
  "example_text_types": [
    "Short personal emails or messages about past events, daily routines, or future plans.",
    "Simple dialogues in shops (e.g., buying clothes, asking for sizes, returning an item).",
    "Basic descriptions of people's physical appearance, personality, and daily life.",
    "Short, simple narratives about a past experience (e.g., a weekend trip, a memorable meal).",
    "Simple recipes or instructions for everyday tasks.",
    "Short advertisements for local events, products, or services (e.g., cinema listings, supermarket offers).",
    "Simple weather forecasts or reports.",
    "Short, factual texts about familiar topics (e.g., a brief description of a town or a hobby)."
  ],
  "example_exercise_types": [
    "Fill-in-the-blanks with correct verb forms (Aorist, Imperfect, simple Future, basic Subjunctive).",
    "Transform sentences from Present to Aorist or Imperfect, and vice-versa.",
    "Create comparative and superlative forms of given adjectives and adverbs.",
    "Role-play scenarios: Visiting a doctor and describing symptoms, asking for and giving directions, making a simple complaint in a shop, planning an outing with a friend.",
    "Write a short paragraph describing a past event (e.g., 'My last birthday', 'What I did yesterday').",
    "Listening comprehension: Answer specific questions (who, what, where, when, why) about a short dialogue discussing daily routines, past activities, or future plans.",
    "Reading comprehension: Find specific information in a short, simple text (e.g., an email invitation, a simple news item, a short biography).",
    "Sentence building exercises using given vocabulary and grammatical structures (e.g., using object pronouns, possessive pronouns, conjunctions like 'επειδή', 'όταν', 'αν').",
    "Matching exercises: Match vocabulary to definitions, or sentence halves to form coherent sentences."
  ]
}