{
  "level_code": "A1",
  "level_name": "Le Jeune Explorateur",
  "approximate_vocabulary_size": "approx. 500-700 words (expandable with Vocabulaire Essentiel A1)",
  "learning_outcomes": [
    "Can understand and use familiar everyday expressions and very basic phrases aimed at the satisfaction of needs of a concrete type (e.g., introducing oneself, asking for prices, ordering food).",
    "Can introduce him/herself and others and can ask and answer questions about personal details such as where he/she lives, people he/she knows and things he/she has (e.g., name, age, nationality, profession, family).",
    "Can interact in a simple way provided the other person talks slowly and clearly and is prepared to help (e.g., understanding simple instructions, asking for repetition)."
  ],
  "language_focus_topics": [
    "Nouns: Gender (masculine/feminine) and number (singular/plural) - regular forms and common irregulars (e.g., un homme/des hommes, une femme/des femmes, un oeil/des yeux).",
    "Articles: Definite (le, la, l', les), indefinite (un, une, des). Contracted articles (au, aux, du, des).",
    "Articles: Partitive (du, de la, de l', des) - introduction for food/drink and abstract concepts (e.g., de la patience).",
    "Adjectives: Agreement in gender and number with nouns; placement of common descriptive adjectives (before/after noun, e.g. grand, petit, bon, mauvais, beau, nouveau, vieux, joli).",
    "Verbs: Present tense of 'être', 'avoir'.",
    "Verbs: Present tense of regular -er verbs (e.g., parler, habiter, aimer).",
    "Verbs: Present tense of common irregular verbs (e.g., aller, faire, venir, pouvoir, vouloir, prendre, boire, dire, lire, écrire, voir, savoir, mettre, ouvrir, dormir, partir, sortir).",
    "Verbs: Reflexive verbs in the present tense (e.g., s'appeler, se lever, se laver, se coucher).",
    "Basic sentence structure: Subject-Verb-Object (e.g. J'aime le chocolat); Subject-Verb-Adjective (e.g. Je suis content).",
    "Negation: 'ne...pas' around the verb; 'ne...pas de' with partitive articles (e.g. Je n'ai pas de frères).",
    "Questions: Intonation, 'est-ce que', inversion (simple verbs like être, avoir, aller), common question words (où, quand, comment, pourquoi, qui, que, quoi, combien, quel(le)(s)).",
    "Possessive adjectives (mon, ton, son, ma, ta, sa, mes, tes, ses, notre, votre, leur, nos, vos, leurs).",
    "Demonstrative adjectives (ce, cet, cette, ces).",
    "Prepositions of place: à (ville, à la maison), en (pays fém., en France), au (pays masc., au Portugal), dans, sur, sous, chez, devant, derrière, à côté de, près de, loin de.",
    "Numbers: 0-100. Ordinal numbers (premier, deuxième, etc. - basic).",
    "Telling time: 'Quelle heure est-il ? Il est...'. Official and informal time.",
    "Adverbs: Common adverbs of frequency (toujours, souvent, parfois, rarement, jamais), manner (bien, mal, vite, lentement), and quantity (beaucoup, un peu, assez, trop).",
    "Conjunctions: et, ou, mais, parce que, donc, si (simple condition).",
    "Near future: 'aller' + infinitive (e.g., Je vais manger).",
    "Recent past: 'venir de' + infinitive (e.g., Je viens de manger)."
  ],
  "vocabulary_topics": [
    "Theme: Salutations et Présentations (greetings, introductions, farewells, politeness - e.g., enchanté(e), s'il vous plaît, merci).",
    "Theme: Identité et Coordonnées (name, age, nationality, address, phone number, email).",
    "Theme: La Famille et les Relations (immediate and extended family, friends, marital status, describing people simply).",
    "Theme: Nombres (0-100+), Jours, Mois, Saisons, Dates (writing and saying dates).",
    "Theme: L'Heure et les Moments de la journée (matin, midi, après-midi, soir, nuit, hier, aujourd'hui, demain).",
    "Theme: Les Couleurs et Formes de base (rond, carré, triangle).",
    "Theme: La Nourriture et les Boissons (common food/drink items, meals - petit-déjeuner, déjeuner, dîner, quantities, ordering in a café/restaurant, expressing likes/dislikes).",
    "Theme: Les Lieux en Ville (common places: école, magasin, marché, parc, banque, poste, cinéma, restaurant, hôpital, pharmacie, boulangerie, supermarché).",
    "Theme: Les Activités Quotidiennes et les Loisirs (common verbs for daily actions and hobbies: manger, boire, dormir, travailler, étudier, lire, écrire, écouter de la musique, regarder la TV, faire du sport).",
    "Theme: Adjectifs descriptifs (describing people, objects, places - appearance, personality basics - e.g. grand/petit, content/triste, facile/difficile).",
    "Theme: Les Vêtements (common items of clothing for different seasons, basic accessories).",
    "Theme: Les Transports (basic modes of transport: voiture, bus, train, vélo, avion, à pied; asking for/giving simple directions, buying a ticket).",
    "Theme: Le Logement (types of houses/apartments, rooms in a house, basic furniture - table, chaise, lit, armoire).",
    "Theme: Le Corps Humain (basic parts of the body - tête, bras, jambe, main, pied).",
    "Theme: La Météo (basic weather expressions: il fait beau/mauvais/chaud/froid, il pleut, il neige, il y a du soleil/du vent).",
    "Theme: Les Objets de la classe et du quotidien (livre, cahier, stylo, crayon, table, chaise, ordinateur, téléphone)."
  ],
  "pronunciation_focus_topics": [
    "Basic French vowel and consonant sounds, including distinctions like 'u' vs 'ou'.",
    "Nasal vowels (an/am, en/em, in/im/ain/ein/aim, on/om, un/um).",
    "Silent letters (e.g., final 'e', 's', 't', 'd', 'h' initial).",
    "Basic liaison (e.g., 'les amis', 'un‿enfant') and forbidden liaisons (e.g. et // اروپا).",
    "Intonation for statements, yes/no questions, and wh-questions.",
    "Basic rhythm of French sentences."
  ],
  "listening_comprehension_skills": [
    "Understand familiar names, words and very basic phrases concerning myself, my family and immediate concrete surroundings when people speak slowly and clearly.",
    "Recognise familiar words and very basic phrases concerning self, family, and immediate concrete surroundings in short, simple audio announcements or dialogues.",
    "Understand simple instructions related to classroom activities or directions."
  ],
  "reading_comprehension_skills": [
    "Understand familiar names, words and very simple sentences, for example on notices and posters, in catalogues, or short messages (SMS, emails).",
    "Understand short, simple texts containing high frequency vocabulary, such as simple descriptions or personal information."
  ],
  "spoken_interaction_skills": [
    "Interact in a simple way provided the other person is prepared to repeat or rephrase things at a slower rate of speech and help formulate what to say.",
    "Ask and answer simple questions in areas of immediate need or on very familiar topics (e.g., 'Comment allez-vous?', 'Quel âge avez-vous?', 'Où est la gare?').",
    "Make simple transactions in shops (e.g., asking for price, paying)."
  ],
  "spoken_production_skills": [
    "Use simple phrases and sentences to describe where I live and people I know.",
    "Describe his/her family and other people, living conditions, his/her educational background and his/her present or most recent job in simple terms.",
    "Talk about likes and dislikes (e.g., 'J'aime le sport', 'Je n'aime pas le café')."
  ],
  "written_interaction_skills": [
    "Write a short, simple postcard, for example sending holiday greetings.",
    "Fill in forms with personal details, for example entering name, nationality and address on a hotel registration form or a course enrolment form."
  ],
  "written_production_skills": [
    "Write short, simple notes and messages (e.g., a shopping list, a reminder).",
    "Write a very simple personal letter or email, for example thanking someone for something or describing a daily activity."
  ],
  "cultural_competence_topics": [
    "Basic greetings (shaking hands, la bise - awareness), politeness formulas (e.g., bonjour, au revoir, merci, s'il vous plaît, pardon, excusez-moi).",
    "Common French first names and forms of address (tu vs. vous - basic introduction to formal/informal).",
    "Awareness of some major French cities and landmarks (e.g., Paris, Eiffel Tower, a few other cities).",
    "Recognizing common French food items (croissant, baguette, fromage, vin - clichés and realities).",
    "Basic understanding of French meal structure (petit-déjeuner, déjeuner, dîner).",
    "Numbers in everyday contexts (prices, phone numbers)."
  ],
  "learning_strategies_suggestions": [
    "Label objects in the house with their French names (le/la + noun).",
    "Use language learning apps with audio for vocabulary and basic phrases (e.g., Duolingo, Memrise, Anki with French decks).",
    "Listen to simple French children's songs or short A1-level dialogues.",
    "Practice pronunciation with audio resources and try to mimic native speakers.",
    "Create simple flashcards for new words with a picture or a simple sentence.",
    "Try to form simple sentences about your day in French.",
    "Review \"Grammaire Essentielle A1\" and \"Vocabulaire Essentiel A1\" lessons and exercises regularly."
  ],
  "example_conversation_starters": [
    "Bonjour ! Comment tu t'appelles ? / Comment vous appelez-vous ?",
    "Je m'appelle [Nom]. Et toi/vous ?",
    "Ça va ? / Comment allez-vous ?",
    "Quelle est ta nationalité ? / Vous êtes de quelle nationalité ?",
    "Tu habites où ? / Où habitez-vous ?",
    "Qu'est-ce que tu aimes faire le week-end ?",
    "Tu as des frères ou des sœurs ?",
    "Qu'est-ce que tu veux boire/manger ?",
    "C'est combien, s'il vous plaît ?",
    "Où sont les toilettes, s'il vous plaît ?"
  ],
  "example_text_types": [
    "Very short descriptive texts about people or places (e.g., 'Voici Marie. Elle est grande.').",
    "Simple dialogues about daily routines, making plans, or in shops/cafés.",
    "Menus, timetables, simple advertisements, price tags.",
    "Postcards, short personal messages (SMS, simple emails).",
    "Simple forms to fill in (name, address, nationality)."
  ],
  "example_exercise_files": [
    "A1_dialogue_cafe.txt (Simple dialogue ordering food/drinks)",
    "A1_description_famille.txt (Short text describing a family)"
  ],
  "example_exercise_types": [
    "Matching words to pictures (vocabulary).",
    "Fill-in-the-blanks with articles, prepositions, or verb conjugations (present tense of être, avoir, -er verbs, common irregulars).",
    "Answering simple 'qui/que/où/quand/comment/pourquoi' questions about a short text or dialogue (DELF A1 style).",
    "Ordering words to make a sentence.",
    "True/False or multiple-choice questions based on short audio clips or texts (DELF A1 style).",
    "Completing simple forms with personal information.",
    "Writing short sentences to describe a picture or a simple situation.",
    "Role-play: Introducing oneself, ordering food, asking for simple information."
  ]
}