{
  "level_code": "B1",
  "level_name": "Le Globe-trotteur",
  "approximate_vocabulary_size": "approx. 2000-2500 words (expandable with Vocabulaire Essentiel B1)",
  "learning_outcomes": [
    "Can understand the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc. (e.g., understanding conversations, radio news, articles on familiar topics).",
    "Can deal with most situations likely to arise whilst travelling in an area where the language is spoken (e.g., making travel arrangements, handling unexpected problems).",
    "Can produce simple connected text on topics which are familiar or of personal interest (e.g., writing emails, short essays about experiences or opinions).",
    "Can describe experiences and events, dreams, hopes and ambitions and briefly give reasons and explanations for opinions and plans."
  ],
  "language_focus_topics": [
    "Review: Passé Composé vs. Imparfait - mastery of usage for narration and description.",
    "Verbs: Plus-que-parfait (formation and usage for prior past actions).",
    "Verbs: Futur Antérieur (formation and usage for actions completed before a future point - introduction).",
    "Verbs: Conditionnel Présent (expanded use for advice, suggestions, polite requests, hypothetical situations - 'si + imparfait, conditionnel présent').",
    "Verbs: Conditionnel Passé (formation and usage for past unreal conditions, regrets - 'si + plus-que-parfait, conditionnel passé').",
    "Verbs: Subjonctif Présent (formation of regular and common irregular verbs; usage after expressions of will, desire, emotion, doubt, necessity, possibility, opinion - e.g., il faut que, je veux que, je suis content que, il est possible que, je ne pense pas que).",
    "Verbs: Subjonctif Passé (formation and basic usage for past actions in subjunctive contexts).",
    "Pronouns: Emphatic/Stressed pronouns (moi, toi, lui, elle, nous, vous, eux, elles) - various uses, including with 'même' and comparatives.",
    "Pronouns: Double object pronouns (e.g., Il me le donne, Donne-le-moi!) - order and placement with different tenses, including affirmative and negative imperative.",
    "Pronouns: Relative pronouns 'dont' (of which/whom, whose), 'lequel/laquelle/lesquels/lesquelles' (after prepositions, for clarity), 'ce qui', 'ce que', 'ce dont'.",
    "Reported speech (discours indirect): Reporting statements, questions (with 'si', interrogative adverbs/pronouns like 'ce que', 'où', 'quand'), and commands in present and past contexts, including changes in tense, pronouns, and time/place expressions.",
    "Hypothetical sentences (Si clauses): Type 1 (Si + présent, futur simple/présent/impératif), Type 2 (Si + imparfait, conditionnel présent), Type 3 (Si + plus-que-parfait, conditionnel passé).",
    "Passive voice (la voix passive): Formation and use in various tenses (présent, passé composé, imparfait, futur simple). Agent introduced by 'par' or 'de'.",
    "Gerund (le gérondif - en + participe présent): Expressing simultaneity, manner, condition, or cause.",
    "Expressions of cause (parce que, car, comme, puisque, grâce à + noun, à cause de + noun).",
    "Expressions of consequence (donc, alors, par conséquent, c'est pourquoi, si bien que).",
    "Expressions of purpose (pour + infinitif, pour que + subjonctif, afin de + infinitif, afin que + subjonctif).",
    "Expressions of opposition and concession (mais, cependant, pourtant, quand même, bien que + subjonctif, quoique + subjonctif, même si + indicatif, avoir beau + infinitif).",
    "Adverbs of quantity and intensity (très, beaucoup, peu, assez, trop, tellement, tant). Placement of adverbs.",
    "The pronoun 'y' (replacing à + place/thing) and 'en' (replacing de + thing/quantity)."
  ],
  "vocabulary_topics": [
    "Theme: Exprimer des Opinions et des Sentiments (justifying opinions, expressing agreement/disagreement, hopes, regrets, fears, surprise, satisfaction, disappointment).",
    "Theme: Les Études et le Monde du Travail (describing job responsibilities, career plans, academic subjects in more detail, understanding job offers, CV basics, simple job interview phrases).",
    "Theme: Les Voyages et Expériences Culturelles (planning trips, recounting detailed travel narratives, discussing cultural differences and impressions, dealing with travel problems).",
    "Theme: L'Environnement et la Société (discussing common environmental problems - pollution, recycling, social issues - poverty, unemployment, civic life - voting, associations - introductory).",
    "Theme: La Technologie et la Communication (discussing use of internet, social media, common tech devices, advantages/disadvantages, online safety basics).",
    "Theme: La Santé et le Bien-être (discussing healthy lifestyles, common health advice, describing accidents or more complex symptoms, understanding medical instructions).",
    "Theme: Les Médias (types of media, understanding main points of news articles/broadcasts, discussing favorite programs/films/books, expressing opinions on media content).",
    "Theme: Le Caractère et la Personnalité (describing people's characters in more detail, positive and negative traits).",
    "Theme: La Vie Quotidienne (organizing events, making arrangements, dealing with unexpected situations, complaining, making suggestions).",
    "Theme: Les Événements Actuels (discussing simple current events from the news).",
    "Theme: Les Relations Interpersonnelles (friendship, love, conflicts - basic discussion)."
  ],
  "pronunciation_focus_topics": [
    "Rhythm and intonation patterns in longer, more complex sentences, including expressing different emotions.",
    "Nuances of nasal vowels and semi-vowels (e.g., /j/, /w/, /ɥ/).",
    "Impact of silent letters on pronunciation and liaison; more complex liaison rules.",
    "Distinguishing between formal and informal speech patterns (basic awareness of contractions, vocabulary choices).",
    "Stress patterns within word groups and sentences."
  ],
  "listening_comprehension_skills": [
    "Understand the main points of clear standard speech on familiar matters regularly encountered in work, school, leisure, etc. (e.g., conversations, simple presentations, instructions).",
    "Understand the main point of many radio or TV programs on current affairs or topics of personal or professional interest when the delivery is relatively slow and clear.",
    "Follow a lecture or talk within own field, provided the subject matter is familiar and the presentation straightforward and clearly structured."
  ],
  "reading_comprehension_skills": [
    "Understand texts that consist mainly of high frequency everyday or job-related language.",
    "Understand the description of events, feelings and wishes in personal letters and simple narratives.",
    "Scan longer texts in order to locate desired information, and gather information from different parts of a text, or from different texts in order to perform a specific task."
  ],
  "spoken_interaction_skills": [
    "Enter unprepared into conversation on topics that are familiar, of personal interest or pertinent to everyday life (e.g. family, hobbies, work, travel and current events).",
    "Express and sustain personal opinions, providing brief reasons and explanations, and responding to others' viewpoints.",
    "Deal with most situations likely to arise whilst travelling in an area where the language is spoken (e.g., asking for information, explaining a problem, making a complaint)."
  ],
  "spoken_production_skills": [
    "Connect phrases in a simple way in order to describe experiences and events, dreams, hopes and ambitions.",
    "Briefly give reasons and explanations for opinions and plans.",
    "Narrate a story or relate the plot of a book or film and describe personal reactions."
  ],
  "written_interaction_skills": [
    "Write personal letters and emails describing experiences, impressions, and feelings in some detail, asking for and giving news.",
    "Write straightforward connected text on topics which are familiar or of personal interest, asking for or giving information, or expressing opinions."
  ],
  "written_production_skills": [
    "Write simple connected text (e.g., essays, reports, reviews) on a range of familiar subjects or subjects of personal interest.",
    "Write a short, simple essay or report on a topic of interest, presenting information and arguments in a structured way.",
    "Describe dreams, hopes, and ambitions, and explain plans for the future."
  ],
  "cultural_competence_topics": [
    "Understanding of French social etiquette in various common contexts (e.g., dining out, visiting someone's home, invitations, punctuality).",
    "Overview of the French political and educational systems (main structures, key figures/institutions).",
    "Introduction to key aspects of French literature, cinema, and music (major figures or works, common genres).",
    "Awareness of regional diversity in France (e.g., accents, customs, typical products - basic).",
    "Understanding common French media (newspapers, TV channels, radio stations - main ones).",
    "Discussing current events in France (simple topics)."
  ],
  "learning_strategies_suggestions": [
    "Start reading simple authentic articles (e.g., news for learners like \"20 minutes\", blogs on familiar topics).",
    "Watch French TV shows or movies with French subtitles, trying to guess unknown words from context.",
    "Engage in conversations with native speakers, focusing on expressing and justifying opinions, and recounting experiences.",
    "Keep a journal in French to practice narration, description, and expressing feelings.",
    "Practice summarizing texts or audio clips.",
    "Review \"Grammaire Essentielle B1\" and \"Vocabulaire Essentiel B1\" lessons and exercises regularly.",
    "Work through DELF B1 preparation materials and mock exams."
  ],
  "example_conversation_starters": [
    "Qu'est-ce que tu penses de [sujet d'actualité simple, e.g., la météo, un film récent] ? Pourquoi ?",
    "Raconte-moi un voyage intéressant que tu as fait. Qu'est-ce qui t'a plu / déplu ?",
    "Quels sont les avantages et les inconvénients de [la technologie / vivre en ville / travailler à la maison / etc.] ?",
    "Si tu gagnais au loto, qu'est-ce que tu ferais ? Explique tes choix.",
    "Comment peut-on protéger l'environnement au quotidien ? Donne quelques idées.",
    "Quel livre ou film recommandes-tu et pourquoi ? De quoi ça parle ?",
    "Comment décrirais-tu le système éducatif / politique de ton pays (simplement) ?"
  ],
  "example_text_types": [
    "Short newspaper or magazine articles on familiar or current topics (e.g., lifestyle, hobbies, local news).",
    "Personal blog posts, forum entries, or reviews expressing opinions or experiences.",
    "Simplified factual texts on historical events, cultural topics, or social issues.",
    "Instructions or user guides for everyday products or services with some complexity.",
    "Short fictional stories, excerpts from graded readers (B1 level), or simplified literary texts.",
    "Formal and informal letters/emails (e.g., letter of complaint, email to a friend sharing news)."
  ],
  "example_exercise_files": [],
  "example_exercise_types": [
    "Comprehension questions requiring inference, understanding of main ideas, and supporting details from texts and audio (DELF B1 style).",
    "Summarizing paragraphs or short articles in own words.",
    "Exercises on transforming sentences (e.g., active to passive in various tenses, direct to reported speech with tense changes).",
    "Gap-fill exercises focusing on subjunctive mood with different triggers, conditional tenses, relative pronouns (dont, lequel), or double object pronouns.",
    "Role-playing scenarios (e.g., participating in a simple debate, making travel arrangements with complications, discussing pros and cons of a situation, giving advice).",
    "Writing personal letters or emails detailing experiences, giving advice, or expressing feelings with justification and appropriate connectors.",
    "Composing short, structured essays or reports on familiar topics, presenting arguments and counter-arguments simply (e.g., advantages/disadvantages of something).",
    "Identifying and using appropriate connectors to link ideas in sentences and paragraphs."
  ]
}