{
  "level_code": "C1",
  "level_name": "L'Étoile Filante",
  "approximate_vocabulary_size": "approx. 4000-5000+ words (focus on range, precision, and idiomatic language)",
  "learning_outcomes": [
    "Can understand a wide range of demanding, longer texts (articles, literary works, academic papers), and recognise implicit meaning, irony, and stylistic nuances.",
    "Can express him/herself fluently and spontaneously without much obvious searching for expressions, using a rich vocabulary and complex sentence structures.",
    "Can use language flexibly and effectively for social, academic and professional purposes, adapting register and style to the context.",
    "Can produce clear, well-structured, detailed text on complex subjects, showing controlled use of organisational patterns, connectors and cohesive devices to create coherent and persuasive arguments."
  ],
  "language_focus_topics": [
    "Mastery and nuanced application of all previously learned grammatical structures, including fine points of tense and mood usage (e.g., concordance des temps in complex sentences, subtle uses of subjunctive and conditional).",
    "Advanced uses of the subjunctive (e.g., in independent clauses for wishes or commands, after superlatives or unique expressions, in literary styles).",
    "Complex sentence structures: advanced subordination with a wide range of conjunctions, use of participles (présent, passé) to replace clauses, complex nominalization.",
    "Stylistic devices: inversion for emphasis or formal style, various forms of emphasis (mise en relief), figures of speech (metaphor, simile, hyperbole, litotes, irony, euphemism - recognition and appropriate use).",
    "Nuances of register (soutenu, courant, familier, argotique - recognition and appropriate adaptation), tone, and connotation in written and spoken French.",
    "Understanding and using different levels of formality in various social, academic, and professional contexts.",
    "Idiomatic language, proverbs, and cultural references in depth; understanding their origins and appropriate usage.",
    "Rhetorical devices and persuasive language techniques (e.g., structuring an argument, using rhetorical questions, appealing to logic/emotion)."
  ],
  "vocabulary_topics": [
    "Theme: Specialized fields (literature, arts, sciences, politics, economics, philosophy - according to learner's interest and DALF C1 domains).",
    "Theme: Abstract & Philosophical Concepts (in-depth discussion and analysis of concepts like justice, freedom, progress, identity, ethics).",
    "Theme: Cultural Nuances & Social Commentary (understanding and discussing complex societal trends, debates, and cultural phenomena with sophistication).",
    "Advanced idiomatic expressions, collocations, and fixed phrases across various domains, including formal and informal language.",
    "Understanding and using synonyms, antonyms, and nuanced vocabulary with high precision to convey subtle differences in meaning.",
    "Vocabulary for argumentation, debate, formal presentations, academic writing (e.g., structuring essays, theses, reports), and synthesis of documents.",
    "Lexical creativity and wordplay; understanding neologisms and language evolution.",
    "Vocabulary related to specific DALF C1/C2 themes (e.g., work, education, environment, new technologies, health, media, citizenship)."
  ],
  "pronunciation_focus_topics": [
    "Mastery of French phonetics, including subtle distinctions in vowel and consonant sounds, and prosodic features.",
    "Native-like rhythm, stress, and intonation for various communicative intentions (persuasion, irony, conveying emotion).",
    "Adapting pronunciation, intonation, and speech flow to different registers and audiences (formal presentations vs. informal discussions).",
    "Understanding and potentially reproducing features of different French accents (awareness level)."
  ],
  "listening_comprehension_skills": [
    "Understand a wide range of spoken language, including lectures, discussions, debates, and presentations on complex and abstract topics, even if not clearly structured.",
    "Recognise a wide range of idiomatic expressions and colloquialisms, appreciating register shifts and cultural allusions.",
    "Follow extended speech even when it is not clearly structured and when relationships are only implied and not signalled explicitly (e.g., complex arguments, fast-paced native speaker interactions)."
  ],
  "reading_comprehension_skills": [
    "Understand long and complex factual and literary texts, appreciating distinctions of style, tone, and authorial intent.",
    "Understand specialised articles and longer technical instructions, even when they do not relate to his/her field, including abstract and structurally complex texts.",
    "Critically evaluate texts, identifying biases, assumptions, and rhetorical strategies."
  ],
  "spoken_interaction_skills": [
    "Express him/herself fluently and spontaneously without much obvious searching for expressions, adapting language to the interlocutor and situation.",
    "Use language flexibly and effectively for social, academic and professional purposes, including participating actively in meetings and formal discussions.",
    "Formulate ideas and opinions with precision, support them with arguments and examples, and relate his/her contribution skilfully to those of other speakers.",
    "Handle interruptions, manage turn-taking, and clarify misunderstandings effectively."
  ],
  "spoken_production_skills": [
    "Present clear, detailed descriptions or arguments on complex subjects integrating sub-themes, developing particular points with supporting evidence, and rounding off with an appropriate conclusion (e.g., DALF exposé).",
    "Deliver well-structured and engaging presentations on complex topics, adapting style and content to the audience and purpose.",
    "Use intonation and stress effectively to convey nuances of meaning and maintain audience interest."
  ],
  "written_interaction_skills": [
    "Write clear, well-structured texts (e.g., formal letters, emails, contributions to online discussions) on complex subjects, underlining the relevant salient issues and adapting style to the intended reader.",
    "Express him/herself in clear, well-structured text, expressing points of view at some length, and responding appropriately to arguments from others."
  ],
  "written_production_skills": [
    "Write clear, well-structured text on complex subjects (e.g., essays, reports, summaries, synthesis of documents for DALF C1), showing controlled use of organisational patterns, connectors and cohesive devices.",
    "Write about complex subjects in a letter, an essay or a report, underlining what he/she considers to be the salient issues, and developing an argument systematically with supporting points and examples.",
    "Write different kinds of texts in a clear, well-structured style appropriate to the reader in mind, demonstrating command of vocabulary, grammar, and orthography."
  ],
  "cultural_competence_topics": [
    "Deep understanding of French-speaking cultures (France and Francophonie), including regional variations, social structures, and current affairs.",
    "Critical awareness of cultural stereotypes, sociolinguistic norms, and intercultural communication challenges.",
    "Ability to interpret and discuss complex cultural phenomena, historical contexts, and contemporary societal debates in the French-speaking world.",
    "Understanding of the French approach to intellectual debate and argumentation."
  ],
  "learning_strategies_suggestions": [
    "Engage with a wide variety of authentic, complex materials (literature, academic papers, specialized media, quality journalism).",
    "Seek opportunities for high-level discussion and debate with native speakers or advanced learners.",
    "Focus on refining style, register, and precision in language use, paying attention to collocations and idiomaticity.",
    "Practice synthesizing information from multiple sources (written and spoken) for DALF C1 preparation.",
    "Write regularly on complex topics, seeking feedback on structure, argumentation, and language accuracy.",
    "Actively expand vocabulary through reading and noting new expressions, especially those related to abstract concepts and specialized fields.",
    "Prepare for DALF C1 by working through specific exam preparation materials, focusing on all four skills and time management."
  ],
  "example_conversation_starters": [
    "Quelle est votre perspective sur [un enjeu philosophique ou sociétal complexe, e.g., la notion de progrès, l'identité culturelle à l'ère de la mondialisation, les défis de l'intelligence artificielle] ? Quels arguments soutiennent votre point de vue ?",
    "Analysez de manière critique [une œuvre littéraire ou artistique marquante du monde francophone], en considérant son contexte socio-historique, ses thèmes principaux et sa réception.",
    "Comment les structures de pouvoir et les médias influencent-elles le discours public sur [un sujet sensible actuel, e.g., la crise climatique, les inégalités sociales] ?",
    "Développez une argumentation nuancée concernant les implications éthiques de [une avancée scientifique ou technologique récente, e.g., l'édition génomique, la surveillance numérique].",
    "Comparez et contrastez les approches de différents penseurs, écoles de pensée ou politiques publiques sur [un concept abstrait ou un problème de société, e.g., la justice sociale, la gestion des migrations]."
  ],
  "example_text_types": [
    "Authentic, unabridged literary texts (novels, plays, poetry) with complex themes, styles, and historical/cultural context.",
    "Academic articles, research papers, and specialized publications from various fields (humanities, social sciences, sciences).",
    "In-depth journalistic reports, editorials, and opinion pieces from quality newspapers and magazines (e.g., Le Monde Diplomatique, L'Obs, Le Débat).",
    "Formal speeches, lectures, and conference presentations on abstract or specialized topics.",
    "Legal documents (excerpts), official reports, and complex administrative texts.",
    "Texts employing sophisticated rhetoric, irony, satire, or nuanced argumentation requiring careful interpretation.",
    "Transcripts of debates, round-table discussions, or interviews with experts or public figures."
  ],
  "example_exercise_files": [],
  "example_exercise_types": [
    "Critical analysis of literary or argumentative texts: identifying stylistic devices, interpreting symbolism, evaluating arguments, discussing authorial intent and socio-historical context.",
    "Writing academic essays, research summaries, or critical reviews demonstrating advanced analytical, argumentative, and synthesizing skills (DALF C1 'production écrite' - essai/synthèse).",
    "Synthesizing information from multiple complex sources (written and spoken) to produce a coherent, well-structured report or presentation (DALF C1 'synthèse de documents').",
    "Delivering persuasive oral presentations (exposés) on complex topics, adapting style and content to the audience and handling challenging questions (DALF C1 'production orale').",
    "Participating in formal debates or negotiations, employing sophisticated argumentation, rhetorical strategies, and managing interaction effectively.",
    "Advanced translation exercises (French to native language and vice-versa) focusing on nuance, style, register, and cultural equivalence.",
    "Identifying and analyzing different registers, tones, implicit meanings, and cultural allusions in a variety of authentic texts and discourses.",
    "Exercises on recognizing and using sophisticated idiomatic expressions, proverbs, and culturally embedded phrases appropriately.",
    "Tasks requiring creative language use, such as writing pastiches, parodies, or sophisticated dialogues maintaining a specific tone or style.",
    "Editing and proofreading complex texts for grammatical accuracy, stylistic consistency, coherence, and appropriateness of register."
  ]
}