{
  "level_code": "C2",
  "level_name": "Le Caméléon Linguistique",
  "approximate_vocabulary_size": "Extensive vocabulary, approaching that of an educated native speaker (6000+ words, including specialized and nuanced terms)",
  "learning_outcomes": [
    "Can understand with ease virtually everything heard or read, including fast native speech, abstract topics, and complex arguments.",
    "Can summarise information from different spoken and written sources, reconstructing arguments and accounts in a coherent, precise, and stylistically appropriate presentation (e.g., DALF C2 'compte rendu et synthèse').",
    "Can express him/herself spontaneously, very fluently and precisely, differentiating finer shades of meaning even in more complex situations, and using idiomatic expressions and cultural allusions appropriately."
  ],
  "language_focus_topics": [
    "Complete mastery of all grammatical structures, including rare, archaic (for recognition), and highly complex syntactical constructions (e.g., complex inversions, elaborate subordinate clauses).",
    "Full command of different stylistic levels (soutenu, littéraire, standard, familier, argotique), registers, and their pragmatic effects in various contexts.",
    "Sophisticated understanding and use of literary and cultural allusions, wordplay, humor, irony, and sarcasm.",
    "Ability to manipulate language creatively and for specific rhetorical effect (persuasion, argumentation, literary expression).",
    "Understanding of historical and regional variations in French grammar and usage (overview and ability to comprehend variations).",
    "Advanced discourse analysis: understanding text cohesion, coherence, implicatures, and presuppositions.",
    "Mastery of punctuation for stylistic effect and clarity in complex sentences."
  ],
  "vocabulary_topics": [
    "Near-native command of vocabulary across all common, academic, professional, and many specialized domains (e.g., specific terminology in chosen fields of interest for DALF C2).",
    "Effortless understanding and appropriate use of a vast range of idiomatic, colloquial, proverbial, and formal French.",
    "Exceptional precision in word choice to convey subtle nuances, irony, subtext, and specific connotations.",
    "Vocabulary related to highly specialized or technical fields if relevant to the learner's academic or professional goals.",
    "Understanding etymology and evolution of words (basic awareness to appreciate nuances and connections).",
    "Lexicon of argumentation, rhetoric, and literary criticism."
  ],
  "pronunciation_focus_topics": [
    "Native-like or near-native pronunciation, intonation, and rhythm, with natural flow and expressiveness.",
    "Ability to subtly vary pronunciation, intonation, and speaking style to convey attitude, emotion, or to mimic regional variations if desired for specific effects.",
    "Mastery of prosodic features to structure discourse and highlight key information in oral presentations or discussions."
  ],
  "listening_comprehension_skills": [
    "Have no difficulty in understanding any kind of spoken language, whether live or broadcast, even when delivered at fast native speed, provided he/she has some time to get familiar with the accent (e.g., lectures, debates, films, plays, complex media broadcasts).",
    "Appreciate stylistic nuances, humor, irony, and cultural references in spoken discourse."
  ],
  "reading_comprehension_skills": [
    "Read with ease virtually all forms of the written language, including abstract, structurally or linguistically complex texts such as manuals, specialised articles and literary works (classic and contemporary).",
    "Critically analyze and interpret complex texts, identifying underlying assumptions, authorial stance, and rhetorical strategies."
  ],
  "spoken_interaction_skills": [
    "Take part effortlessly in any conversation or discussion and have a good familiarity with idiomatic expressions and colloquialisms, using them appropriately.",
    "Express him/herself fluently and convey finer shades of meaning precisely, reformulating ideas to suit the context and interlocutor.",
    "Backtrack and restructure around any difficulty so smoothly that other people are hardly aware of it, maintaining a natural flow of conversation."
  ],
  "spoken_production_skills": [
    "Present a clear, smoothly-flowing, and engaging description or argument in a style appropriate to the context and with an effective logical structure which helps the recipient to notice and remember significant points (e.g., DALF C2 'production orale' - exposé based on documents).",
    "Develop arguments with sophistication, using a wide range of linguistic resources and rhetorical devices.",
    "Adapt language register and style effectively to different audiences and purposes."
  ],
  "written_interaction_skills": [
    "Write clear, smoothly flowing text in an appropriate style for various purposes (e.g., formal correspondence, academic debate, creative writing).",
    "Communicate complex ideas and relationships with precision, clarity, and stylistic elegance.",
    "Respond effectively to complex written input, addressing all nuances and maintaining an appropriate tone."
  ],
  "written_production_skills": [
    "Write clear, smoothly-flowing complex texts (e.g., articles, reports, essays, literary critiques, synthesis of multiple documents for DALF C2) in an appropriate and effective style and a logical structure which helps the reader to find significant points.",
    "Write reviews of professional or literary works, summaries of complex texts, demonstrating critical thinking and advanced writing skills.",
    "Demonstrate a high degree of grammatical accuracy, orthographic precision, and sophisticated vocabulary and sentence structure."
  ],
  "cultural_competence_topics": [
    "Profound and nuanced understanding of French-speaking cultures, their diversity, historical evolution, and contemporary socio-political contexts.",
    "Ability to mediate effectively between cultures, explaining cultural nuances and perspectives.",
    "Sophisticated understanding of humor, irony, cultural subtext, and implicit references in Francophone media and literature.",
    "Critical engagement with major intellectual and artistic currents in the French-speaking world."
  ],
  "learning_strategies_suggestions": [
    "Maintain language skills through continuous immersion and active use in diverse and intellectually stimulating contexts.",
    "Engage in advanced studies, professional work, or creative projects requiring a high level of French proficiency.",
    "Explore niche areas of French language, literature, and culture based on personal or professional interests.",
    "Contribute to French-language forums, publications, or academic discussions.",
    "Provide mentorship or guidance to less advanced learners.",
    "Prepare for DALF C2 by practicing integrated skills tasks (e.g., synthèse de documents followed by an exposé and debate) and engaging with C2-level authentic materials."
  ],
  "example_conversation_starters": [
    "Engagez une discussion sur les subtilités de la traduction de l'humour, de la poésie ou de concepts philosophiques entre le français et [autre langue], en illustrant avec des exemples concrets.",
    "Proposez une analyse stylistique comparée de deux auteurs francophones de périodes ou de genres différents, en relevant les particularités de leur écriture et leur apport à la littérature.",
    "Débattez des limites de la liberté d'expression dans un contexte multiculturel complexe, en utilisant un langage précis, en anticipant les contre-arguments et en proposant des solutions nuancées.",
    "Comment la langue française a-t-elle évolué pour refléter les changements sociétaux au cours du dernier siècle ? Illustrez avec des exemples précis de néologismes, d'emprunts ou de changements sémantiques.",
    "Présentez et défendez une thèse originale sur un aspect peu exploré de [un domaine de votre expertise en français, e.g., une problématique scientifique, un courant artistique, une question de politique internationale]."
  ],
  "example_text_types": [
    "Highly specialized academic papers, research monographs, and theoretical treatises from diverse disciplines.",
    "Classic and contemporary literary works of significant complexity and cultural depth, including poetry, avant-garde texts, and philosophical writings.",
    "Philosophical essays, critical theory, and other abstract intellectual discourses requiring deep comprehension.",
    "Complex legal texts, international treaties, detailed policy documents, and high-level administrative texts.",
    "Historical documents and archival materials requiring interpretation and contextual understanding.",
    "Texts involving subtle humor, wordplay, irony, satire, and multiple layers of meaning that demand sophisticated interpretation.",
    "Speeches and writings by prominent intellectuals, political figures, or historical figures, requiring contextual and rhetorical analysis.",
    "Linguistically diverse materials, including texts with regional dialects, historical sociolects, or highly specialized jargon (for analysis and comprehension)."
  ],
  "example_exercise_files": [],
  "example_exercise_types": [
    "Producing original research or extended essays demonstrating mastery of academic French, critical thought, and sophisticated argumentation (DALF C2 style).",
    "Comparative literary analysis of multiple complex works, potentially across different periods, genres, or cultural contexts, focusing on stylistic and thematic nuances.",
    "Crafting sophisticated written pieces in various genres (e.g., formal proposals, persuasive manifestos, satirical articles, detailed critiques, policy briefs) for specific audiences and purposes.",
    "Delivering master-level oral presentations, lectures, or participating in high-level academic/professional panels with articulate, nuanced, and persuasive contributions.",
    "Leading and moderating complex discussions or debates, skillfully managing diverse viewpoints, synthesizing arguments, and guiding the conversation towards productive outcomes.",
    "Professional translation and interpretation tasks requiring exceptional linguistic precision, cultural sensitivity, and stylistic adaptability (e.g., literary translation, simultaneous interpreting of complex discourse).",
    "Analyzing and deconstructing rhetorical strategies, implicit biases, and ideological underpinnings in complex political, legal, or media discourses.",
    "Tasks involving creative writing at a very high level, demonstrating stylistic versatility, originality, and a profound command of the language's resources (e.g., short stories, poetry, playwriting, screenwriting excerpts).",
    "Critical discourse analysis of texts, identifying underlying ideologies, power dynamics, cultural assumptions, and their linguistic manifestations.",
    "Mentoring or teaching others advanced aspects of French, explaining complex linguistic, stylistic, and cultural points with clarity and precision."
  ]
}