{
  "level_code": "A2",
  "level_name": "L'Apprenti Sorcier",
  "approximate_vocabulary_size": "approx. 1000-1200 words (expandable with Vocabulaire Essentiel A2)",
  "learning_outcomes": [
    "Can understand sentences and frequently used expressions related to areas of most immediate relevance (e.g. very basic personal and family information, shopping, local geography, employment, daily routines).",
    "Can communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters (e.g., asking for directions, making purchases, describing past events).",
    "Can describe in simple terms aspects of his/her background (e.g., education, work), immediate environment and matters in areas of immediate need (e.g., health, travel)."
  ],
  "language_focus_topics": [
    "Review: Present tense (regular & common irregular verbs), articles, noun/adjective agreement.",
    "Verbs: Passé composé with 'avoir' and 'être' (including agreement of past participle with 'être' and preceding direct objects with 'avoir'). Common irregular past participles (e.g., eu, été, fait, allé, venu, pris, bu, dit, lu, écrit, vu, su, pu, voulu, dû, ouvert, mort, né).",
    "Verbs: Imparfait (formation and usage for descriptions, habitual actions in the past, ongoing past actions). Introduction to contrast between Passé Composé and Imparfait.",
    "Verbs: Futur simple (formation for regular and common irregular verbs; usage for future plans and predictions). Contrast with Futur Proche.",
    "Verbs: Conditionnel présent (formation; usage for polite requests - 'je voudrais', hypothetical situations - basic 'si' clauses like 'Si j'avais de l'argent, j'achèterais...').",
    "Verbs: Impératif (affirmative and negative commands for common verbs - tu, nous, vous forms, including reflexive verbs).",
    "Verbs: Pronominal verbs (reflexive, reciprocal) in present, passé composé, imparfait, and futur simple.",
    "Pronouns: Direct object pronouns (me, te, le, la, l', nous, vous, les) - placement before conjugated verb, with imperative, in passé composé.",
    "Pronouns: Indirect object pronouns (me, te, lui, nous, vous, leur) - placement, distinction from direct object pronouns.",
    "Pronouns: Stressed/disjunctive pronouns (moi, toi, lui, elle, nous, vous, eux, elles) after prepositions, for emphasis, with 'aussi' and 'non plus'.",
    "Pronouns: Relative pronouns 'qui' (subject), 'que' (direct object), 'où' (place, time). Introduction to 'dont' (of which/whom - basic).",
    "Adjectives: Comparative forms (plus...que, moins...que, aussi...que). Superlative forms (le/la/les plus..., le/la/les moins...). Irregular comparatives/superlatives (bon/meilleur/le meilleur, mauvais/pire/le pire, bien/mieux/le mieux).",
    "Adverbs: Formation of adverbs from adjectives (e.g., -ment). Common adverbs of manner, time, and place. Placement of adverbs (especially with Passé Composé).",
    "Prepositions: Of place (sur, sous, dans, devant, derrière, entre, à côté de, près de, loin de, chez, en face de). Of time (avant, après, pendant, depuis, il y a + time, dans + future time). Of movement (à, de, en, par, jusqu'à).",
    "Negative sentences: 'ne...pas', 'ne...jamais', 'ne...plus', 'ne...rien', 'ne...personne', 'ne...que' (restriction).",
    "Questions: Interrogative pronouns (qui, que, quoi - after preposition), interrogative adjectives (quel(le)(s)), interrogative adverbs (où, quand, comment, pourquoi, combien). Inversion with subject pronouns for more complex questions and with subject nouns (simple cases).",
    "Connectors: pour (purpose), parce que (cause), quand (time), comme (comparison/cause), si (condition), alors, donc (consequence), mais, cependant (opposition)."
  ],
  "vocabulary_topics": [
    "Theme: Décrire les Personnes (physical descriptions, character traits - expanded, e.g., sympa, timide, sportif).",
    "Theme: Les Vêtements et Accessoires (types of clothes for different occasions, accessories like chapeau, écharpe, gants, materials - coton, laine).",
    "Theme: La Routine Quotidienne et les Habitudes (describing past and future daily actions in more detail, frequency).",
    "Theme: Les Transports et les Voyages (means of transport, at the station/airport, buying tickets, asking for travel information, understanding announcements).",
    "Theme: La Santé et les Petits Problèmes (common illnesses - rhume, grippe, mal de tête/gorge/ventre, symptoms, parts of the body, at the doctor's/pharmacy, giving simple advice).",
    "Theme: La Nourriture et les Boissons (types of food, meals, recipes - simple, quantities, shopping for food, in a restaurant - full interaction, understanding a menu).",
    "Theme: Le Logement (types of housing, rooms, furniture, describing one's home, simple household chores).",
    "Theme: Les Loisirs et les Sports (hobbies, sports - individual/team, cultural activities - cinema, concert, museum, making plans, expressing preferences).",
    "Theme: L'École et le Travail (school subjects, places in school, common jobs, work-related tasks - basic, applying for a simple job).",
    "Theme: Expressions de Temps (yesterday, tomorrow, last week/month/year, next week/month/year, specific times, duration - pendant, depuis).",
    "Theme: Expressions de Quantité (un peu de, beaucoup de, assez de, trop de, plusieurs, quelques).",
    "Theme: Faire des Achats (shops, products, asking for prices, paying, asking for help in a shop).",
    "Theme: Invitations et Réponses (inviting someone, accepting/refusing an invitation)."
  ],
  "pronunciation_focus_topics": [
    "Distinction between similar sounds (e.g., /y/ vs /u/, /e/ vs /ɛ/, /o/ vs /ɔ/, voiced vs. unvoiced consonants like /s/ vs /z/).",
    "Liaison: Required, forbidden, and common optional liaisons.",
    "Enchaînement (vowel-vowel and consonant-vowel) for smoother speech.",
    "Intonation in different types of questions, exclamations, and expressing simple emotions (surprise, doubt).",
    "The letter 'h' (muet vs. aspiré - basic awareness for liaison)."
  ],
  "listening_comprehension_skills": [
    "Understand phrases and the highest frequency vocabulary related to areas of most immediate personal relevance (e.g. very basic personal and family information, shopping, local area, employment, daily routines).",
    "Catch the main point in short, clear, simple messages and announcements (e.g., public transport, shop announcements).",
    "Understand simple directions and instructions."
  ],
  "reading_comprehension_skills": [
    "Read very short, simple texts (e.g., personal emails, advertisements, simple instructions).",
    "Find specific, predictable information in simple everyday material such as advertisements, prospectuses, menus and timetables, and short official documents.",
    "Understand short simple personal letters and messages about familiar topics."
  ],
  "spoken_interaction_skills": [
    "Communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar topics and activities.",
    "Handle very short social exchanges, even if I can’t usually understand enough to keep the conversation going myself (e.g., greetings, leave-taking, thanking, apologizing).",
    "Ask for and give directions; make simple purchases."
  ],
  "spoken_production_skills": [
    "Use a series of phrases and sentences to describe in simple terms family and other people, living conditions, educational background and present or most recent job.",
    "Describe past activities and personal experiences (e.g., what I did yesterday, a memorable event).",
    "Briefly give reasons and explanations for opinions, plans and actions."
  ],
  "written_interaction_skills": [
    "Write short, simple notes and messages relating to matters in areas of immediate need (e.g., a note to a colleague, a text message to a friend).",
    "Write a very simple personal letter or email, for example thanking someone for something or making simple arrangements (e.g., suggesting a meeting time/place)."
  ],
  "written_production_skills": [
    "Write a series of simple phrases and sentences linked with simple connectors like 'et', 'mais', 'parce que', 'alors'.",
    "Write short, simple descriptions of events, past activities and personal experiences.",
    "Describe plans and arrangements."
  ],
  "cultural_competence_topics": [
    "Common French customs and politeness (e.g., greetings, 'la bise', tu/vous usage in different contexts - more nuanced).",
    "Basic knowledge of French geography, major cities, and regions (identifying them on a map).",
    "Introduction to common French holidays (e.g., Bastille Day, Christmas, Easter) festivals, and traditions (e.g., food associated with holidays).",
    "Understanding simple public signs and common abbreviations in daily life.",
    "Basic table manners in France.",
    "Awareness of common stereotypes (and how to be respectful)."
  ],
  "learning_strategies_suggestions": [
    "Use flashcards with example sentences for new vocabulary and grammar points (Passé Composé, Imparfait).",
    "Listen to A2-level French podcasts or short news segments (e.g., RFI Savoirs - Journal en français facile excerpts).",
    "Practice speaking with a partner or tutor, focusing on describing past and future events, and simple interactions.",
    "Watch short French videos or cartoons with French subtitles if available, or English subtitles to begin.",
    "Try to write short paragraphs about your day or weekend in French.",
    "Review \"Grammaire Essentielle A2\" and \"Vocabulaire Essentiel A2\" lessons and exercises regularly.",
    "Practice with DELF A2 sample exam papers."
  ],
  "example_conversation_starters": [
    "Qu'est-ce que tu as fait hier soir / le week-end dernier ?",
    "Qu'est-ce que tu vas faire demain / pendant les vacances ?",
    "Parle-moi de ton travail ou de tes études. Qu'est-ce que tu fais exactement ?",
    "Comment est-ce que tu fêtes [nom d'une fête française/locale] dans ta famille / ton pays ?",
    "Si tu pouvais voyager, où irais-tu et pourquoi ? Qu'est-ce que tu ferais là-bas ?",
    "Tu te sens bien ? Qu'est-ce qui ne va pas ? (explaining simple health problems)",
    "Quel est ton plat préféré ? Peux-tu me dire comment on le prépare (simplement) ?",
    "Excusez-moi, je cherche [un lieu]. Pouvez-vous m'aider ?",
    "Je voudrais acheter [un objet]. Combien ça coûte ?"
  ],
  "example_text_types": [
    "Short descriptive paragraphs about people, places, or past/future events (e.g., 'Mon week-end dernier').",
    "Simple personal emails, text messages, or forum posts about familiar topics.",
    "Short dialogues about everyday situations (e.g., making an appointment, asking for help, shopping).",
    "Public signs, notices, and simple instructions (e.g., for a machine, a recipe, safety warnings).",
    "Short, simplified news items or factual texts on familiar topics (e.g., local events, weather forecast)."
  ],
  "example_exercise_files": [
    "A2_exercice_passe_compose.txt (Fill-in-the-blanks with Passé Composé)",
    "A2_exercice_imparfait_description.txt (Describe a picture using Imparfait)",
    "A2_comprehension_orale_annonce.txt (Questions on a short public announcement)"
  ],
  "example_exercise_types": []
}