{
  "level_code": "A2",
  "level_name": "Desker/ez Kalan (Skillful Apprentice)",
  "approximate_vocabulary_size": "approx. 1000-1500 words",
  "learning_outcomes": [
    "Can understand sentences and frequently used expressions related to areas of most immediate relevance (e.g. very basic personal and family information, shopping, local geography, employment).",
    "Can communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.",
    "Can describe in simple terms aspects of his/her background, immediate environment and matters in areas of immediate need."
  ],
  "language_focus_topics": [
    "Review A1: Plurals, basic tenses (present, past, future), common mutations (soft, spirant), possessives, simple prepositions.",
    "Verbs: Imperfect tense (Amzer dremenet amstrizh - e.g., -e,-es,-e,-emp,-ec'h,-ent). Conditional mood (Amzer divizout - e.g., -fe,-fes,-fe,-femp,-fec'h,-fent).",
    "Verbs: Common irregular verbs (mont - to go, dont - to come, ober - to do, gallout - can, gouzout - know) in present, past, future, conditional.",
    "Consonant Mutations: Hard mutation (kemmadur kalet) after 'ho', 'az'. Mixed mutation (kemmadur mesket). Reinforce all four mutations in context.",
    "Pronouns: Inflected prepositions (full paradigm for common ones like 'gant', 'da', 'evit'). Object pronouns (direct/indirect - often expressed with inflected prepositions or word order).",
    "Adjectives: Comparative (-oc'h) and superlative (-añ) forms. Agreement and position.",
    "Adverbs: Formation from adjectives (e.g., with 'mod' or 'doare'). Adverbs of time, place, manner, frequency.",
    "Numbers: Up to 1000. Using numbers with nouns (mutations may apply).",
    "Relative clauses (simple, with 'a', 'hag a')."
  ],
  "vocabulary_topics": [
    "Review A1 vocabulary.",
    "Describing people: Personality, character, feelings, relationships.",
    "Housing: Describing one's home, neighborhood, advantages/disadvantages.",
    "Food & Drink: Discussing meals, recipes, local specialties, food shopping.",
    "Shopping: Clothes, other goods, comparing items, asking for advice, making complaints.",
    "Travel & Transport: Planning trips, means of transport, accommodation, asking for detailed information, describing past trips.",
    "Health & Body: Common health problems, visiting a doctor, giving simple advice.",
    "Work & Study: Describing job/studies, tasks, responsibilities, future plans.",
    "Leisure & Hobbies: Discussing interests in detail, arranging activities, opinions on cultural events.",
    "Nature & Environment: Describing landscapes, local flora/fauna, simple environmental concerns.",
    "Feelings & Emotions: Expressing a wider range of emotions and opinions.",
    "Daily life and routines: More complex sequences, discussing habits."
  ],
  "pronunciation_focus_topics": [
    "Review A1: All sounds, mutations, stress, intonation.",
    "Intonation in conditional and more complex sentences.",
    "Connected speech: assimilation, elision, and linking sounds for smoother speech.",
    "Pronunciation of longer words with multiple suffixes.",
    "Recognizing key features of major dialect groups (KLT vs. Vannetais - basic differences in pronunciation)."
  ],
  "listening_comprehension_skills": [
    "Understand the main points of clear standard speech on familiar topics.",
    "Follow short narratives or simple conversations between native speakers if the topic is familiar and speech is relatively clear.",
    "Identify specific information in public announcements or short news items on familiar subjects."
  ],
  "reading_comprehension_skills": [
    "Understand short personal letters, emails, or simple articles on familiar topics.",
    "Find specific information in everyday materials like brochures, event schedules, or simple official notices.",
    "Understand the main ideas of simplified newspaper articles or website texts."
  ],
  "spoken_interaction_skills": [
    "Engage in conversations on familiar topics, exchanging information, opinions, and personal feelings.",
    "Handle most routine situations encountered in daily life or while travelling in Brittany.",
    "Make and respond to suggestions, invitations, apologies, and express thanks with more elaboration.",
    "Discuss past experiences and future plans, providing details and reasons."
  ],
  "spoken_production_skills": [
    "Give simple, connected descriptions of people, places, events, or personal experiences.",
    "Narrate a simple story or recount events in sequence, using appropriate tenses and linking words.",
    "Talk about future plans, intentions, and possibilities with more detail.",
    "Express opinions and preferences, providing simple justifications and examples."
  ],
  "written_interaction_skills": [
    "Write simple personal emails or messages to exchange information, make arrangements, or express feelings, providing some details."
  ],
  "written_production_skills": [
    "Write short, connected texts on familiar topics (e.g., describing a local event, a personal interest).",
    "Write a simple personal letter giving news or describing experiences in a few paragraphs.",
    "Write short instructions or a simple report on a familiar activity."
  ],
  "cultural_competence_topics": [
    "Breton traditions and folklore (e.g., Ankou, korrigans - basic awareness).",
    "Significance of the Breton language revival movement.",
    "Introduction to well-known Breton writers or musicians (e.g., Alan Stivell - basic).",
    "Traditional Breton costumes and symbols.",
    "Geography of Brittany: main towns and regions (broioù).",
    "The role of Fest-noz in Breton culture."
  ],
  "learning_strategies_suggestions": [
    "Systematically practice all four consonant mutations with different triggers.",
    "Read simple Breton folk tales or modern short stories for learners.",
    "Listen to Breton radio online or podcasts for learners.",
    "Try to write short descriptive paragraphs or dialogues.",
    "If possible, interact with Breton speakers or join a conversation group."
  ]
}