{
  "level_code": "C2",
  "level_name": "Pennfolenner/ez ar Yezh (Language Virtuoso)",
  "approximate_vocabulary_size": "approx. 15000+ words",
  "learning_outcomes": [
    "Can understand with ease virtually everything heard or read.",
    "Can summarise information from different spoken and written sources, reconstructing arguments and accounts in a coherent presentation.",
    "Can express him/herself spontaneously, very fluently and precisely, differentiating finer shades of meaning even in more complex situations."
  ],
  "language_focus_topics": [
    "Complete mastery of all Breton grammatical structures, including rare, complex, literary, and dialectal forms, and their stylistic implications.",
    "Sophisticated and creative use of syntax for optimal stylistic effect and rhetorical impact.",
    "Full command of all moods and their subtle applications.",
    "Nuanced understanding and masterful application of aspectual distinctions and verbal nuances.",
    "Advanced and flexible use of all non-finite forms for sophisticated and concise expression.",
    "Complete and intuitive control over discourse markers and cohesive devices.",
    "Understanding, appreciation, and creative use of a wide array of rhetorical figures and stylistic devices.",
    "Ability to analyze, deconstruct, and explain complex grammatical structures with expert precision."
  ],
  "vocabulary_topics": [
    "Extensive, profound, and dynamic vocabulary approaching that of an educated native Breton speaker, including low-frequency words and specialized terminology.",
    "Full command of idiomatic language, proverbs, colloquialisms, and cultural sayings.",
    "Ability to understand and use the finest shades of meaning, connotations, and register for virtually any lexical item.",
    "Mastery of word formation processes, including understanding of historical Celtic and French influences.",
    "Vocabulary for discussing any abstract, philosophical, scientific, literary, or artistic topic with precision and depth.",
    "Appreciation and understanding of etymology and semantic evolution of Breton words.",
    "Recognition and understanding of a wide range of regionalisms and sociolects."
  ],
  "pronunciation_focus_topics": [
    "Native-like or indistinguishable-from-native pronunciation, intonation, stress, and rhythm across all registers and styles.",
    "Ability to subtly and effectively vary prosody to convey complex attitudes, emotions, irony, and humor.",
    "Effortless and natural handling of all aspects of connected speech, even at rapid native speed or with dialectal variations.",
    "Ability to understand, analyze, and accurately reproduce or imitate various Breton accents and sociolects."
  ],
  "listening_comprehension_skills": [
    "Understand any kind of spoken Breton, whether live or broadcast, even when delivered at fast native speed or with strong dialectal features.",
    "Follow complex interactions between multiple speakers in any setting, identifying subtle cues and implicit meanings.",
    "Appreciate stylistic nuances, register shifts, irony, humor, and implicit meaning in any spoken discourse."
  ],
  "reading_comprehension_skills": [
    "Understand and critically interpret all forms of written Breton, including abstract, structurally or linguistically complex texts from various periods and genres.",
    "Appreciate fine distinctions of style, tone, authorial intent, and literary or rhetorical devices.",
    "Read and understand texts from different historical periods and diverse cultural contexts within Brittany."
  ],
  "spoken_interaction_skills": [
    "Take part effortlessly, fluently, and engagingly in any conversation or discussion, using idiomatic expressions and cultural references naturally and appropriately.",
    "Express him/herself with precision, eloquence, and charisma, differentiating the finest shades of meaning, and reformulating ideas smoothly and effectively.",
    "Argue a complex case, negotiate, persuade, and mediate effectively in any formal or informal setting.",
    "Adapt language and style appropriately and dynamically to any audience, context, and purpose with complete flexibility."
  ],
  "spoken_production_skills": [
    "Present a clear, smoothly-flowing, well-structured, and engaging description, argument, or narrative in an appropriate and compelling style on any complex subject.",
    "Develop points cohesively, logically, and persuasively, with masterful use of organizational patterns and sophisticated cohesive devices.",
    "Deliver presentations, lectures, or speeches with clarity, precision, eloquence, and engaging style.",
    "Use rhetorical devices effectively and creatively."
  ],
  "written_interaction_skills": [
    "Write any type of correspondence or document with complete command of style, tone, register, and persuasive techniques.",
    "Engage in complex written discussions or collaborations, conveying nuanced ideas effectively and persuasively."
  ],
  "written_production_skills": [
    "Write clear, smoothly-flowing, complex, and sophisticated texts in an appropriate and effective style, demonstrating originality and critical insight.",
    "Select and use a vast range of linguistic resources to express ideas precisely, persuasively, or artistically.",
    "Demonstrate mastery of organizational patterns, paragraphing, and cohesive devices to ensure clarity and impact at a professional or academic level.",
    "Write insightful summaries, critiques, or syntheses of complex information, adding original perspectives."
  ],
  "cultural_competence_topics": [
    "Profound, nuanced, and critical understanding of Breton culture, society, history, arts, literature, and traditions.",
    "Ability to function with complete ease and cultural sensitivity in any Breton-speaking environment.",
    "Capacity to act as a cultural interpreter or mediator, explaining subtle and complex cultural nuances.",
    "Deep and critical understanding of contemporary socio-political issues, cultural debates, and intellectual currents related to Brittany and the Breton language."
  ],
  "learning_strategies_suggestions": [
    "Maintain and expand language proficiency through continuous, high-level intellectual and creative engagement with diverse and complex authentic Breton materials.",
    "Engage in original scholarly research, critical analysis, or creative production in Breton.",
    "Contribute to Breton-language publications, academic conferences, or cultural initiatives.",
    "Reflect critically on and refine personal language use for optimal effectiveness and stylistic expression.",
    "Explore highly specialized areas of interest in great depth in Breton, potentially contributing original work or preserving linguistic heritage."
  ]
}