{
  "level_code": "A1",
  "level_name": "Փոքրիկ Հետախույզ (Little Explorer)",
  "approximate_vocabulary_size": "approx. 500-700 words",
  "learning_outcomes": [
    "Can understand and use familiar everyday expressions and very basic phrases aimed at the satisfaction of needs of a concrete type.",
    "Can introduce him/herself and others and can ask and answer questions about personal details such as where he/she lives, people he/she knows and things he/she has.",
    "Can interact in a simple way provided the other person talks slowly and clearly and is prepared to help."
  ],
  "language_focus_topics": [
    "Review A0: Alphabet, basic pronunciation, nominative case, 'to be' verb.",
    "Nouns: Cases - Nominative, Genitive (-ի, -ու, -վա, -ոջ), Dative (same as Genitive), Accusative (often same as Nominative for inanimates, Genitive/Dative for animates - basic patterns). Ablative (-ից). Instrumental (-ով). Locative (-ում). Singular forms of common declension types.",
    "Nouns: Plural formation (-եր, -ներ) and basic plural case endings.",
    "Adjectives: Basic agreement with nouns (often invariable or simple endings like -ի for genitive). Position (usually before the noun).",
    "Pronouns: Personal pronouns in basic cases (Genitive: իմ, քո, նրա). Possessive pronouns (as adjectives).",
    "Verbs: Present tense conjugation of common verbs (e.g., -ում եմ, -ում ես, -ում է type and -ամ, -աս, -ա type).",
    "Verbs: Past tense (Imperfect: -ում էի; Aorist/Simple Past: -եցի, -ացա for common verbs - basic introduction).",
    "Verbs: Future tense ( պիտի + present subjunctive form or -ելու եմ construction).",
    "Postpositions: Common postpositions (հետ - with, համար - for, մասին - about, մեջ - in).",
    "Adverbs of time, place, manner.",
    "Numbers: 0-100. Basic ordinal numbers (առաջին, երկրորդ...)."
  ],
  "vocabulary_topics": [
    "Review A0 vocabulary.",
    "Personal information: Family members (extended: պապիկ, տատիկ), age, profession.",
    "Daily routine: Describing typical daily activities.",
    "Food & Drink: Common food items, drinks, meals (նախաճաշ, ճաշ, ընթրիք), ordering in a café/restaurant.",
    "Shopping: Types of shops (խանութ), common items, prices, quantities.",
    "Places in town: փողոց, հրապարակ, այգի, թանգարան, եկեղեցի, դպրոց, համալսարան.",
    "Transport: автобус, տրոլեյբուս, մետրո, տաքսի. Buying tickets.",
    "Time: Telling the time, days of the week, months, seasons, dates.",
    "Weather: Describing weather conditions (տաք է, ցուրտ է, անձրև է գալիս, ձյուն է գալիս).",
    "Hobbies & interests (կարդալ, նկարել, երգել, սպորտով զբաղվել).",
    "Clothing: Common items."
  ],
  "pronunciation_focus_topics": [
    "Review A0 sounds, especially the three-way distinction of stops/affricates.",
    "Pronunciation of noun case endings and verb conjugations.",
    "Word stress and sentence intonation for questions and statements.",
    "Linking sounds in connected speech (basic).",
    "Distinguishing sounds that might be confused by learners."
  ],
  "listening_comprehension_skills": [
    "Understand frequently used words and phrases related to personal details, family, shopping, local area, when spoken slowly and clearly.",
    "Grasp the main point in short, clear, simple messages and announcements.",
    "Understand simple questions and instructions related to everyday situations."
  ],
  "spoken_interaction_skills": [
    "Interact in simple, routine situations (e.g., basic shopping, ordering food, asking for simple directions).",
    "Ask and answer questions about familiar topics (daily life, hobbies, family, preferences).",
    "Make and respond to simple suggestions or invitations.",
    "Ask for and give basic information about time, quantity, and price."
  ],
  "spoken_production_skills": [
    "Describe his/her family, other people, living conditions, and daily routine in simple terms.",
    "Talk about likes and dislikes.",
    "Describe simple past events using basic past tense forms.",
    "Express simple future plans."
  ],
  "written_interaction_skills": [
    "Write a simple reply to a personal message or invitation."
  ],
  "written_production_skills": [
    "Write short, simple notes, messages, or postcards.",
    "Describe a familiar place, person, or daily routine in a few simple, connected sentences.",
    "Fill in simple forms with personal details."
  ],
  "cultural_competence_topics": [
    "Forms of address: distinguishing between 'դու' and 'Դուք'.",
    "Basic Armenian customs related to meals and hospitality.",
    "Awareness of major Armenian holidays (e.g., Easter/Զատիկ, New Year/Ամանոր, Vardavar - basic).",
    "Armenian cuisine: common dishes (e.g., լավաշ, տոլմա, խորոված - recognition).",
    "Importance of family and respect for elders."
  ],
  "learning_strategies_suggestions": [
    "Practice noun declensions for common nouns.",
    "Use language learning apps with Armenian dialogues and vocabulary builders.",
    "Listen to Armenian music and try to follow simple lyrics.",
    "Try to form simple sentences about your daily life using different cases and tenses."
  ]
}